Repository: fran6p/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Beaglebone.po
Languages: pt_br

source: This document describes the process of running Klipper on a Beaglebone PRU.
pt_br: Este documento descreve o processo para executar o Klipper em um Beaglebone PRU.

source: Building an OS image
pt_br: Construindo uma imagem de sistema operacional

source: Start by installing the [Debian 9.9 2019-08-03 4GB SD IoT](https://beagleboard.org/latest-images) image. One may run the image from either a micro-SD card or from builtin eMMC. If using the eMMC, install it to eMMC now by following the instructions from the above link.
pt_br: Comece instalando a imagem [Debian 9.9 2019-08-03 4GB SD IoT](https://beagleboard.org/latest-images). É possível executar a imagem a partir de um cartão micro-SD ou do eMMC embutido. Se estiver usando o eMMC, instale-o agora no eMMC seguindo as instruções do link acima.

source: Install Octoprint
pt_br: Instalar o Octoprint

source: One may then install Octoprint:
pt_br: Em seguida, você pode instalar o Octoprint:

source: And setup OctoPrint to start at bootup:
pt_br: E configure o OctoPrint para começar na inicialização:

source: Then start the Octoprint service:
pt_br: Em seguida, inicie o serviço Octoprint:

source: Building the micro-controller code
pt_br: Construindo o código do micro-controlador

source: To compile the Klipper micro-controller code, start by configuring it for the "Beaglebone PRU":
pt_br: Para compilar o código do micro-controlador do Klipper, comece configurando-o para o "Beaglebone PRU":

source: To build and install the new micro-controller code, run:
pt_br: Para construir e instalar o novo código do micro-controlador, execute:

source: Then install this micro-controller code as well:
pt_br: Em seguida, instale este código de micro-controlador também:

source: Remaining configuration
pt_br: Configuração restante

source: Printing on the Beaglebone
pt_br: Impressão no Beaglebone

source: Then ssh into the Beaglebone machine (`ssh debian@beaglebone` -- password is `temppwd`) and install Klipper by running the following commands:
pt_br: Em seguida, faça ssh na máquina Beaglebone (`ssh debian@beaglebone` -- a senha é `temppwd`) e instale o Klipper executando os seguintes comandos:

source: It is necessary to modify OctoPrint's **/etc/default/octoprint** configuration file. One must change the `OCTOPRINT_USER` user to `debian`, change `NICELEVEL` to `0`, uncomment the `BASEDIR`, `CONFIGFILE`, and `DAEMON` settings and change the references from `/home/pi/` to `/home/debian/`:
pt_br: É necessário modificar o arquivo de configuração **/etc/default/octoprint** do OctoPrint. É preciso alterar o usuário `OCTOPRINT_USER` para `debian`, alterar `NICELEVEL` para `0`, descomentar as configurações `BASEDIR`, `CONFIGFILE` e `DAEMON` e alterar as referências de `/home/pi/` para `/home/debian/`:

source: Make sure the OctoPrint web server is accessible - it should be at: <http://beaglebone:5000/>
pt_br: Certifique-se de que o servidor web do OctoPrint está acessível - ele deve estar em: <http://beaglebone:5000/>

source: It is also necessary to compile and install the micro-controller code for a Linux host process. Configure it a second time for a "Linux process":
pt_br: Também é necessário compilar e instalar o código do micro-controlador para um processo de host Linux. Configure-o uma segunda vez para um "processo Linux":

source: Complete the installation by configuring Klipper and Octoprint following the instructions in the main [Installation](Installation.md#configuring-klipper) document.
pt_br: Complete a instalação configurando o Klipper e o Octoprint seguindo as instruções no documento principal [Instalação](Installation.md#configuring-klipper).

source: Unfortunately, the Beaglebone processor can sometimes struggle to run OctoPrint well. Print stalls have been known to occur on complex prints (the printer may move faster than OctoPrint can send movement commands). If this occurs, consider using the "virtual_sdcard" feature (see [Config Reference](Config_Reference.md#virtual_sdcard) for details) to print directly from Klipper.
pt_br: Infelizmente, o processador Beaglebone pode às vezes ter dificuldade para executar o OctoPrint bem. Paradas de impressão são conhecidas por ocorrer em impressões complexas (a impressora pode se mover mais rápido do que o OctoPrint pode enviar comandos de movimento). Se isso ocorrer, considere usar o recurso "virtual_sdcard" (veja [Config Reference](Config_Reference.md#virtual_sdcard) para detalhes) para imprimir diretamente do Klipper.
