Repository: fran6p/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/BLTouch.po
Languages: ru

source: [safe_z_home] home_xy_position: 100, 100 # Change coordinates to the center of your print bed speed: 50 z_hop: 10 # Move up 10mm z_hop_speed: 5
ru: [безопасный_z_home] home_xy_position: 100, 100 # Переместите координаты в центр печатного слоя скорость: 50 z_hop: 10 # Переместите вверх на 10 мм z_hop_speed: 5

source: The next step is to confirm that the sensor pin is working correctly. Run `BLTOUCH_DEBUG COMMAND=pin_down`, verify that the pin moves down, run `BLTOUCH_DEBUG COMMAND=touch_mode`, run `QUERY_PROBE`, and verify that command reports "probe: open". Then while gently pushing the pin up slightly with the nail of your finger run `QUERY_PROBE` again. Verify the command reports "probe: TRIGGERED". If either query does not report the correct message then it usually indicates an incorrect wiring or configuration (though some [clones](#bl-touch-clones) may require special handling). At the completion of this test run `BLTOUCH_DEBUG COMMAND=pin_up` and verify that the pin moves up.
ru: Следующим шагом является подтверждение того, что контакт датчика работает правильно. Запустите `BLTOUCH_DEBUG COMMAND=pin_down`, убедитесь, что pin-код перемещается вниз, запустите `BLTOUCH_DEBUG COMMAND=touch_mode`, запустите `QUERY_PROBE` и убедитесь, что команда сообщает "probe: открыто". Затем, слегка надавливая на булавку ногтем пальца, снова запустите `QUERY_PROBE`. Проверьте, что команда сообщает "зонд: СРАБОТАЛ". Если какой-либо запрос не выдает правильного сообщения, то это обычно указывает на неправильное подключение или конфигурацию (хотя некоторые [клоны](#bl-touch-clones) могут потребовать специальной обработки). По завершении этого теста запустите `BLTOUCH_DEBUG COMMAND=pin_up` и убедитесь, что контакт перемещается вверх.

source: Many BL-Touch "clone" devices work correctly with Klipper using the default configuration. However, some "clone" devices may not support the `QUERY_PROBE` command and some "clone" devices may require configuration of `pin_up_reports_not_triggered` or `pin_up_touch_mode_reports_triggered`.
ru: Многие «клонированные» устройства BL-Touch корректно работают с Klipper, используя конфигурацию по умолчанию. Однако некоторые устройства «клонирования» могут не поддерживать команду `QUERY_PROBE`, а для некоторых устройств «клонирования» может потребоваться настройка `pin_up_reports_not_triggered` или `pin_up_touch_mode_reports_triggered`.

source: Some "clone" devices do not support `touch_mode` and as a result the `QUERY_PROBE` command does not work. Despite this, it may still be possible to perform probing and homing with these devices. On these devices the `QUERY_PROBE` command during the [initial tests](#initial-tests) will not succeed, however the subsequent `G28` (or `PROBE`) test does succeed. It may be possible to use these "clone" devices with Klipper if one does not utilize the `QUERY_PROBE` command and one does not enable the `probe_with_touch_mode` feature.
ru: Некоторые устройства-клоны не поддерживают `Touch_mode`, и в результате команда `QUERY_PROBE` не работает. Несмотря на это, с помощью этих устройств по-прежнему возможно выполнять зондирование и возврат в исходное положение. На этих устройствах команда `QUERY_PROBE` во время [начальных тестов](#initial-tests) не будет успешной, однако последующий тест G28 (или `PROBE`) будет успешным. Эти «клонированные» устройства можно будет использовать с Klipper, если не использовать команду `QUERY_PROBE` и не включить функцию probe_with_touch_mode.
