Repository: fran6p/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Config_Reference.po
Languages: sk

source: [heater_fan heatbreak_cooling_fan] #pin: #max_power: #shutdown_speed: #cycle_time: #hardware_pwm: #kick_start_time: #off_below: #tachometer_pin: #tachometer_ppr: #tachometer_poll_interval: #enable_pin: # See the "fan" section for a description of the above parameters. #heater: extruder # Name of the config section defining the heater that this fan is # associated with. If a comma separated list of heater names is # provided here, then the fan will be enabled when any of the given # heaters are enabled. The default is "extruder". #heater_temp: 50.0 # A temperature (in Celsius) that the heater must drop below before # the fan is disabled. The default is 50 Celsius. #fan_speed: 1.0 # The fan speed (expressed as a value from 0.0 to 1.0) that the fan # will be set to when its associated heater is enabled. The default # is 1.0
sk: [heater_fan heatbreak_cooling_fan] #pin: #max_power: #shutdown_speed: #cycle_time: #hardware_pwm: #kick_start_time: #off_below: #tachometer_pin: #tachometer_ppr: #tachometer_poll_interval: #enable_pin: # Popis vyššie uvedených parametrov nájdete v časti „ventilátor“. #ohrievač: extrudér # Názov konfiguračnej sekcie definujúcej ohrievač, ktorým je tento ventilátor # Spojené s. Ak je zoznam názvov ohrievačov oddelený čiarkami # tu, potom sa ventilátor povolí, keď niektorá z uvedených Je povolených # ohrievačov. Predvolená hodnota je "extrudér". #heater_temp: 50,0 # Teplota (v stupňoch Celzia), pod ktorú musí ohrievač klesnúť # ventilátor je vypnutý. Predvolená hodnota je 50 stupňov Celzia. #rýchlosť ventilátora: 1,0 # Rýchlosť ventilátora (vyjadrená ako hodnota od 0,0 do 1,0), ktorou ventilátor # sa nastaví na, keď je aktivovaný príslušný ohrievač. Predvolená hodnota # je 1,0

source: [pca9533 my_pca9533] #i2c_address: 98 # The i2c address that the chip is using on the i2c bus. Use 98 for # the PCA9533/1, 99 for the PCA9533/2. The default is 98. #i2c_mcu: #i2c_bus: #i2c_software_scl_pin: #i2c_software_sda_pin: #i2c_speed: # See the "common I2C settings" section for a description of the # above parameters. #initial_RED: 0.0 #initial_GREEN: 0.0 #initial_BLUE: 0.0 #initial_WHITE: 0.0 # See the "led" section for information on these parameters.
sk: [pca9533 my_pca9533] #i2c_address: 98 # Adresa i2c, ktorú čip používa na zbernici i2c. Použite 98 pre # PCA9533/1, 99 pre PCA9533/2. Predvolená hodnota je 98. #i2c_mcu: #i2c_bus: #i2c_software_scl_pin: #i2c_software_sda_pin: #i2c_speed: # Popis nájdete v časti „bežné nastavenia I2C“. # vyššie uvedené parametre. #initial_RED: 0,0 #initial_GREEN: 0,0 #initial_BLUE: 0,0 #initial_WHITE: 0,0 # Informácie o týchto parametroch nájdete v časti „LED“.

source: [pca9632 my_pca9632] #i2c_address: 98 # The i2c address that the chip is using on the i2c bus. This may be # 96, 97, 98, or 99. The default is 98. #i2c_mcu: #i2c_bus: #i2c_software_scl_pin: #i2c_software_sda_pin: #i2c_speed: # See the "common I2C settings" section for a description of the # above parameters. #scl_pin: #sda_pin: # Alternatively, if the pca9632 is not connected to a hardware I2C # bus, then one may specify the "clock" (scl_pin) and "data" # (sda_pin) pins. The default is to use hardware I2C. #color_order: RGBW # Set the pixel order of the LED (using a string containing the # letters R, G, B, W). The default is RGBW. #initial_RED: 0.0 #initial_GREEN: 0.0 #initial_BLUE: 0.0 #initial_WHITE: 0.0 # See the "led" section for information on these parameters.
sk: [pca9632 my_pca9632] #i2c_address: 98 # Adresa i2c, ktorú čip používa na zbernici i2c. Toto môže byť # 96, 97, 98 alebo 99. Predvolená hodnota je 98. #i2c_mcu: #i2c_bus: #i2c_software_scl_pin: #i2c_software_sda_pin: #i2c_speed: # Popis nájdete v časti „bežné nastavenia I2C“. # vyššie uvedené parametre. #scl_pin: #sda_pin: # Prípadne, ak pca9632 nie je pripojený k hardvérovému I2C # autobus, potom je možné zadať „hodiny“ (scl_pin) a „data“ # (sda_pin) pinov. Predvolené je použitie hardvérového I2C. #color_order: RGBW # Nastavte poradie pixelov LED (pomocou reťazca obsahujúceho # písmen R, G, B, W). Predvolená hodnota je RGBW. #initial_RED: 0,0 #initial_GREEN: 0,0 #initial_BLUE: 0,0 #initial_WHITE: 0,0 # Informácie o týchto parametroch nájdete v časti „LED“.

source: Configure a TMC2240 stepper motor driver via SPI bus or UART. To use this feature, define a config section with a "tmc2240" prefix followed by the name of the corresponding stepper config section (for example, "[tmc2240 stepper_x]").
sk: Nakonfigurujte ovládač krokového motora TMC2240 cez zbernicu SPI alebo UART. Ak chcete použiť túto funkciu, definujte konfiguračnú sekciu s predponou "tmc2240", za ktorou nasleduje názov zodpovedajúcej konfiguračnej sekcie steppera (napríklad "[tmc2240 stepper_x]").

source: [mcp4451 my_digipot] i2c_address: # The i2c address that the chip is using on the i2c bus. This # parameter must be provided. #i2c_mcu: #i2c_bus: #i2c_software_scl_pin: #i2c_software_sda_pin: #i2c_speed: # See the "common I2C settings" section for a description of the # above parameters. #wiper_0: #wiper_1: #wiper_2: #wiper_3: # The value to statically set the given MCP4451 "wiper" to. This is # typically set to a number between 0.0 and 1.0 with 1.0 being the # highest resistance and 0.0 being the lowest resistance. However, # the range may be changed with the 'scale' parameter (see below). # If a wiper is not specified then it is left unconfigured. #scale: # This parameter can be used to alter how the 'wiper_x' parameters # are interpreted. If provided, then the 'wiper_x' parameters should # be between 0.0 and 'scale'. This may be useful when the MCP4451 is # used to set stepper voltage references. The 'scale' can be set to # the equivalent stepper amperage if the MCP4451 were at its highest # resistance, and then the 'wiper_x' parameters can be specified # using the desired amperage value for the stepper. The default is # to not scale the 'wiper_x' parameters.
sk: [mcp4451 my_digipot] i2c_address: # Adresa i2c, ktorú čip používa na zbernici i2c. Toto Musíte zadať # parameter. #i2c_mcu: #i2c_bus: #i2c_software_scl_pin: #i2c_software_sda_pin: #i2c_speed: # Popis nájdete v časti „bežné nastavenia I2C“. # vyššie uvedené parametre. #wiper_0: #wiper_1: #wiper_2: #wiper_3: # Hodnota, na ktorú sa má staticky nastaviť daný „stierač“ MCP4451. Toto je # sa zvyčajne nastavuje na číslo medzi 0,0 a 1,0, pričom 1,0 je # najvyšší odpor a 0,0 je najnižší odpor. však # rozsah je možné zmeniť pomocou parametra 'scale' (pozri nižšie). # Ak nie je špecifikovaný stierač, zostane nenakonfigurovaný. #mierka: # Tento parameter možno použiť na zmenu parametrov 'wiper_x' # sú interpretované. Ak sú uvedené, mali by byť parametre 'wiper_x' # byť medzi 0,0 a 'scale'. To môže byť užitočné, keď je MCP4451 # slúži na nastavenie krokových referencií napätia. „Mierka“ sa dá nastaviť na # ekvivalentná kroková prúdová sila, ak by bola MCP4451 na najvyššej úrovni # odpor a potom je možné zadať parametre 'wiper_x' # pomocou požadovanej hodnoty prúdu pre stepper. Predvolená hodnota je # na neškálovanie parametrov 'wiper_x'.

source: [mcp4728 my_dac] #i2c_address: 96 # The i2c address that the chip is using on the i2c bus. The default # is 96. #i2c_mcu: #i2c_bus: #i2c_software_scl_pin: #i2c_software_sda_pin: #i2c_speed: # See the "common I2C settings" section for a description of the # above parameters. #channel_a: #channel_b: #channel_c: #channel_d: # The value to statically set the given MCP4728 channel to. This is # typically set to a number between 0.0 and 1.0 with 1.0 being the # highest voltage (2.048V) and 0.0 being the lowest voltage. # However, the range may be changed with the 'scale' parameter (see # below). If a channel is not specified then it is left # unconfigured. #scale: # This parameter can be used to alter how the 'channel_x' parameters # are interpreted. If provided, then the 'channel_x' parameters # should be between 0.0 and 'scale'. This may be useful when the # MCP4728 is used to set stepper voltage references. The 'scale' can # be set to the equivalent stepper amperage if the MCP4728 were at # its highest voltage (2.048V), and then the 'channel_x' parameters # can be specified using the desired amperage value for the # stepper. The default is to not scale the 'channel_x' parameters.
sk: [mcp4728 my_dac] #i2c_address: 96 # Adresa i2c, ktorú čip používa na zbernici i2c. Predvolená hodnota # je 96. #i2c_mcu: #i2c_bus: #i2c_software_scl_pin: #i2c_software_sda_pin: #i2c_speed: # Popis nájdete v časti „bežné nastavenia I2C“. # vyššie uvedené parametre. #channel_a: #channel_b: #channel_c: #channel_d: # Hodnota, na ktorú sa má staticky nastaviť daný kanál MCP4728. Toto je # sa zvyčajne nastavuje na číslo medzi 0,0 a 1,0, pričom 1,0 je # najvyššie napätie (2,048 V) a 0,0 je najnižšie napätie. # Rozsah však možno zmeniť pomocou parametra „scale“ (pozri # nižšie). Ak kanál nie je špecifikovaný, zostane ponechaný # nenakonfigurované. #mierka: # Tento parameter možno použiť na zmenu parametrov 'channel_x' # sú interpretované. Ak sú uvedené, potom parametre „channel_x“. # by malo byť medzi 0,0 a 'scale'. To môže byť užitočné, keď # MCP4728 sa používa na nastavenie krokových referencií napätia. „Váha“ môže # nastaviť na ekvivalentnú krokovú intenzitu prúdu, ak by bol MCP4728 na # jeho najvyššie napätie (2,048V) a potom parametre 'channel_x' # môže byť špecifikované pomocou požadovanej hodnoty prúdu pre # stepper. Štandardne sa neškálujú parametre 'channel_x'.

source: [display] lcd_type: # Set to either "ssd1306" or "sh1106" for the given display type. #i2c_mcu: #i2c_bus: #i2c_software_scl_pin: #i2c_software_sda_pin: #i2c_speed: # Optional parameters available for displays connected via an i2c # bus. See the "common I2C settings" section for a description of # the above parameters. #cs_pin: #dc_pin: #spi_speed: #spi_bus: #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # The pins connected to the lcd when in "4-wire" spi mode. See the # "common SPI settings" section for a description of the parameters # that start with "spi_". The default is to use i2c mode for the # display. #reset_pin: # A reset pin may be specified on the display. If it is not # specified then the hardware must have a pull-up on the # corresponding lcd line. #contrast: # The contrast to set. The value may range from 0 to 256 and the # default is 239. #vcomh: 0 # Set the Vcomh value on the display. This value is associated with # a "smearing" effect on some OLED displays. The value may range # from 0 to 63. Default is 0. #invert: False # TRUE inverts the pixels on certain OLED displays. The default is # False. #x_offset: 0 # Set the horizontal offset value on SH1106 displays. The default is # 0. ...
sk: [zobraziť] lcd_type: # Pre daný typ zobrazenia nastavte buď "ssd1306" alebo "sh1106". #i2c_mcu: #i2c_bus: #i2c_software_scl_pin: #i2c_software_sda_pin: #i2c_speed: # Voliteľné parametre dostupné pre displeje pripojené cez i2c # autobus. Popis nájdete v časti „bežné nastavenia I2C“. # vyššie uvedené parametre. #cs_pin: #dc_pin: #spi_speed: #spi_bus: #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # Kolíky pripojené k LCD v "4-drôtovom" režime spi. Pozrite si # časť "spoločné nastavenia SPI" pre popis parametrov # ktoré začínajú na "spi_". Predvolené je použitie režimu i2c pre # displej. #reset_pin: # Na displeji môže byť špecifikovaný resetovací kolík. Ak nie je # špecifikované, potom musí mať hardvér vyťahovací prvok # zodpovedajúca lcd linka. #kontrast: # Kontrast, ktorý sa má nastaviť. Hodnota sa môže pohybovať od 0 do 256 a # predvolená hodnota je 239. #vcomh: 0 # Na displeji nastavte hodnotu Vcomh. Táto hodnota je spojená s # efekt "rozmazania" na niektorých OLED displejoch. Hodnota sa môže pohybovať # od 0 do 63. Predvolená hodnota je 0. #invert: Nepravda # TRUE invertuje pixely na určitých OLED displejoch. Predvolená hodnota je # Nepravdivé. #x_offset: 0 # Nastavte hodnotu horizontálneho posunu na displejoch SH1106. Predvolená hodnota je # 0. ...

source: #i2c_address: # The i2c address of the device. This must specified as a decimal # number (not in hex). The default depends on the type of device. #i2c_mcu: # The name of the micro-controller that the chip is connected to. # The default is "mcu". #i2c_bus: # If the micro-controller supports multiple I2C busses then one may # specify the micro-controller bus name here. The default depends on # the type of micro-controller. #i2c_software_scl_pin: #i2c_software_sda_pin: # Specify these parameters to use micro-controller software based # I2C "bit-banging" support. The two parameters should the two pins # on the micro-controller to use for the scl and sda wires. The # default is to use hardware based I2C support as specified by the # i2c_bus parameter. #i2c_speed: # The I2C speed (in Hz) to use when communicating with the device. # The Klipper implementation on most micro-controllers is hard-coded # to 100000 and changing this value has no effect. The default is # 100000. Linux, RP2040 and ATmega support 400000.
sk: #i2c_address: # Adresa i2c zariadenia. Toto musí byť uvedené ako desatinné číslo # číslo (nie v hex). Predvolená hodnota závisí od typu zariadenia. #i2c_mcu: # Názov mikroovládača, ku ktorému je čip pripojený. # Predvolená hodnota je "mcu". #i2c_bus: # Ak mikrokontrolér podporuje viacero zberníc I2C, potom jedna môže # tu zadajte názov zbernice mikrokontroléra. Predvolená hodnota závisí od # typ mikrokontroléra. #i2c_software_scl_pin: #i2c_software_sda_pin: # Špecifikujte tieto parametre, ak chcete použiť softvér mikrokontroléra # Podpora I2C „bit-banging“. Dva parametre by mali mať dva kolíky # na mikroovládači na použitie pre vodiče scl a sda. The # predvolené je použitie hardvérovej podpory I2C podľa špecifikácie # parameter i2c_bus. #i2c_speed: # Rýchlosť I2C (v Hz), ktorá sa má použiť pri komunikácii so zariadením. # Implementácia Klipper na väčšine mikrokontrolérov je pevne zakódovaná # na 100 000 a zmena tejto hodnoty nemá žiadny vplyv. Predvolená hodnota je # 100 000. Linux, RP2040 a ATmega podporujú 400 000.
