Repository: fran6p/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Config_Reference.po
Languages: sk

source: [bed_mesh] #speed: 50 # The speed (in mm/s) of non-probing moves during the calibration. # The default is 50. #horizontal_move_z: 5 # The height (in mm) that the head should be commanded to move to # just prior to starting a probe operation. The default is 5. #mesh_radius: # Defines the radius of the mesh to probe for round beds. Note that # the radius is relative to the coordinate specified by the # mesh_origin option. This parameter must be provided for round beds # and omitted for rectangular beds. #mesh_origin: # Defines the center X, Y coordinate of the mesh for round beds. This # coordinate is relative to the probe's location. It may be useful # to adjust the mesh_origin in an effort to maximize the size of the # mesh radius. Default is 0, 0. This parameter must be omitted for # rectangular beds. #mesh_min: # Defines the minimum X, Y coordinate of the mesh for rectangular # beds. This coordinate is relative to the probe's location. This # will be the first point probed, nearest to the origin. This # parameter must be provided for rectangular beds. #mesh_max: # Defines the maximum X, Y coordinate of the mesh for rectangular # beds. Adheres to the same principle as mesh_min, however this will # be the furthest point probed from the bed's origin. This parameter # must be provided for rectangular beds. #probe_count: 3, 3 # For rectangular beds, this is a comma separate pair of integer # values X, Y defining the number of points to probe along each # axis. A single value is also valid, in which case that value will # be applied to both axes. Default is 3, 3. #round_probe_count: 5 # For round beds, this integer value defines the maximum number of # points to probe along each axis. This value must be an odd number. # Default is 5. #fade_start: 1.0 # The gcode z position in which to start phasing out z-adjustment # when fade is enabled. Default is 1.0. #fade_end: 0.0 # The gcode z position in which phasing out completes. When set to a # value below fade_start, fade is disabled. It should be noted that # fade may add unwanted scaling along the z-axis of a print. If a # user wishes to enable fade, a value of 10.0 is recommended. # Default is 0.0, which disables fade. #fade_target: # The z position in which fade should converge. When this value is # set to a non-zero value it must be within the range of z-values in # the mesh. Users that wish to converge to the z homing position # should set this to 0. Default is the average z value of the mesh. #split_delta_z: .025 # The amount of Z difference (in mm) along a move that will trigger # a split. Default is .025. #move_check_distance: 5.0 # The distance (in mm) along a move to check for split_delta_z. # This is also the minimum length that a move can be split. Default # is 5.0. #mesh_pps: 2, 2 # A comma separated pair of integers X, Y defining the number of # points per segment to interpolate in the mesh along each axis. A # "segment" can be defined as the space between each probed point. # The user may enter a single value which will be applied to both # axes. Default is 2, 2. #algorithm: lagrange # The interpolation algorithm to use. May be either "lagrange" or # "bicubic". This option will not affect 3x3 grids, which are forced # to use lagrange sampling. Default is lagrange. #bicubic_tension: .2 # When using the bicubic algorithm the tension parameter above may # be applied to change the amount of slope interpolated. Larger # numbers will increase the amount of slope, which results in more # curvature in the mesh. Default is .2. #zero_reference_position: # An optional X,Y coordinate that specifies the location on the bed # where Z = 0. When this option is specified the mesh will be offset # so that zero Z adjustment occurs at this location. The default is # no zero reference. #relative_reference_index: # **DEPRECATED, use the "zero_reference_position" option** # The legacy option superceded by the "zero reference position". # Rather than a coordinate this option takes an integer "index" that # refers to the location of one of the generated points. It is recommended # to use the "zero_reference_position" instead of this option for new # configurations. The default is no relative reference index. #faulty_region_1_min: #faulty_region_1_max: # Optional points that define a faulty region. See docs/Bed_Mesh.md # for details on faulty regions. Up to 99 faulty regions may be added. # By default no faulty regions are set.
sk: [sieťovina] #rýchlosť: 50 # Rýchlosť (v mm/s) nesnímaných pohybov počas kalibrácie. # Predvolená hodnota je 50. #horizontal_move_z: 5 # Výška (v mm), do ktorej sa má hlava pohnúť # tesne pred spustením operácie sondy. Predvolená hodnota je 5. #mesh_radius: # Definuje polomer siete na snímanie pre okrúhle lôžka. Poznač si to # polomer je relatívny k súradniciam špecifikovaným v # možnosť mesh_origin. Tento parameter musí byť poskytnutý pre okrúhle lôžka # a vynechané pre obdĺžnikové postele. #mesh_origin: # Definuje stredovú súradnicu X, Y siete pre okrúhle lôžka. Toto # súradnica je relatívna k polohe sondy. Môže to byť užitočné # upraviť mesh_origin v snahe maximalizovať veľkosť # polomer siete. Predvolená hodnota je 0, 0. Tento parameter musí byť vynechaný # obdĺžnikové postele. #mesh_min: # Definuje minimálnu súradnicu X, Y siete pre obdĺžnikovú # postele. Táto súradnica je relatívna k umiestneniu sondy. Toto # bude prvý testovaný bod najbližšie k začiatku. Toto Pre obdĺžnikové postele je potrebné zadať # parameter. #mesh_max: # Definuje maximálnu súradnicu X, Y siete pre obdĺžnikovú # postele. Dodržiava rovnaký princíp ako mesh_min, ale bude to tak # byť najvzdialenejším bodom skúmaným od pôvodu postele. Tento parameter # musí byť poskytnuté pre obdĺžnikové postele. #probe_count: 3, 3 # V prípade obdĺžnikových postelí ide o pár celých čísel oddelených čiarkou # hodnoty X, Y definujúce počet bodov, ktoré sa majú nasnímať pozdĺž každého z nich # os. Platí aj jedna hodnota, v takom prípade bude táto hodnota # sa aplikuje na obe osi. Predvolená hodnota je 3, 3. #round_probe_count: 5 # Pre okrúhle postele táto celočíselná hodnota definuje maximálny počet # bodov na snímanie pozdĺž každej osi. Táto hodnota musí byť nepárne číslo. # Predvolená hodnota je 5. #fade_start: 1.0 # Pozícia z gcode, v ktorej sa má začať postupné odstraňovanie z-úpravy # keď je aktivované zoslabovanie. Predvolená hodnota je 1.0. #fade_end: 0,0 # Pozícia gcode z, v ktorej sa ukončuje postupné vyraďovanie. Pri nastavení na a # hodnota pod fade_start, fade je vypnutý. Treba poznamenať, že # Fade môže pridať nežiaduce škálovanie pozdĺž osi z tlače. Ak # používateľ si želá povoliť miznutie, odporúča sa hodnota 10,0. # Predvolená hodnota je 0,0, čo zakáže miznutie. #fade_target: # Pozícia z, v ktorej by sa malo zoslabovanie zbiehať. Keď je táto hodnota # nastavený na nenulovú hodnotu, musí byť v rozsahu hodnôt z # sieťovina. Používatelia, ktorí chcú konvergovať do východiskovej pozície z # by to malo nastaviť na 0. Predvolená hodnota je priemerná hodnota z siete. #split_delta_z: 0,025 # Veľkosť rozdielu Z (v mm) pozdĺž pohybu, ktorý sa spustí # rozdelenie. Predvolená hodnota je 0,025. #move_check_distance: 5,0 # Vzdialenosť (v mm) pozdĺž pohybu na kontrolu split_delta_z. # Toto je tiež minimálna dĺžka, ktorú je možné rozdeliť. Predvolené # je 5,0. #mesh_pps: 2, 2 # Čiarkami oddelený pár celých čísel X, Y definujúcich počet # bodov na segment na interpoláciu v sieti pozdĺž každej osi. A # "segment" môže byť definovaný ako priestor medzi každým snímaným bodom. # Používateľ môže zadať jedinú hodnotu, ktorá sa použije na obe # osí. Predvolená hodnota je 2, 2. #algoritmus: lagrange # Algoritmus interpolácie, ktorý sa má použiť. Môže byť buď "lagrange" alebo # „bikubický“. Táto možnosť neovplyvní mriežky 3x3, ktoré sú vynútené # použiť lagrangeov vzorkovanie. Predvolená hodnota je lagrange. #bicubic_tension: .2 # Pri použití bikubického algoritmu môže vyššie uvedený parameter napätia # sa použije na zmenu veľkosti interpolovaného sklonu. Väčšie # čísla zvýšia veľkosť sklonu, čo má za následok viac # zakrivenie v sieťke. Predvolená hodnota je .2. #zero_reference_position: # Voliteľná súradnica X,Y, ktorá určuje umiestnenie na posteli # kde Z = 0. Keď je zadaná táto možnosť, sieť bude posunutá # tak, aby na tomto mieste došlo k nastaveniu nuly Z. Predvolená hodnota je # žiadna nulová referencia. #relative_reference_index: # **UKONČENÉ, použite možnosť „nulová_referenčná_pozícia“** # Starú možnosť nahradenú „nulovou referenčnou pozíciou“. # Namiesto súradnice táto možnosť používa celé číslo "index". # označuje umiestnenie jedného z vygenerovaných bodov. Odporúča sa # použiť "nulovú_referenčnú_pozíciu" namiesto tejto možnosti pre nové # konfigurácií. Predvolená hodnota nie je relatívny referenčný index. #faulty_region_1_min: #faulty_region_1_max: # Voliteľné body, ktoré definujú chybnú oblasť. Pozrite si docs/Bed_Mesh.md # pre podrobnosti o chybných regiónoch. Je možné pridať až 99 chybných oblastí. # V predvolenom nastavení nie sú nastavené žiadne chybné oblasti.

source: [lis2dw] cs_pin: # The SPI enable pin for the sensor. This parameter must be provided. #spi_speed: 5000000 # The SPI speed (in hz) to use when communicating with the chip. # The default is 5000000. #spi_bus: #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # See the "common SPI settings" section for a description of the # above parameters. #axes_map: x, y, z # See the "adxl345" section for information on this parameter.
sk: [lis2dw] cs_pin: # Pin aktivácie SPI pre senzor. Tento parameter je potrebné zadať. #spi_speed: 5000000 # Rýchlosť SPI (v Hz), ktorá sa má použiť pri komunikácii s čipom. # Predvolená hodnota je 5 000 000. #spi_bus: #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # Popis nájdete v časti „spoločné nastavenia SPI“. # vyššie uvedené parametre. #axes_map: x, y, z # Informácie o tomto parametri nájdete v časti "adxl345".

source: [mpu9250 my_accelerometer] #i2c_address: # Default is 104 (0x68). If AD0 is high, it would be 0x69 instead. #i2c_mcu: #i2c_bus: #i2c_software_scl_pin: #i2c_software_sda_pin: #i2c_speed: 400000 # See the "common I2C settings" section for a description of the # above parameters. The default "i2c_speed" is 400000. #axes_map: x, y, z # See the "adxl345" section for information on this parameter.
sk: [mpu9250 môj_akcelerometer] #i2c_address: # Predvolená hodnota je 104 (0x68). Ak je AD0 vysoké, bude to namiesto toho 0x69. #i2c_mcu: #i2c_bus: #i2c_software_scl_pin: #i2c_software_sda_pin: #i2c_speed: 400 000 # Popis nájdete v časti „bežné nastavenia I2C“. # vyššie uvedené parametre. Predvolená "i2c_speed" je 400 000. #axes_map: x, y, z # Informácie o tomto parametri nájdete v časti "adxl345".

source: A tool to compensate for inaccurate probe readings due to twist in X gantry. See the [Axis Twist Compensation Guide](Axis_Twist_Compensation.md) for more detailed information regarding symptoms, configuration and setup.
sk: Nástroj na kompenzáciu nepresných hodnôt sondy v dôsledku skrútenia X gantry. Podrobnejšie informácie týkajúce sa symptómov, konfigurácie a nastavenia nájdete v [Príručka kompenzácie skrútenia osi] (Axis_Twist_Compensation.md).

source: [axis_twist_compensation] #speed: 50 # The speed (in mm/s) of non-probing moves during the calibration. # The default is 50. #horizontal_move_z: 5 # The height (in mm) that the head should be commanded to move to # just prior to starting a probe operation. The default is 5. calibrate_start_x: 20 # Defines the minimum X coordinate of the calibration # This should be the X coordinate that positions the nozzle at the starting # calibration position. This parameter must be provided. calibrate_end_x: 200 # Defines the maximum X coordinate of the calibration # This should be the X coordinate that positions the nozzle at the ending # calibration position. This parameter must be provided. calibrate_y: 112.5 # Defines the Y coordinate of the calibration # This should be the Y coordinate that positions the nozzle during the # calibration process. This parameter must be provided and is recommended to # be near the center of the bed
sk: [axis_twist_compensation] #rýchlosť: 50 # Rýchlosť (v mm/s) nesnímaných pohybov počas kalibrácie. # Predvolená hodnota je 50. #horizontal_move_z: 5 # Výška (v mm), do ktorej sa má hlava pohnúť # tesne pred spustením operácie sondy. Predvolená hodnota je 5. calibrate_start_x: 20 # Definuje minimálnu X súradnicu kalibrácie # Toto by mala byť súradnica X, ktorá umiestni trysku na začiatok # kalibračná pozícia. Tento parameter je potrebné zadať. calibrate_end_x: 200 # Definuje maximálnu X súradnicu kalibrácie # Toto by mala byť súradnica X, ktorá umiestni trysku na koniec # kalibračná pozícia. Tento parameter je potrebné zadať. calibrate_y: 112,5 # Definuje súradnicu Y kalibrácie # Toto by mala byť súradnica Y, ktorá umiestňuje trysku počas # proces kalibrácie. Tento parameter musí byť zadaný a odporúča sa # byť blízko stredu postele

source: Additionally, one could use "SET_DUAL_CARRIAGE CARRIAGE=1 MODE=COPY" or "SET_DUAL_CARRIAGE CARRIAGE=1 MODE=MIRROR" commands to activate either copying or mirroring mode of the dual carriage, in which case it will follow the motion of the carriage 0 accordingly. These commands can be used to print two parts simultaneously - either two identical parts (in COPY mode) or mirrored parts (in MIRROR mode). Note that COPY and MIRROR modes also require appropriate configuration of the extruder on the dual carriage, which can typically be achieved with "SYNC_EXTRUDER_MOTION MOTION_QUEUE=extruder EXTRUDER=<dual_carriage_extruder>" or a similar command.
sk: Okrem toho je možné použiť príkazy „SET_DUAL_CARRIAGE CARRIAGE=1 MODE=COPY“ alebo „SET_DUAL_CARRIAGE CARRIAGE=1 MODE=MIRROR“ na aktiváciu režimu kopírovania alebo zrkadlenia dvojitého vozíka, pričom v takom prípade bude zodpovedajúcim spôsobom sledovať pohyb vozíka 0 . Tieto príkazy je možné použiť na tlač dvoch dielov súčasne – buď dvoch rovnakých dielov (v režime KOPÍROVANIE) alebo zrkadlených dielov (v režime MIRROR). Všimnite si, že režimy COPY a MIRROR tiež vyžadujú vhodnú konfiguráciu extrudéra na dvojitom vozíku, čo sa zvyčajne dá dosiahnuť pomocou príkazu "SYNC_EXTRUDER_MOTION MOTION_QUEUE=extruder EXTRUDER=<vytlačovací stroj s dvoma vozíkmi>" alebo podobným príkazom.

source: [dual_carriage] axis: # The axis this extra carriage is on (either x or y). This parameter # must be provided. #safe_distance: # The minimum distance (in mm) to enforce between the dual and the primary # carriages. If a G-Code command is executed that will bring the carriages # closer than the specified limit, such a command will be rejected with an # error. If safe_distance is not provided, it will be inferred from # position_min and position_max for the dual and primary carriages. If set # to 0 (or safe_distance is unset and position_min and position_max are # identical for the primary and dual carraiges), the carriages proximity # checks will be disabled. #step_pin: #dir_pin: #enable_pin: #microsteps: #rotation_distance: #endstop_pin: #position_endstop: #position_min: #position_max: # See the "stepper" section for the definition of the above parameters.
sk: [dual_carriage] os: # Os je na tomto extra vozíku (buď x alebo y). Tento parameter # musí byť poskytnuté. #safe_distance: # Minimálna vzdialenosť (v mm), ktorá sa má vynútiť medzi duálnou a primárnou jednotkou # vozňov. Ak sa vykoná príkaz G-kódu, privedie sa vozíky # bližšie ako zadaný limit, takýto príkaz bude odmietnutý s # chyba. Ak safe_distance nie je zadaná, bude odvodená z # position_min a position_max pre dvojité a primárne vozíky. Ak je nastavený # až 0 (alebo safe_distance nie je nastavená a position_min a position_max sú # identické pre primárne a dvojité vozne), blízkosť vozňov # kontroly budú deaktivované. #step_pin: #dir_pin: #enable_pin: #mikrokroky: #rotation_distance: #endstop_pin: #position_endstop: #position_min: #position_max: # Definíciu vyššie uvedených parametrov nájdete v časti „stepper“.

source: sensor_type: BME280 #i2c_address: # Default is 118 (0x76). Some BME280 sensors have an address of 119 # (0x77). #i2c_mcu: #i2c_bus: #i2c_software_scl_pin: #i2c_software_sda_pin: #i2c_speed: # See the "common I2C settings" section for a description of the # above parameters.
sk: typ_senzora: BME280 #i2c_address: # Predvolená hodnota je 118 (0x76). Niektoré snímače BME280 majú adresu 119 # (0x77). #i2c_mcu: #i2c_bus: #i2c_software_scl_pin: #i2c_software_sda_pin: #i2c_speed: # Popis nájdete v časti „bežné nastavenia I2C“. # vyššie uvedené parametre.

source: AHT10/AHT20/AHT21 temperature sensor
sk: AHT10/AHT20/AHT21 teplotný sensor

source: AHT10/AHT20/AHT21 two wire interface (I2C) environmental sensors. Note that these sensors are not intended for use with extruders and heater beds, but rather for monitoring ambient temperature (C) and relative humidity. See [sample-macros.cfg](../config/sample-macros.cfg) for a gcode_macro that may be used to report humidity in addition to temperature.
sk: Senzory prostredia AHT10/AHT20/AHT21 s dvojvodičovým rozhraním (I2C). Upozorňujeme, že tieto snímače nie sú určené na použitie s extrudérmi a ohrievačmi, ale skôr na monitorovanie okolitej teploty (C) a relatívnej vlhkosti. Pozrite si [sample-macros.cfg](../config/sample-macros.cfg), kde nájdete gcode_macro, ktoré možno použiť na hlásenie vlhkosti okrem teploty.

source: sensor_type: AHT10 # Also use AHT10 for AHT20 and AHT21 sensors. #i2c_address: # Default is 56 (0x38). Some AHT10 sensors give the option to use # 57 (0x39) by moving a resistor. #i2c_mcu: #i2c_bus: #i2c_speed: # See the "common I2C settings" section for a description of the # above parameters. #aht10_report_time: # Interval in seconds between readings. Default is 30, minimum is 5
sk: typ_senzora: AHT10 # AHT10 používajte aj pre snímače AHT20 a AHT21. #i2c_address: # Predvolená hodnota je 56 (0x38). Niektoré snímače AHT10 poskytujú možnosť použitia # 57 (0x39) pohybom odporu. #i2c_mcu: #i2c_bus: #i2c_speed: # Popis nájdete v časti „bežné nastavenia I2C“. # vyššie uvedené parametre. #aht10_report_time: # Interval v sekundách medzi odčítaniami. Predvolená hodnota je 30, minimum je 5

source: sensor_type: # Must be "HTU21D" , "SI7013", "SI7020", "SI7021" or "SHT21" #i2c_address: # Default is 64 (0x40). #i2c_mcu: #i2c_bus: #i2c_software_scl_pin: #i2c_software_sda_pin: #i2c_speed: # See the "common I2C settings" section for a description of the # above parameters. #htu21d_hold_master: # If the sensor can hold the I2C buf while reading. If True no other # bus communication can be performed while reading is in progress. # Default is False. #htu21d_resolution: # The resolution of temperature and humidity reading. # Valid values are: # 'TEMP14_HUM12' -> 14bit for Temp and 12bit for humidity # 'TEMP13_HUM10' -> 13bit for Temp and 10bit for humidity # 'TEMP12_HUM08' -> 12bit for Temp and 08bit for humidity # 'TEMP11_HUM11' -> 11bit for Temp and 11bit for humidity # Default is: "TEMP11_HUM11" #htu21d_report_time: # Interval in seconds between readings. Default is 30
sk: senzor_typ: # Musí byť "HTU21D", "SI7013", "SI7020", "SI7021" alebo "SHT21" #i2c_address: # Predvolená hodnota je 64 (0x40). #i2c_mcu: #i2c_bus: #i2c_software_scl_pin: #i2c_software_sda_pin: #i2c_speed: # Popis nájdete v časti „bežné nastavenia I2C“. # vyššie uvedené parametre. #htu21d_hold_master: # Ak snímač dokáže udržať I2C buf počas čítania. Ak je pravda, žiadna iná # zbernicová komunikácia môže prebiehať počas čítania. # Predvolená hodnota je False. #htu21d_resolution: # Rozlíšenie čítania teploty a vlhkosti. # Platné hodnoty sú: # 'TEMP14_HUM12' -> 14 bitov pre teplotu a 12 bitov pre vlhkosť # 'TEMP13_HUM10' -> 13 bitov pre teplotu a 10 bitov pre vlhkosť # 'TEMP12_HUM08' -> 12 bitov pre teplotu a 08 bitov pre vlhkosť # 'TEMP11_HUM11' -> 11 bit pre teplotu a 11 bit pre vlhkosť # Predvolená hodnota je: "TEMP11_HUM11" #htu21d_report_time: # Interval v sekundách medzi odčítaniami. Predvolená hodnota je 30

source: sensor_type: LM75 #i2c_address: # Default is 72 (0x48). Normal range is 72-79 (0x48-0x4F) and the 3 # low bits of the address are configured via pins on the chip # (usually with jumpers or hard wired). #i2c_mcu: #i2c_bus: #i2c_software_scl_pin: #i2c_software_sda_pin: #i2c_speed: # See the "common I2C settings" section for a description of the # above parameters. #lm75_report_time: # Interval in seconds between readings. Default is 0.8, with minimum # 0.5.
sk: typ_senzora: LM75 #i2c_address: # Predvolená hodnota je 72 (0x48). Normálny rozsah je 72-79 (0x48-0x4F) a 3 # nízke bity adresy sa konfigurujú pomocou kolíkov na čipe # (zvyčajne s prepojkami alebo pevne zapojené). #i2c_mcu: #i2c_bus: #i2c_software_scl_pin: #i2c_software_sda_pin: #i2c_speed: # Popis nájdete v časti „bežné nastavenia I2C“. # vyššie uvedené parametre. #lm75_report_time: # Interval v sekundách medzi odčítaniami. Predvolená hodnota je 0,8 s minimom # 0,5.

source: Combined temperature sensor
sk: Kombinovaný snímač teploty

source: Combined temperature sensor is a virtual temperature sensor based on several other sensors. This sensor can be used with extruders, heater_generic and heater beds.
sk: Kombinovaný snímač teploty je virtuálny snímač teploty založený na niekoľkých ďalších snímačoch. Tento snímač je možné použiť s extrudérmi, ohrievačmi a ohrievačmi.

source: sensor_type: temperature_combined #sensor_list: # Must be provided. List of sensors to combine to new "virtual" # sensor. # E.g. 'temperature_sensor sensor1,extruder,heater_bed' #combination_method: # Must be provided. Combination method used for the sensor. # Available options are 'max', 'min', 'mean'. #maximum_deviation: # Must be provided. Maximum permissible deviation between the sensors # to combine (e.g. 5 degrees). To disable it, use a large value (e.g. 999.9)
sk: senzor_typ: teplota_kombinovaný #sensor_list: # Musí byť poskytnuté. Zoznam senzorov, ktoré sa majú skombinovať do nového „virtuálneho“ # senzor. # Napr. 'temperature_sensor sensor1,extruder,heater_bed' #combination_method: # Musí byť poskytnuté. Kombinovaná metóda použitá pre snímač. # Dostupné možnosti sú 'max', 'min', 'mean'. #maximálna_deviácia: # Musí byť poskytnuté. Maximálna povolená odchýlka medzi snímačmi # spojiť (napr. 5 stupňov). Ak ho chcete zakázať, použite veľkú hodnotu (napr. 999,9)
