Repository: fran6p/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Config_Reference.po
Languages: sk

source: See [example-deltesian.cfg](../config/example-deltesian.cfg) for an example deltesian kinematics config file.
sk: Príklad konfiguračného súboru deltézskej kinematiky nájdete v [example-deltesian.cfg](../config/example-deltesian.cfg).

source: Only parameters specific to deltesian printers are described here - see [common kinematic settings](#common-kinematic-settings) for available parameters.
sk: Tu sú popísané iba parametre špecifické pre deltézske tlačiarne – dostupné parametre nájdete v časti [bežné kinematické nastavenia](#common-kinematic-settings).

source: [fan] pin: # Output pin controlling the fan. This parameter must be provided. #max_power: 1.0 # The maximum power (expressed as a value from 0.0 to 1.0) that the # pin may be set to. The value 1.0 allows the pin to be set fully # enabled for extended periods, while a value of 0.5 would allow the # pin to be enabled for no more than half the time. This setting may # be used to limit the total power output (over extended periods) to # the fan. If this value is less than 1.0 then fan speed requests # will be scaled between zero and max_power (for example, if # max_power is .9 and a fan speed of 80% is requested then the fan # power will be set to 72%). The default is 1.0. #shutdown_speed: 0 # The desired fan speed (expressed as a value from 0.0 to 1.0) if # the micro-controller software enters an error state. The default # is 0. #cycle_time: 0.010 # The amount of time (in seconds) for each PWM power cycle to the # fan. It is recommended this be 10 milliseconds or greater when # using software based PWM. The default is 0.010 seconds. #hardware_pwm: False # Enable this to use hardware PWM instead of software PWM. Most fans # do not work well with hardware PWM, so it is not recommended to # enable this unless there is an electrical requirement to switch at # very high speeds. When using hardware PWM the actual cycle time is # constrained by the implementation and may be significantly # different than the requested cycle_time. The default is False. #kick_start_time: 0.100 # Time (in seconds) to run the fan at full speed when either first # enabling or increasing it by more than 50% (helps get the fan # spinning). The default is 0.100 seconds. #off_below: 0.0 # The minimum input speed which will power the fan (expressed as a # value from 0.0 to 1.0). When a speed lower than off_below is # requested the fan will instead be turned off. This setting may be # used to prevent fan stalls and to ensure kick starts are # effective. The default is 0.0. # # This setting should be recalibrated whenever max_power is adjusted. # To calibrate this setting, start with off_below set to 0.0 and the # fan spinning. Gradually lower the fan speed to determine the lowest # input speed which reliably drives the fan without stalls. Set # off_below to the duty cycle corresponding to this value (for # example, 12% -> 0.12) or slightly higher. #tachometer_pin: # Tachometer input pin for monitoring fan speed. A pullup is generally # required. This parameter is optional. #tachometer_ppr: 2 # When tachometer_pin is specified, this is the number of pulses per # revolution of the tachometer signal. For a BLDC fan this is # normally half the number of poles. The default is 2. #tachometer_poll_interval: 0.0015 # When tachometer_pin is specified, this is the polling period of the # tachometer pin, in seconds. The default is 0.0015, which is fast # enough for fans below 10000 RPM at 2 PPR. This must be smaller than # 30/(tachometer_ppr*rpm), with some margin, where rpm is the # maximum speed (in RPM) of the fan. #enable_pin: # Optional pin to enable power to the fan. This can be useful for fans # with dedicated PWM inputs. Some of these fans stay on even at 0% PWM # input. In such a case, the PWM pin can be used normally, and e.g. a # ground-switched FET(standard fan pin) can be used to control power to # the fan.
sk: [ventilátor] pripnúť: # Výstupný kolík ovládajúci ventilátor. Tento parameter je potrebné zadať. #max_power: 1,0 # Maximálny výkon (vyjadrený ako hodnota od 0,0 do 1,0), ktorý # PIN môže byť nastavený na. Hodnota 1,0 umožňuje úplné nastavenie kolíka # povolené na dlhšie obdobia, zatiaľ čo hodnota 0,5 by umožnila # pin bude povolený maximálne na polovicu času. Toto nastavenie môže # sa používa na obmedzenie celkového výkonu (po dlhší čas) na # ventilátor. Ak je táto hodnota menšia ako 1,0, požaduje sa rýchlosť ventilátora # bude škálované medzi nulou a maximálnym_výkonom (napríklad ak # max_power je 0,9 a vyžaduje sa rýchlosť ventilátora 80 %, potom ventilátor # výkon bude nastavený na 72 %). Predvolená hodnota je 1.0. #shutdown_speed: 0 # Požadovaná rýchlosť ventilátora (vyjadrená ako hodnota od 0,0 do 1,0), ak # softvér mikrokontroléra prejde do chybového stavu. Predvolená hodnota # je 0. #cycle_time: 0,010 # Množstvo času (v sekundách) pre každý cyklus napájania PWM do # ventilátor. Odporúča sa, aby to bolo 10 milisekúnd alebo viac # pomocou softvérového PWM. Predvolená hodnota je 0,010 sekundy. #hardware_pwm: Nepravda # Povoľte túto možnosť, ak chcete namiesto softvérového PWM použiť hardvérové PWM. Väčšina fanúšikov # nefungujú dobre s hardvérovým PWM, preto sa neodporúča # povoľte toto, pokiaľ neexistuje elektrická požiadavka na zapnutie # veľmi vysoké rýchlosti. Pri použití hardvérového PWM je skutočný čas cyklu # obmedzené implementáciou a môže byť výrazne # iný ako požadovaný cycle_time. Predvolená hodnota je False. #kick_start_time: 0,100 # Čas (v sekundách) na spustenie ventilátora pri plnej rýchlosti pri prvom spustení # povolenie alebo zvýšenie o viac ako 50% (pomáha získať ventilátor # točenie). Predvolená hodnota je 0,100 sekundy. #off_below: 0,0 # Minimálna vstupná rýchlosť, ktorá poháňa ventilátor (vyjadrená ako a # hodnota od 0,0 do 1,0). Keď je rýchlosť nižšia ako off_below # požadovalo, aby sa ventilátor namiesto toho vypol. Toto nastavenie môže byť # sa používa na zabránenie zastavenia ventilátora a na zabezpečenie štartovania # efektívne. Predvolená hodnota je 0,0. # # Toto nastavenie by sa malo prekalibrovať vždy, keď sa upraví max_power. # Na kalibráciu tohto nastavenia začnite s off_below nastaveným na 0.0 a # roztočenie ventilátora. Postupne znižujte rýchlosť ventilátora, aby ste určili najnižšiu # vstupná rýchlosť, ktorá spoľahlivo poháňa ventilátor bez zastavenia. Set # off_below na pracovný cyklus zodpovedajúci tejto hodnote (napr # príklad, 12 % -> 0,12) alebo mierne vyššie. #tachometer_pin: # Vstupný kolík tachometra na sledovanie otáčok ventilátora. Pulup je všeobecne # požadovaný. Tento parameter je voliteľný. #tachometer_ppr: 2 # Keď je zadaný tachometer_pin, ide o počet impulzov na # otáčky signálu tachometra. Pre fanúšika BLDC toto je # normálne polovičný počet pólov. Predvolená hodnota je 2. #tachometer_poll_interval: 0,0015 # Keď je zadaný tachometer_pin, ide o obdobie dotazovania # kolík tachometra v sekundách. Predvolená hodnota je 0,0015, čo je rýchle # dosť pre ventilátory pod 10 000 RPM pri 2 PPR. Toto musí byť menšie ako # 30/(tachometer_ppr*rpm), s určitým okrajom, kde otáčky za minútu sú # maximálna rýchlosť (v RPM) ventilátora. #enable_pin: # Voliteľný kolík na zapnutie napájania ventilátora. To môže byť užitočné pre fanúšikov # s vyhradenými PWM vstupmi. Niektoré z týchto ventilátorov zostávajú zapnuté aj pri 0% PWM # vstup. V takom prípade sa dá pin PWM normálne použiť a napr. a # FET so zemným spínačom (štandardný kolík ventilátora) možno použiť na ovládanie napájania # ventilátor.

source: [controller_fan my_controller_fan] #pin: #max_power: #shutdown_speed: #cycle_time: #hardware_pwm: #kick_start_time: #off_below: #tachometer_pin: #tachometer_ppr: #tachometer_poll_interval: #enable_pin: # See the "fan" section for a description of the above parameters. #fan_speed: 1.0 # The fan speed (expressed as a value from 0.0 to 1.0) that the fan # will be set to when a heater or stepper driver is active. # The default is 1.0 #idle_timeout: # The amount of time (in seconds) after a stepper driver or heater # was active and the fan should be kept running. The default # is 30 seconds. #idle_speed: # The fan speed (expressed as a value from 0.0 to 1.0) that the fan # will be set to when a heater or stepper driver was active and # before the idle_timeout is reached. The default is fan_speed. #heater: #stepper: # Name of the config section defining the heater/stepper that this fan # is associated with. If a comma separated list of heater/stepper names # is provided here, then the fan will be enabled when any of the given # heaters/steppers are enabled. The default heater is "extruder", the # default stepper is all of them.
sk: [controller_fan my_controller_fan] #pin: #max_power: #shutdown_speed: #cycle_time: #hardware_pwm: #kick_start_time: #off_below: #tachometer_pin: #tachometer_ppr: #tachometer_poll_interval: #enable_pin: # Popis vyššie uvedených parametrov nájdete v časti „ventilátor“. #fan_speed: 1.0 # Rýchlosť ventilátora (vyjadrená ako hodnota od 0,0 do 1,0), ktorou ventilátor # sa nastaví na, keď je aktívny ohrievač alebo krokový ovládač. # Predvolená hodnota je 1.0 #idle_timeout: # Čas (v sekundách) po krokovom ovládači alebo ohrievači # bol aktívny a ventilátor by mal zostať v chode. Predvolená hodnota # je 30 sekúnd. #idle_speed: # Rýchlosť ventilátora (vyjadrená ako hodnota od 0,0 do 1,0), ktorou ventilátor # sa nastaví na, keď bol aktívny ohrievač alebo krokový ovládač a # pred dosiahnutím idle_timeout. Predvolená je rýchlosť ventilátora. #ohrievač: #stepper: # Názov konfiguračnej sekcie definujúcej ohrievač/krokový ovládač tohto ventilátora # je spojené s. Ak čiarkami oddelený zoznam názvov ohrievačov/krokov Ak je tu uvedené #, potom sa ventilátor aktivuje, keď je niektorá z uvedených možností Je povolených # ohrievačov/krokov. Predvolený ohrievač je "extruder". # predvolený stepper sú všetky.

source: [fan_generic extruder_partfan] #pin: #max_power: #shutdown_speed: #cycle_time: #hardware_pwm: #kick_start_time: #off_below: #tachometer_pin: #tachometer_ppr: #tachometer_poll_interval: #enable_pin: # See the "fan" section for a description of the above parameters.
sk: [fan_generic extruder_partfan] #pin: #max_power: #shutdown_speed: #cycle_time: #hardware_pwm: #kick_start_time: #off_below: #tachometer_pin: #tachometer_ppr: #tachometer_poll_interval: #enable_pin: # Popis vyššie uvedených parametrov nájdete v časti „ventilátor“.

source: See also: [extended g-code commands](G-Codes.md#z_thermal_adjust).
sk: Pozri tiež: [rozšírené príkazy g-kódu](G-Codes.md#z_thermal_adjust).

source: [printer] kinematics: deltesian max_z_velocity: # For deltesian printers, this limits the maximum velocity (in mm/s) of # moves with z axis movement. This setting can be used to reduce the # maximum speed of up/down moves (which require a higher step rate # than other moves on a deltesian printer). The default is to use # max_velocity for max_z_velocity. #max_z_accel: # This sets the maximum acceleration (in mm/s^2) of movement along # the z axis. Setting this may be useful if the printer can reach higher # acceleration on XY moves than Z moves (eg, when using input shaper). # The default is to use max_accel for max_z_accel. #minimum_z_position: 0 # The minimum Z position that the user may command the head to move # to. The default is 0. #min_angle: 5 # This represents the minimum angle (in degrees) relative to horizontal # that the deltesian arms are allowed to achieve. This parameter is # intended to restrict the arms from becoming completely horizontal, # which would risk accidental inversion of the XZ axis. The default is 5. #print_width: # The distance (in mm) of valid toolhead X coordinates. One may use # this setting to customize the range checking of toolhead moves. If # a large value is specified here then it may be possible to command # the toolhead into a collision with a tower. This setting usually # corresponds to bed width (in mm). #slow_ratio: 3 # The ratio used to limit velocity and acceleration on moves near the # extremes of the X axis. If vertical distance divided by horizontal # distance exceeds the value of slow_ratio, then velocity and # acceleration are limited to half their nominal values. If vertical # distance divided by horizontal distance exceeds twice the value of # the slow_ratio, then velocity and acceleration are limited to one # quarter of their nominal values. The default is 3. # The stepper_left section is used to describe the stepper controlling # the left tower. This section also controls the homing parameters # (homing_speed, homing_retract_dist) for all towers. [stepper_left] position_endstop: # Distance (in mm) between the nozzle and the bed when the nozzle is # in the center of the build area and the endstops are triggered. This # parameter must be provided for stepper_left; for stepper_right this # parameter defaults to the value specified for stepper_left. arm_length: # Length (in mm) of the diagonal rod that connects the tower carriage to # the print head. This parameter must be provided for stepper_left; for # stepper_right, this parameter defaults to the value specified for # stepper_left. arm_x_length: # Horizontal distance between the print head and the tower when the # printers is homed. This parameter must be provided for stepper_left; # for stepper_right, this parameter defaults to the value specified for # stepper_left. # The stepper_right section is used to describe the stepper controlling the # right tower. [stepper_right] # The stepper_y section is used to describe the stepper controlling # the Y axis in a deltesian robot. [stepper_y]
sk: [tlačiareň] kinematika: deltézska max_z_velocity: # Pre deltézske tlačiarne to obmedzuje maximálnu rýchlosť (v mm/s). # sa pohybuje s pohybom osi z. Toto nastavenie možno použiť na zníženie # maximálna rýchlosť pohybov nahor/nadol (ktoré vyžadujú vyššiu rýchlosť krokov # než iné pohyby na deltézskej tlačiarni). Predvolená hodnota je použiť # max_velocity pre max_z_velocity. #max_z_accel: # Toto nastavuje maximálne zrýchlenie (v mm/s^2) pohybu pozdĺž # os z. Nastavenie môže byť užitočné, ak tlačiareň dosiahne vyššie # zrýchlenie pri XY pohyboch ako pri Z (napr. pri použití vstupného tvarovača). # Predvolené je použitie max_accel pre max_z_accel. #minimum_z_position: 0 # Minimálna poloha Z, ktorú môže používateľ prikázať pohybu hlavy # až. Predvolená hodnota je 0. #min_uhol: 5 # Predstavuje minimálny uhol (v stupňoch) vzhľadom k horizontále # ktoré deltézske ramená môžu dosiahnuť. Tento parameter je # určený na to, aby zabránil úplnej horizontálnej polohe ramien, # čím by hrozilo náhodné prevrátenie osi XZ. Predvolená hodnota je 5. #print_width: # Vzdialenosť (v mm) platných súradníc X hlavy nástroja. Jeden môže použiť # toto nastavenie na prispôsobenie kontroly rozsahu pohybov nástrojovej hlavy. Ak # je tu zadaná veľká hodnota, potom je možné zadať príkaz # nástrojová hlava do zrážky s vežou. Toto nastavenie zvyčajne # zodpovedá šírke lôžka (v mm). #slow_ratio: 3 # Pomer používaný na obmedzenie rýchlosti a zrýchlenia pri pohyboch v blízkosti # extrémy osi X. Ak je vertikálna vzdialenosť delená horizontálou # vzdialenosť presahuje hodnotu slow_ratio, potom rýchlosť a # zrýchlenie je obmedzené na polovicu nominálnych hodnôt. Ak vertikálne # vzdialenosť delená horizontálnou vzdialenosťou presahuje dvojnásobok hodnoty # pomalý_pomer, potom rýchlosť a zrýchlenie sú obmedzené na jednu # štvrtina ich nominálnych hodnôt. Predvolená hodnota je 3. # Časť stepper_left sa používa na popis ovládania steppera #ľavá veža. Táto sekcia tiež riadi parametre navádzania # (homing_speed, homing_retract_dist) pre všetky veže. [stepper_left] position_endstop: # Vzdialenosť (v mm) medzi tryskou a lôžkom, keď je tryska zapnutá # v strede stavebnej oblasti a spustia sa koncové zarážky. Toto # parameter musí byť poskytnutý pre stepper_left; pre stepper_right toto # parameter je predvolene nastavený na hodnotu zadanú pre stepper_left. dĺžka ruky: # Dĺžka (v mm) diagonálnej tyče, ktorá spája vozík veže s # tlačová hlava. Tento parameter musí byť poskytnutý pre stepper_left; pre # stepper_right, tento parameter má predvolenú hodnotu zadanú pre # stepper_left. rameno_x_dĺžka: # Horizontálna vzdialenosť medzi tlačovou hlavou a vežou, keď je # tlačiarní je doma. Tento parameter musí byť poskytnutý pre stepper_left; # pre stepper_right, tento parameter má predvolenú hodnotu zadanú pre # stepper_left. # Sekcia stepper_right sa používa na popis steppera, ktorý ovláda # pravá veža. [stepper_right] # Sekcia stepper_y sa používa na popis ovládania steppera # os Y v deltézskom robote. [stepper_y]

source: [screws_tilt_adjust] #screw1: # The (X, Y) coordinate of the first bed leveling screw. This is a # position to command the nozzle to so that the probe is directly # above the bed screw (or as close as possible while still being # above the bed). This is the base screw used in calculations. This # parameter must be provided. #screw1_name: # An arbitrary name for the given screw. This name is displayed when # the helper script runs. The default is to use a name based upon # the screw XY location. #screw2: #screw2_name: #... # Additional bed leveling screws. At least two screws must be # defined. #speed: 50 # The speed (in mm/s) of non-probing moves during the calibration. # The default is 50. #horizontal_move_z: 5 # The height (in mm) that the head should be commanded to move to # just prior to starting a probe operation. The default is 5. #screw_thread: CW-M3 # The type of screw used for bed leveling, M3, M4, or M5, and the # rotation direction of the knob that is used to level the bed. # Accepted values: CW-M3, CCW-M3, CW-M4, CCW-M4, CW-M5, CCW-M5. # Default value is CW-M3 which most printers use. A clockwise # rotation of the knob decreases the gap between the nozzle and the # bed. Conversely, a counter-clockwise rotation increases the gap.
sk: [screws_tilt_adjust] #skrutka1: # Súradnice (X, Y) prvej vyrovnávacej skrutky lôžka. Toto je # poloha na prikázanie tryske, aby bola sonda priamo # nad skrutkou lôžka (alebo čo najbližšie, kým ešte je # nad posteľou). Toto je základná skrutka používaná pri výpočtoch. Toto Musíte zadať # parameter. #screw1_name: # Ľubovoľný názov pre danú skrutku. Tento názov sa zobrazí, keď # sa spustí pomocný skript. Predvolené je použiť názov založený na # miesto skrutky XY. #skrutka2: #screw2_name: #... # Prídavné vyrovnávacie skrutky lôžka. Musia byť aspoň dve skrutky # definované. #rýchlosť: 50 # Rýchlosť (v mm/s) nesnímaných pohybov počas kalibrácie. # Predvolená hodnota je 50. #horizontal_move_z: 5 # Výška (v mm), do ktorej sa má hlava pohnúť # tesne pred spustením operácie sondy. Predvolená hodnota je 5. #screw_thread: CW-M3 # Typ skrutky používanej na vyrovnanie lôžka, M3, M4 alebo M5, a # smer otáčania gombíka, ktorý sa používa na vyrovnanie lôžka. # Akceptované hodnoty: CW-M3, CCW-M3, CW-M4, CCW-M4, CW-M5, CCW-M5. # Predvolená hodnota je CW-M3, ktorú používa väčšina tlačiarní. A v smere hodinových ručičiek # otáčaním gombíka sa zmenšuje medzera medzi tryskou a tryskou # posteľ. Naopak, otáčanie proti smeru hodinových ručičiek zväčšuje medzeru.

source: [palette2] serial: # The serial port to connect to the Palette 2. #baud: 115200 # The baud rate to use. The default is 115200. #feedrate_splice: 0.8 # The feedrate to use when splicing, default is 0.8 #feedrate_normal: 1.0 # The feedrate to use after splicing, default is 1.0 #auto_load_speed: 2 # Extrude feedrate when autoloading, default is 2 (mm/s) #auto_cancel_variation: 0.1 # Auto cancel print when ping variation is above this threshold
sk: [palette2] seriál: # Sériový port na pripojenie k palete 2. #baud: 115200 # Použitá prenosová rýchlosť. Predvolená hodnota je 115200. #feedrate_splice: 0,8 # Rýchlosť posuvu, ktorá sa má použiť pri spájaní, predvolená hodnota je 0,8 #feedrate_normal: 1,0 # Rýchlosť posuvu, ktorá sa má použiť po spájaní, predvolená hodnota je 1,0 #auto_load_speed: 2 # Rýchlosť posuvu pri automatickom načítavaní, predvolená hodnota je 2 (mm/s) #auto_cancel_variation: 0.1 # Automatické zrušenie tlače, keď je odchýlka pingu nad touto hranicou

source: Note that Klipper's current micro-controller support for I2C is generally not tolerant to line noise. Unexpected errors on the I2C wires may result in Klipper raising a run-time error. Klipper's support for error recovery varies between each micro-controller type. It is generally recommended to only use I2C devices that are on the same printed circuit board as the micro-controller.
sk: Všimnite si, že súčasná podpora mikrokontroléra Klipper pre I2C vo všeobecnosti nie je tolerantná k šumu linky. Neočakávané chyby na I2C vodičoch môžu spôsobiť, že Klipper vyvolá chybu behu. Podpora Klipper pre obnovu chýb sa líši medzi jednotlivými typmi mikrokontroléra. Vo všeobecnosti sa odporúča používať iba I2C zariadenia, ktoré sú na rovnakej doske s plošnými spojmi ako mikrokontrolér.

source: Most Klipper micro-controller implementations only support an `i2c_speed` of 100000 (*standard mode*, 100kbit/s). The Klipper "Linux" micro-controller supports a 400000 speed (*fast mode*, 400kbit/s), but it must be [set in the operating system](RPi_microcontroller.md#optional-enabling-i2c) and the `i2c_speed` parameter is otherwise ignored. The Klipper "RP2040" micro-controller and ATmega AVR family support a rate of 400000 via the `i2c_speed` parameter. All other Klipper micro-controllers use a 100000 rate and ignore the `i2c_speed` parameter.
sk: Väčšina implementácií mikrokontroléra Klipper podporuje iba `i2c_speed` 100 000 (*štandardný režim*, 100 kbit/s). Mikrokontrolér Klipper "Linux" podporuje rýchlosť 400 000 (*rýchly režim*, 400 kbit/s), ale musí byť [nastavená v operačnom systéme] (RPi_microcontroller.md#optional-enabling-i2c) a `i2c_speed` parameter je inak ignorovaný. Mikrokontrolér Klipper "RP2040" a rodina ATmega AVR podporujú rýchlosť 400 000 prostredníctvom parametra "i2c_speed". Všetky ostatné mikrokontroléry Klipper používajú rýchlosť 100 000 a ignorujú parameter `i2c_speed`.
