Repository: fran6p/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Config_Reference.po
Languages: sk

source: [extruder1] #step_pin: #dir_pin: #... # See the "extruder" section for available stepper and heater # parameters. #shared_heater: # This option is deprecated and should no longer be specified.
sk: [extrudér1] #step_pin: #dir_pin: #... # Dostupný stepper a ohrievač nájdete v časti "extrudér". # parametrov. #shared_heater: # Táto možnosť je zastaraná a už by sa nemala špecifikovať.

source: See the [command reference](G-Codes.md#extruder) for more information.
sk: Ďalšie informácie nájdete v [odkaz na príkaz](G-Codes.md#extruder).

source: Manual steppers (one may define any number of sections with a "manual_stepper" prefix). These are steppers that are controlled by the MANUAL_STEPPER g-code command. For example: "MANUAL_STEPPER STEPPER=my_stepper MOVE=10 SPEED=5". See [G-Codes](G-Codes.md#manual_stepper) file for a description of the MANUAL_STEPPER command. The steppers are not connected to the normal printer kinematics.
sk: Manuálne steppery (možno definovať ľubovoľný počet sekcií s predponou "manual_stepper"). Sú to steppery, ktoré sú ovládané príkazom MANUAL_STEPPER g-code. Napríklad: "MANUAL_STEPPER STEPPER=my_stepper MOVE=10 SPEED=5". Popis príkazu MANUAL_STEPPER nájdete v súbore [G-Codes](G-Codes.md#manual_stepper). Steppery nie sú pripojené k normálnej kinematike tlačiarne.

source: Generic heaters (one may define any number of sections with a "heater_generic" prefix). These heaters behave similarly to standard heaters (extruders, heated beds). Use the SET_HEATER_TEMPERATURE command (see [G-Codes](G-Codes.md#heaters) for details) to set the target temperature.
sk: Generické ohrievače (možno definovať ľubovoľný počet sekcií s predponou "heater_generic"). Tieto ohrievače sa správajú podobne ako štandardné ohrievače (extrudéry, vyhrievané lôžka). Použite príkaz SET_HEATER_TEMPERATURE (podrobnosti nájdete v [G-Codes](G-Codes.md#heaters)) na nastavenie cieľovej teploty.

source: LM75/LM75A two wire (I2C) connected temperature sensors. These sensors have a range of -55~125 C, so are usable for e.g. chamber temperature monitoring. They can also function as simple fan/heater controllers.
sk: LM75/LM75A dvojvodičové (I2C) pripojené teplotné senzory. Tieto snímače majú rozsah -55~125 C, takže sú použiteľné napr. monitorovanie teploty v komore. Môžu tiež fungovať ako jednoduché ovládače ventilátora/vykurovania.

source: See the [command reference](G-Codes.md#temperature_fan) for additional information.
sk: Ďalšie informácie nájdete v [odkaz na príkaz](G-Codes.md#temperature_fan).

source: Manually controlled fan (one may define any number of sections with a "fan_generic" prefix). The speed of a manually controlled fan is set with the SET_FAN_SPEED [gcode command](G-Codes.md#fan_generic).
sk: Manuálne ovládaný ventilátor (je možné definovať ľubovoľný počet sekcií s predponou "fan_generic"). Rýchlosť manuálne ovládaného ventilátora sa nastavuje pomocou SET_FAN_SPEED [príkaz gcode](G-Codes.md#fan_generic).

source: Servos (one may define any number of sections with a "servo" prefix). The servos may be controlled using the SET_SERVO [g-code command](G-Codes.md#servo). For example: SET_SERVO SERVO=my_servo ANGLE=180
sk: Servo (možno definovať ľubovoľný počet sekcií s predponou „servo“). Servá môžu byť ovládané pomocou SET_SERVO [príkaz g-kódu](G-Codes.md#servo). Napríklad: SET_SERVO SERVO=my_servo ANGLE=180

source: Run-time configurable output pins (one may define any number of sections with an "output_pin" prefix). Pins configured here will be setup as output pins and one may modify them at run-time using "SET_PIN PIN=my_pin VALUE=.1" type extended [g-code commands](G-Codes.md#output_pin).
sk: Výstupné kolíky konfigurovateľné za chodu (je možné definovať ľubovoľný počet sekcií s predponou "output_pin"). Piny nakonfigurované tu budú nastavené ako výstupné piny a je možné ich upraviť za behu pomocou rozšíreného typu "SET_PIN PIN=my_pin VALUE=.1" [príkazy kódu g](G-Codes.md#output_pin).

source: Configuration of Trinamic stepper motor drivers in UART/SPI mode. Additional information is in the [TMC Drivers guide](TMC_Drivers.md) and in the [command reference](G-Codes.md#tmcxxxx).
sk: Konfigurácia ovládačov krokového motora Trinamic v režime UART/SPI. Ďalšie informácie sú v [Sprievodca ovládačmi TMC](TMC_Drivers.md) a v [odkaz na príkaz](G-Codes.md#tmcxxxx).

source: See the [command reference](G-Codes.md#filament_switch_sensor) for more information.
sk: Ďalšie informácie nájdete v [odkaz na príkaz](G-Codes.md#filament_switch_sensor).

source: [extruder_stepper my_extra_stepper] extruder: # The extruder this stepper is synchronized to. If this is set to an # empty string then the stepper will not be synchronized to an # extruder. This parameter must be provided. #step_pin: #dir_pin: #enable_pin: #microsteps: #rotation_distance: # See the "stepper" section for the definition of the above # parameters.
sk: [extruder_stepper my_extra_stepper] extrudér: # Extrudér, s ktorým je tento krokový krok synchronizovaný. Ak je toto nastavené na an # prázdny reťazec, potom sa stepper nebude synchronizovať s an # extrudér. Tento parameter je potrebné zadať. #step_pin: #dir_pin: #enable_pin: #mikrokroky: #rotation_distance: # Definíciu vyššie uvedeného nájdete v časti „stepper“. # parametrov.

source: [printer] kinematics: polar max_z_velocity: # This sets the maximum velocity (in mm/s) of movement along the z # axis. This setting can be used to restrict the maximum speed of # the z stepper motor. The default is to use max_velocity for # max_z_velocity. max_z_accel: # This sets the maximum acceleration (in mm/s^2) of movement along # the z axis. It limits the acceleration of the z stepper motor. The # default is to use max_accel for max_z_accel. # The stepper_bed section is used to describe the stepper controlling # the bed. [stepper_bed] gear_ratio: # A gear_ratio must be specified and rotation_distance may not be # specified. For example, if the bed has an 80 toothed pulley driven # by a stepper with a 16 toothed pulley then one would specify a # gear ratio of "80:16". This parameter must be provided. # The stepper_arm section is used to describe the stepper controlling # the carriage on the arm. [stepper_arm] # The stepper_z section is used to describe the stepper controlling # the Z axis. [stepper_z]
sk: [tlačiareň] kinematika: polárna max_z_velocity: # Toto nastavuje maximálnu rýchlosť (v mm/s) pohybu pozdĺž z # os. Toto nastavenie možno použiť na obmedzenie maximálnej rýchlosti # krokový motor z. Predvolené je použitie max_velocity pre # max_z_velocity. max_z_accel: # Toto nastavuje maximálne zrýchlenie (v mm/s^2) pohybu pozdĺž # os z. Obmedzuje zrýchlenie krokového motora z. The # predvolené je použitie max_accel pre max_z_accel. # Časť stepper_bed sa používa na popis ovládania steppera # lôžko. [stepper_bed] prevodový pomer: # Musí byť špecifikovaný gear_ratio a rotácia nesmie byť # špecifikované. Napríklad, ak má posteľ poháňanú 80 ozubenú kladku # stepperom so 16 ozubenou kladkou, potom by sa dalo špecifikovať a # prevodový pomer "80:16". Tento parameter je potrebné zadať. # Časť stepper_arm sa používa na popis ovládania steppera # kočiar na ramene. [stepper_arm] # Časť stepper_z sa používa na popis ovládania steppera # os Z. [stepper_z]

source: [bltouch] sensor_pin: # Pin connected to the BLTouch sensor pin. Most BLTouch devices # require a pullup on the sensor pin (prefix the pin name with "^"). # This parameter must be provided. control_pin: # Pin connected to the BLTouch control pin. This parameter must be # provided. #pin_move_time: 0.680 # The amount of time (in seconds) to wait for the BLTouch pin to # move up or down. The default is 0.680 seconds. #stow_on_each_sample: True # This determines if Klipper should command the pin to move up # between each probe attempt when performing a multiple probe # sequence. Read the directions in docs/BLTouch.md before setting # this to False. The default is True. #probe_with_touch_mode: False # If this is set to True then Klipper will probe with the device in # "touch_mode". The default is False (probing in "pin_down" mode). #pin_up_reports_not_triggered: True # Set if the BLTouch consistently reports the probe in a "not # triggered" state after a successful "pin_up" command. This should # be True for all genuine BLTouch devices. Read the directions in # docs/BLTouch.md before setting this to False. The default is True. #pin_up_touch_mode_reports_triggered: True # Set if the BLTouch consistently reports a "triggered" state after # the commands "pin_up" followed by "touch_mode". This should be # True for all genuine BLTouch devices. Read the directions in # docs/BLTouch.md before setting this to False. The default is True. #set_output_mode: # Request a specific sensor pin output mode on the BLTouch V3.0 (and # later). This setting should not be used on other types of probes. # Set to "5V" to request a sensor pin output of 5 Volts (only use if # the controller board needs 5V mode and is 5V tolerant on its input # signal line). Set to "OD" to request the sensor pin output use # open drain mode. The default is to not request an output mode. #x_offset: #y_offset: #z_offset: #speed: #lift_speed: #samples: #sample_retract_dist: #samples_result: #samples_tolerance: #samples_tolerance_retries: # See the "probe" section for information on these parameters.
sk: [bltouch] senzor_pin: # Kolík pripojený ku kolíku snímača BLTouch. Väčšina zariadení BLTouch # vyžadujú vytiahnutie kolíka snímača (pred názvom kolíka uveďte „^“). # Tento parameter musí byť zadaný. control_pin: # Kolík pripojený k ovládaciemu kolíku BLTouch. Tento parameter musí byť # poskytnuté. #pin_move_time: 0,680 # Čas (v sekundách), ktorý sa má čakať, kým sa dotkne špendlík BLTouch # pohyb nahor alebo nadol. Predvolená hodnota je 0,680 sekundy. #stow_on_each_sample: Pravda # Toto určuje, či má Klipper prikázať kolíku, aby sa posunul nahor # medzi každým pokusom o sondu pri vykonávaní viacerých sond # sekvencia. Pred nastavením si prečítajte pokyny v docs/BLtouch.md # toto na False. Predvolená hodnota je True. #probe_with_touch_mode: Nepravda # Ak je toto nastavené na True, Klipper bude sondovať so zariadením # "touch_mode". Predvolená hodnota je False (sondovanie v režime "pin_down"). #pin_up_reports_not_triggered: Pravda # Nastavte, ak BLTouch neustále hlási sondu v „nie # triggered" stav po úspešnom príkaze "pin_up". To by malo # platí pre všetky originálne zariadenia BLTouch. Prečítajte si pokyny v # docs/BLtouch.md pred nastavením na False. Predvolená hodnota je True. #pin_up_touch_mode_reports_triggered: Pravda # Nastavte, ak BLTouch neustále hlási „spustený“ stav po # príkazy "pin_up" nasledované "touch_mode". Toto by malo byť # Platí pre všetky originálne zariadenia BLTouch. Prečítajte si pokyny v # docs/BLtouch.md pred nastavením na False. Predvolená hodnota je True. #set_output_mode: # Požiadajte o špecifický režim výstupu kolíkov snímača na BLTouch V3.0 (a # neskôr). Toto nastavenie by sa nemalo používať na iných typoch sond. # Nastavte na "5V", aby ste požadovali výstup na kolíku snímača 5 voltov (použite iba vtedy, ak # riadiaca doska potrebuje 5V režim a na svojom vstupe je tolerantná 5V # signálna linka). Nastavte na "OD", ak chcete požiadať o použitie výstupu kolíka snímača # režim otvoreného odtoku. Predvolené nastavenie je nepožadovať výstupný režim. #x_offset: #y_offset: #z_offset: #rýchlosť: #lift_speed: #vzorky: #sample_retract_dist: #samples_result: #samples_tolerance: #samples_tolerance_retries: # Informácie o týchto parametroch nájdete v časti „sonda“.

source: PCA9632 LED support. The PCA9632 is used on the FlashForge Dreamer.
sk: Podpora LED PCA9632. PCA9632 sa používa na FlashForge Dreamer.

source: [extruder] step_pin: dir_pin: enable_pin: microsteps: rotation_distance: #full_steps_per_rotation: #gear_ratio: # See the "stepper" section for a description of the above # parameters. If none of the above parameters are specified then no # stepper will be associated with the nozzle hotend (though a # SYNC_EXTRUDER_MOTION command may associate one at run-time). nozzle_diameter: # Diameter of the nozzle orifice (in mm). This parameter must be # provided. filament_diameter: # The nominal diameter of the raw filament (in mm) as it enters the # extruder. This parameter must be provided. #max_extrude_cross_section: # Maximum area (in mm^2) of an extrusion cross section (eg, # extrusion width multiplied by layer height). This setting prevents # excessive amounts of extrusion during relatively small XY moves. # If a move requests an extrusion rate that would exceed this value # it will cause an error to be returned. The default is: 4.0 * # nozzle_diameter^2 #instantaneous_corner_velocity: 1.000 # The maximum instantaneous velocity change (in mm/s) of the # extruder during the junction of two moves. The default is 1mm/s. #max_extrude_only_distance: 50.0 # Maximum length (in mm of raw filament) that a retraction or # extrude-only move may have. If a retraction or extrude-only move # requests a distance greater than this value it will cause an error # to be returned. The default is 50mm. #max_extrude_only_velocity: #max_extrude_only_accel: # Maximum velocity (in mm/s) and acceleration (in mm/s^2) of the # extruder motor for retractions and extrude-only moves. These # settings do not have any impact on normal printing moves. If not # specified then they are calculated to match the limit an XY # printing move with a cross section of 4.0*nozzle_diameter^2 would # have. #pressure_advance: 0.0 # The amount of raw filament to push into the extruder during # extruder acceleration. An equal amount of filament is retracted # during deceleration. It is measured in millimeters per # millimeter/second. The default is 0, which disables pressure # advance. #pressure_advance_smooth_time: 0.040 # A time range (in seconds) to use when calculating the average # extruder velocity for pressure advance. A larger value results in # smoother extruder movements. This parameter may not exceed 200ms. # This setting only applies if pressure_advance is non-zero. The # default is 0.040 (40 milliseconds). # # The remaining variables describe the extruder heater. heater_pin: # PWM output pin controlling the heater. This parameter must be # provided. #max_power: 1.0 # The maximum power (expressed as a value from 0.0 to 1.0) that the # heater_pin may be set to. The value 1.0 allows the pin to be set # fully enabled for extended periods, while a value of 0.5 would # allow the pin to be enabled for no more than half the time. This # setting may be used to limit the total power output (over extended # periods) to the heater. The default is 1.0. sensor_type: # Type of sensor - common thermistors are "EPCOS 100K B57560G104F", # "ATC Semitec 104GT-2", "ATC Semitec 104NT-4-R025H42G", "Generic # 3950","Honeywell 100K 135-104LAG-J01", "NTC 100K MGB18-104F39050L32", # "SliceEngineering 450", and "TDK NTCG104LH104JT1". See the # "Temperature sensors" section for other sensors. This parameter # must be provided. sensor_pin: # Analog input pin connected to the sensor. This parameter must be # provided. #pullup_resistor: 4700 # The resistance (in ohms) of the pullup attached to the thermistor. # This parameter is only valid when the sensor is a thermistor. The # default is 4700 ohms. #smooth_time: 1.0 # A time value (in seconds) over which temperature measurements will # be smoothed to reduce the impact of measurement noise. The default # is 1 seconds. control: # Control algorithm (either pid or watermark). This parameter must # be provided. pid_Kp: pid_Ki: pid_Kd: # The proportional (pid_Kp), integral (pid_Ki), and derivative # (pid_Kd) settings for the PID feedback control system. Klipper # evaluates the PID settings with the following general formula: # heater_pwm = (Kp*error + Ki*integral(error) - Kd*derivative(error)) / 255 # Where "error" is "requested_temperature - measured_temperature" # and "heater_pwm" is the requested heating rate with 0.0 being full # off and 1.0 being full on. Consider using the PID_CALIBRATE # command to obtain these parameters. The pid_Kp, pid_Ki, and pid_Kd # parameters must be provided for PID heaters. #max_delta: 2.0 # On 'watermark' controlled heaters this is the number of degrees in # Celsius above the target temperature before disabling the heater # as well as the number of degrees below the target before # re-enabling the heater. The default is 2 degrees Celsius. #pwm_cycle_time: 0.100 # Time in seconds for each software PWM cycle of the heater. It is # not recommended to set this unless there is an electrical # requirement to switch the heater faster than 10 times a second. # The default is 0.100 seconds. #min_extrude_temp: 170 # The minimum temperature (in Celsius) at which extruder move # commands may be issued. The default is 170 Celsius. min_temp: max_temp: # The maximum range of valid temperatures (in Celsius) that the # heater must remain within. This controls a safety feature # implemented in the micro-controller code - should the measured # temperature ever fall outside this range then the micro-controller # will go into a shutdown state. This check can help detect some # heater and sensor hardware failures. Set this range just wide # enough so that reasonable temperatures do not result in an error. # These parameters must be provided.
sk: [extrudér] step_pin: dir_pin: enable_pin: mikrokroky: rotačná_vzdialenosť: #full_steps_per_rotation: #gear_ratio: # Popis vyššie uvedeného nájdete v časti „stepper“. # parametrov. Ak nie je špecifikovaný žiadny z vyššie uvedených parametrov, potom nie # stepper bude priradený k hotendu trysky (hoci a # Príkaz SYNC_EXTRUDER_MOTION môže priradiť jeden za behu). tryska_priemer: # Priemer otvoru trysky (v mm). Tento parameter musí byť # poskytnuté. priemer_vlákna: # Menovitý priemer surového vlákna (v mm) pri jeho vstupe do # extrudér. Tento parameter je potrebné zadať. #max_extrude_cross_section: # Maximálna plocha (v mm^2) prierezu extrúzie (napr. # šírka vytláčania vynásobená výškou vrstvy). Toto nastavenie zabraňuje # nadmerné množstvo vytláčania počas relatívne malých pohybov XY. # Ak pohyb vyžaduje rýchlosť vytláčania, ktorá by prekročila túto hodnotu # spôsobí, že sa vráti chyba. Predvolená hodnota je: 4,0 * # priemer_dýzy^2 #instantaneous_corner_velocity: 1 000 # Maximálna okamžitá zmena rýchlosti (v mm/s). # extrudér počas spojenia dvoch ťahov. Predvolená hodnota je 1 mm/s. #max_extrude_only_distance: 50,0 # Maximálna dĺžka (v mm surového filamentu), pri ktorej sa zatiahne resp # presun iba na vysunutie môže mať. Ak je pohyb iba zatiahnutie alebo vysunutie # požaduje vzdialenosť väčšiu ako je táto hodnota, spôsobí to chybu # na vrátenie. Predvolená hodnota je 50 mm. #max_extrude_only_velocity: #max_extrude_only_accel: # Maximálna rýchlosť (v mm/s) a zrýchlenie (v mm/s^2) stroja # motor extrudéra pre zasúvanie a pohyby iba pri vytláčaní. Títo # nastavenia nemajú žiadny vplyv na bežné tlačové pohyby. Ak nie # potom sa vypočítajú tak, aby zodpovedali limitu XY # tlačový pohyb s prierezom 4,0*priemer_dýzy^2 by # mať. #pressure_advance: 0,0 # Množstvo surového vlákna, ktoré sa má vtlačiť do extrudéra # zrýchlenie extrudéra. Rovnaké množstvo vlákna sa zatiahne # počas spomaľovania. Meria sa v milimetroch na # milimeter/sekundu. Predvolená hodnota je 0, ktorá deaktivuje tlak # záloha. #pressure_advance_smooth_time: 0,040 # Časový rozsah (v sekundách), ktorý sa má použiť pri výpočte priemeru # rýchlosť extrudéra pre posun tlaku. Výsledkom je väčšia hodnota # hladšie pohyby extrudéra. Tento parameter nesmie presiahnuť 200 ms. # Toto nastavenie sa použije iba vtedy, ak je tlak_predstihu nenulový. The # predvolená hodnota je 0,040 (40 milisekúnd). # # Zostávajúce premenné popisujú ohrievač extrudéra. ohrievač_pin: # Výstupný kolík PWM ovládajúci ohrievač. Tento parameter musí byť # poskytnuté. #max_power: 1,0 # Maximálny výkon (vyjadrený ako hodnota od 0,0 do 1,0), ktorý # heat_pin môže byť nastavený na. Hodnota 1,0 umožňuje nastavenie kolíka # plne povolené na dlhšie obdobia, kým hodnota 0,5 by bola # dovoľte, aby bol PIN povolený maximálne na polovicu času. Toto Nastavenie # možno použiť na obmedzenie celkového výstupného výkonu (príliš rozšírené # obdobia) do ohrievača. Predvolená hodnota je 1.0. senzor_typ: # Typ snímača - bežné termistory sú "EPCOS 100K B57560G104F", # "ATC Semitec 104GT-2", "ATC Semitec 104NT-4-R025H42G", "Všeobecné # 3950","Honeywell 100K 135-104LAG-J01", "NTC 100K MGB18-104F39050L32", # "SliceEngineering 450" a "TDK NTCG104LH104JT1". Pozrite si # Časť "Snímače teploty" pre ostatné snímače. Tento parameter # musí byť poskytnuté. senzor_pin: # Analógový vstupný kolík pripojený k senzoru. Tento parameter musí byť # poskytnuté. #pullup_rezistor: 4700 # Odpor (v ohmoch) pullupu pripojeného k termistoru. # Tento parameter je platný len vtedy, keď je snímačom termistor. The # predvolená hodnota je 4700 ohmov. #smooth_time: 1,0 # Hodnota času (v sekundách), počas ktorej budú merania teploty # byť vyhladený, aby sa znížil vplyv hluku merania. Predvolená hodnota # je 1 sekunda. ovládanie: # Riadiaci algoritmus (buď pid alebo vodoznak). Tento parameter musí # byť poskytovaný. pid_Kp: pid_Ki: pid_Kd: # Proporcionálny (pid_Kp), integrál (pid_Ki) a derivácia # (pid_Kd) nastavenia pre PID spätnoväzbový riadiaci systém. Klipper # vyhodnotí nastavenia PID podľa nasledujúceho všeobecného vzorca: # heat_pwm = (Kp*chyba + Ki*integrál (chyba) - Kd*derivácia (chyba)) / 255 # Kde "chyba" je "requested_temperature - meraná_teplota" # a "heater_pwm" je požadovaná rýchlosť ohrevu, pričom 0,0 je plné # vypnuté a 1.0 je plne zapnuté. Zvážte použitie PID_CALIBRATE # príkaz na získanie týchto parametrov. Pid_Kp, pid_Ki a pid_Kd Pre ohrievače PID musia byť poskytnuté # parametre. #max_delta: 2,0 # Na ohrievačoch riadených 'vodoznakom' je to počet stupňov v # Celzia nad cieľovou teplotou pred vypnutím ohrievača # ako aj počet stupňov pod cieľom predtým # opätovné zapnutie ohrievača. Predvolená hodnota je 2 stupne Celzia. #pwm_cycle_time: 0,100 # Čas v sekundách pre každý softvérový cyklus PWM ohrievača. to je # sa neodporúča nastavovať pokiaľ tam nie je elektrina # požiadavka spínať ohrievač rýchlejšie ako 10-krát za sekundu. # Predvolená hodnota je 0,100 sekundy. #min_extrude_temp: 170 # Minimálna teplota (v stupňoch Celzia), pri ktorej sa extrudér pohybuje Môžu byť vydané # príkazy. Predvolená hodnota je 170 stupňov Celzia. min_temp: max_temp: # Maximálny rozsah platných teplôt (v stupňoch Celzia), ktoré Vnútri musí zostať # ohrievač. Toto ovláda bezpečnostný prvok # implementovaný v kóde mikrokontroléra - mal by sa merať # teplota nikdy neklesne mimo tento rozsah potom mikroovládač # prejde do stavu vypnutia. Táto kontrola môže pomôcť odhaliť niektoré # poruchy hardvéru ohrievača a snímača. Nastavte tento rozsah len široko # dosť na to, aby rozumné teploty neviedli k chybe. # Tieto parametre musia byť poskytnuté.
