Repository: fran6p/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Config_Reference.po
Languages: sk

source: Execute gcode when a button is pressed or released (or when a pin changes state). You can check the state of the button by using `QUERY_BUTTON button=my_gcode_button`.
sk: Vykonajte gcode, keď je stlačené alebo uvoľnené tlačidlo (alebo keď kolík zmení stav). Stav tlačidla môžete skontrolovať pomocou tlačidla „QUERY_BUTTON button=my_gcode_button“.

source: Statically configured digital output pins (one may define any number of sections with a "static_digital_output" prefix). Pins configured here will be setup as a GPIO output during MCU configuration. They can not be changed at run-time.
sk: Staticky nakonfigurované digitálne výstupné kolíky (je možné definovať ľubovoľný počet sekcií s predponou "static_digital_output"). Piny nakonfigurované tu budú nastavené ako výstup GPIO počas konfigurácie MCU. Nedajú sa zmeniť za behu.

source: Multiple pin outputs (one may define any number of sections with a "multi_pin" prefix). A multi_pin output creates an internal pin alias that can modify multiple output pins each time the alias pin is set. For example, one could define a "[multi_pin my_fan]" object containing two pins and then set "pin=multi_pin:my_fan" in the "[fan]" section - on each fan change both output pins would be updated. These aliases may not be used with stepper motor pins.
sk: Viacpinové výstupy (jeden môže definovať ľubovoľný počet sekcií s predponou "multi_pin"). Multi_pin výstup vytvára interný alias pinu, ktorý môže upravovať viacero výstupných pinov pri každom nastavení pinu aliasu. Napríklad je možné definovať objekt „[multi_pin my_fan]“ obsahujúci dva kolíky a potom nastaviť „pin=multi_pin:my_fan“ v sekcii „[fan]“ – pri každej výmene ventilátora by sa aktualizovali oba výstupné kolíky. Tieto aliasy sa nesmú používať s kolíkmi krokového motora.

source: Configure a TMC2130 stepper motor driver via SPI bus. To use this feature, define a config section with a "tmc2130" prefix followed by the name of the corresponding stepper config section (for example, "[tmc2130 stepper_x]").
sk: Nakonfigurujte ovládač krokového motora TMC2130 cez zbernicu SPI. Ak chcete použiť túto funkciu, definujte konfiguračnú sekciu s predponou "tmc2130", za ktorou bude nasledovať názov zodpovedajúcej konfiguračnej sekcie steppera (napríklad "[tmc2130 stepper_x]").

source: Configure a TMC2208 (or TMC2224) stepper motor driver via single wire UART. To use this feature, define a config section with a "tmc2208" prefix followed by the name of the corresponding stepper config section (for example, "[tmc2208 stepper_x]").
sk: Nakonfigurujte ovládač krokového motora TMC2208 (alebo TMC2224) cez jednožilový UART. Ak chcete použiť túto funkciu, definujte konfiguračnú sekciu s predponou "tmc2208", za ktorou bude nasledovať názov zodpovedajúcej konfiguračnej sekcie steppera (napríklad "[tmc2208 stepper_x]").

source: Configure a TMC2209 stepper motor driver via single wire UART. To use this feature, define a config section with a "tmc2209" prefix followed by the name of the corresponding stepper config section (for example, "[tmc2209 stepper_x]").
sk: Nakonfigurujte ovládač krokového motora TMC2209 cez jednožilový UART. Ak chcete použiť túto funkciu, definujte konfiguračnú sekciu s predponou "tmc2209", za ktorou bude nasledovať názov zodpovedajúcej konfiguračnej sekcie steppera (napríklad "[tmc2209 stepper_x]").

source: Configure a TMC2660 stepper motor driver via SPI bus. To use this feature, define a config section with a tmc2660 prefix followed by the name of the corresponding stepper config section (for example, "[tmc2660 stepper_x]").
sk: Nakonfigurujte ovládač krokového motora TMC2660 cez zbernicu SPI. Ak chcete použiť túto funkciu, definujte konfiguračnú sekciu s predponou tmc2660, za ktorou nasleduje názov zodpovedajúcej konfiguračnej sekcie steppera (napríklad "[tmc2660 stepper_x]").

source: Configure a TMC5160 stepper motor driver via SPI bus. To use this feature, define a config section with a "tmc5160" prefix followed by the name of the corresponding stepper config section (for example, "[tmc5160 stepper_x]").
sk: Nakonfigurujte ovládač krokového motora TMC5160 cez zbernicu SPI. Ak chcete použiť túto funkciu, definujte konfiguračnú sekciu s predponou "tmc5160", za ktorou bude nasledovať názov zodpovedajúcej konfiguračnej sekcie steppera (napríklad "[tmc5160 stepper_x]").

source: Run-time stepper motor current configuration
sk: Konfigurácia prúdu krokového motora za chodu

source: Statically configured AD5206 digipots connected via SPI bus (one may define any number of sections with an "ad5206" prefix).
sk: Staticky nakonfigurované AD5206 digipoty pripojené cez SPI zbernicu (možno definovať ľubovoľný počet sekcií s prefixom "ad5206").

source: Statically configured MCP4451 digipot connected via I2C bus (one may define any number of sections with an "mcp4451" prefix).
sk: Staticky nakonfigurovaný digipot MCP4451 pripojený cez I2C zbernicu (možno definovať ľubovoľný počet sekcií s predponou „mcp4451“).

source: Statically configured MCP4018 digipot connected via two gpio "bit banging" pins (one may define any number of sections with an "mcp4018" prefix).
sk: Staticky nakonfigurovaný MCP4018 digipot pripojený cez dva gpio kolíky „bit banging“ (jeden môže definovať ľubovoľný počet sekcií s predponou „mcp4018“).

source: Display support
sk: Podpora displeja

source: Information on configuring hd44780 displays (which is used in "RepRapDiscount 2004 Smart Controller" type displays).
sk: Informácie o konfigurácii displejov hd44780 (ktoré sa používajú v displejoch typu „RepRapDiscount 2004 Smart Controller“).

source: Information on configuring an hd44780_spi display - a 20x04 display controlled via a hardware "shift register" (which is used in mightyboard based printers).
sk: Informácie o konfigurácii displeja hd44780_spi - displej s rozmermi 20x04 ovládaný prostredníctvom hardvérového "posuvného registra" (ktorý sa používa v tlačiarňach na báze mayyboard).

source: Information on configuring st7920 displays (which is used in "RepRapDiscount 12864 Full Graphic Smart Controller" type displays).
sk: Informácie o konfigurácii displejov st7920 (ktoré sa používajú v displejoch typu "RepRapDiscount 12864 Full Graphic Smart Controller").

source: Information on configuring an emulated st7920 display - found in some "2.4 inch touchscreen devices" and similar.
sk: Informácie o konfigurácii emulovaného displeja st7920 – nájdete v niektorých „2,4-palcových zariadeniach s dotykovou obrazovkou“ a podobne.

source: Information on configuring uc1701 displays (which is used in "MKS Mini 12864" type displays).
sk: Informácie o konfigurácii displejov uc1701 (ktoré sa používajú v displejoch typu „MKS Mini 12864“).

source: ssd1306 and sh1106 displays
sk: Displeje ssd1306 a sh1106

source: Information on configuring ssd1306 and sh1106 displays.
sk: Informácie o konfigurácii displejov ssd1306 a sh1106.

source: A [default set of display groups](../klippy/extras/display/display.cfg) are automatically created. One can replace or extend these display_data items by overriding the defaults in the main printer.cfg config file.
sk: Automaticky sa vytvorí [predvolená sada skupín displejov] (../klippy/extras/display/display.cfg). Tieto položky display_data je možné nahradiť alebo rozšíriť prepísaním predvolených nastavení v hlavnom konfiguračnom súbore printer.cfg.

source: Display a custom glyph on displays that support it. The given name will be assigned the given display data which can then be referenced in the display templates by their name surrounded by two "tilde" symbols i.e. `~my_display_glyph~`
sk: Zobrazte vlastný glyf na displejoch, ktoré ho podporujú. Danému názvu budú priradené dané údaje zobrazenia, na ktoré sa potom môžu odkazovať v šablónach zobrazenia ich názvom obklopeným dvoma symbolmi „vlnovky“, t. j. `~my_display_glyph~`

source: See [sample-glyphs.cfg](../config/sample-glyphs.cfg) for some examples.
sk: Niektoré príklady nájdete v [sample-glyphs.cfg](../config/sample-glyphs.cfg).

source: If a primary [display] section has been defined in printer.cfg as shown above it is possible to define multiple auxiliary displays. Note that auxiliary displays do not currently support menu functionality, thus they do not support the "menu" options or button configuration.
sk: Ak bola v printer.cfg definovaná primárna sekcia [zobrazenie], ako je uvedené vyššie, je možné definovať viacero pomocných obrazoviek. Všimnite si, že pomocné displeje momentálne nepodporujú funkcie ponuky, teda nepodporujú možnosti „ponuky“ alebo konfiguráciu tlačidiel.

source: Customizable lcd display menus.
sk: Prispôsobiteľné ponuky LCD displeja.

source: A [default set of menus](../klippy/extras/display/menu.cfg) are automatically created. One can replace or extend the menu by overriding the defaults in the main printer.cfg config file.
sk: Automaticky sa vytvorí [predvolený súbor ponúk] (../klippy/extras/display/menu.cfg). Ponuku možno nahradiť alebo rozšíriť prepísaním predvolených nastavení v hlavnom konfiguračnom súbore printer.cfg.

source: See the [command template document](Command_Templates.md#menu-templates) for information on menu attributes available during template rendering.
sk: Pozrite si [dokument šablóny príkazov](Command_Templates.md#menu-templates), kde nájdete informácie o atribútoch ponuky dostupných počas vykresľovania šablóny.

source: Filament Switch Sensor. Support for filament insert and runout detection using a switch sensor, such as an endstop switch.
sk: Senzor prepínača vlákna. Podpora pre detekciu vloženia vlákna a hádzania pomocou snímača spínača, ako je koncový spínač.

source: Filament Motion Sensor. Support for filament insert and runout detection using an encoder that toggles the output pin during filament movement through the sensor.
sk: Snímač pohybu vlákna. Podpora pre detekciu vloženia vlákna a hádzania pomocou kódovača, ktorý prepína výstupný kolík počas pohybu vlákna cez snímač.

source: Board specific hardware support
sk: Hardvérová podpora špecifická pre dosku

source: Configure an SX1509 I2C to GPIO expander. Due to the delay incurred by I2C communication you should NOT use SX1509 pins as stepper enable, step or dir pins or any other pin that requires fast bit-banging. They are best used as static or gcode controlled digital outputs or hardware-pwm pins for e.g. fans. One may define any number of sections with an "sx1509" prefix. Each expander provides a set of 16 pins (sx1509_my_sx1509:PIN_0 to sx1509_my_sx1509:PIN_15) which can be used in the printer configuration.
sk: Nakonfigurujte expandér SX1509 I2C na GPIO. Kvôli oneskoreniu spôsobenému I2C komunikáciou by ste NEPOUŽÍVALI kolíky SX1509 na aktiváciu krokovania, krokové alebo dir kolíky alebo akékoľvek iné kolíky, ktoré vyžadujú rýchle bit-bangovanie. Najlepšie sa používajú ako statické alebo gcode riadené digitálne výstupy alebo hardvérovo-pwm piny pre napr. Fanúšikovia. Je možné definovať ľubovoľný počet sekcií s predponou „sx1509“. Každý expandér poskytuje sadu 16 pinov (sx1509_my_sx1509:PIN_0 až sx1509_my_sx1509:PIN_15), ktoré možno použiť v konfigurácii tlačiarne.

source: See the [generic-duet2-duex.cfg](../config/generic-duet2-duex.cfg) file for an example.
sk: Príklad nájdete v súbore [generic-duet2-duex.cfg](../config/generic-duet2-duex.cfg).

source: Duet2 Maestro analog scaling by vref and vssa readings. Defining an adc_scaled section enables virtual adc pins (such as "my_name:PB0") that are automatically adjusted by the board's vref and vssa monitoring pins. Be sure to define this config section above any config sections that use one these virtual pins.
sk: Analógové škálovanie Duet2 Maestro podľa hodnôt vref a vssa. Definovanie sekcie adc_scaled umožňuje virtuálne adc piny (ako napríklad "my_name:PB0"), ktoré sú automaticky upravované monitorovacími pinmi vref a vssa dosky. Nezabudnite definovať túto konfiguračnú sekciu nad všetkými konfiguračnými sekciami, ktoré používajú jeden z týchto virtuálnych pinov.

source: See the [generic-duet2-maestro.cfg](../config/generic-duet2-maestro.cfg) file for an example.
sk: Príklad nájdete v súbore [generic-duet2-maestro.cfg](../config/generic-duet2-maestro.cfg).

source: Other Custom Modules
sk: Ďalšie vlastné moduly

source: Palette 2 multimaterial support - provides a tighter integration supporting Palette 2 devices in connected mode.
sk: Multimateriálová podpora Palette 2 - poskytuje užšiu integráciu podporujúcu zariadenia Palette 2 v prepojenom režime.

source: If you use this module, do not use the Palette 2 plugin for Octoprint as they will conflict, and 1 will fail to initialize properly likely aborting your print.
sk: Ak použijete tento modul, nepoužívajte doplnok Palette 2 pre Octoprint, pretože budú v konflikte a modul 1 sa nepodarí správne inicializovať, čo pravdepodobne spôsobí prerušenie tlače.

source: If you use Octoprint and stream gcode over the serial port instead of printing from virtual_sd, then remo **M1** and **M0** from *Pausing commands* in *Settings > Serial Connection > Firmware & protocol* will prevent the need to start print on the Palette 2 and unpausing in Octoprint for your print to begin.
sk: Ak používate Octoprint a streamujete gcode cez sériový port namiesto tlače z virtual_sd, potom remo **M1** a **M0** z *Pozastavenie príkazov* v *Nastavenia > Sériové pripojenie > Firmvér a protokol* zabráni potrebe na spustenie tlače na Palete 2 a zrušenie pozastavenia v Octoprint, aby sa mohla začať tlač.

source: Common bus parameters
sk: Spoločné parametre zbernice

source: Common SPI settings
sk: Bežné nastavenia SPI

source: Common I2C settings
sk: Bežné nastavenia I2C

source: [mcu] serial: # The serial port to connect to the MCU. If unsure (or if it # changes) see the "Where's my serial port?" section of the FAQ. # This parameter must be provided when using a serial port. #baud: 250000 # The baud rate to use. The default is 250000. #canbus_uuid: # If using a device connected to a CAN bus then this sets the unique # chip identifier to connect to. This value must be provided when using # CAN bus for communication. #canbus_interface: # If using a device connected to a CAN bus then this sets the CAN # network interface to use. The default is 'can0'. #restart_method: # This controls the mechanism the host will use to reset the # micro-controller. The choices are 'arduino', 'cheetah', 'rpi_usb', # and 'command'. The 'arduino' method (toggle DTR) is common on # Arduino boards and clones. The 'cheetah' method is a special # method needed for some Fysetc Cheetah boards. The 'rpi_usb' method # is useful on Raspberry Pi boards with micro-controllers powered # over USB - it briefly disables power to all USB ports to # accomplish a micro-controller reset. The 'command' method involves # sending a Klipper command to the micro-controller so that it can # reset itself. The default is 'arduino' if the micro-controller # communicates over a serial port, 'command' otherwise.
sk: [mcu] seriál: # Sériový port na pripojenie k MCU. Ak si nie ste istí (resp # zmien) pozrite si "Kde je môj sériový port?" časti FAQ. # Tento parameter je potrebné zadať pri použití sériového portu. #baud: 250 000 # Použitá prenosová rýchlosť. Predvolená hodnota je 250 000. #canbus_uuid: # Ak používate zariadenie pripojené na zbernicu CAN, nastaví sa tým jedinečný # identifikátor čipu na pripojenie. Táto hodnota musí byť uvedená pri použití # CAN zbernica pre komunikáciu. #canbus_interface: # Ak používate zariadenie pripojené na zbernicu CAN, nastaví sa CAN # sieťové rozhranie na použitie. Predvolená hodnota je 'can0'. #restart_method: # Toto riadi mechanizmus, ktorý hostiteľ použije na resetovanie # mikroovládač. Možnosti sú 'arduino', 'gepard', 'rpi_usb', # a 'príkaz'. Metóda 'arduino' (prepínanie DTR) je bežná # Arduino dosky a klony. Metóda 'geparda' je špeciálna # metóda potrebná pre niektoré dosky Fysetc Cheetah. Metóda 'rpi_usb' # je užitočné na doskách Raspberry Pi s napájanými mikrokontrolérmi # cez USB - nakrátko vypne napájanie všetkých portov USB # vykonajte reset mikrokontroléra. Metóda „príkazu“ zahŕňa # odoslanie príkazu Klipper do mikroovládača, aby mohol # sa resetuje. Predvolená hodnota je „arduino“, ak ide o mikroovládač # komunikuje cez sériový port, inak 'príkaz'.

source: [mcu my_extra_mcu] # See the "mcu" section for configuration parameters.
sk: [mcu my_extra_mcu] # Konfiguračné parametre nájdete v časti "mcu".

source: [printer] kinematics: cartesian max_z_velocity: # This sets the maximum velocity (in mm/s) of movement along the z # axis. This setting can be used to restrict the maximum speed of # the z stepper motor. The default is to use max_velocity for # max_z_velocity. max_z_accel: # This sets the maximum acceleration (in mm/s^2) of movement along # the z axis. It limits the acceleration of the z stepper motor. The # default is to use max_accel for max_z_accel. # The stepper_x section is used to describe the stepper controlling # the X axis in a cartesian robot. [stepper_x] # The stepper_y section is used to describe the stepper controlling # the Y axis in a cartesian robot. [stepper_y] # The stepper_z section is used to describe the stepper controlling # the Z axis in a cartesian robot. [stepper_z]
sk: [tlačiareň] kinematika: karteziánska max_z_velocity: # Toto nastavuje maximálnu rýchlosť (v mm/s) pohybu pozdĺž z # os. Toto nastavenie možno použiť na obmedzenie maximálnej rýchlosti # krokový motor z. Predvolené je použitie max_velocity pre # max_z_velocity. max_z_accel: # Toto nastavuje maximálne zrýchlenie (v mm/s^2) pohybu pozdĺž # os z. Obmedzuje zrýchlenie krokového motora z. The # predvolené je použitie max_accel pre max_z_accel. # Sekcia stepper_x sa používa na popis ovládania steppera # os X v karteziánskom robote. [stepper_x] # Sekcia stepper_y sa používa na popis ovládania steppera # os Y v karteziánskom robote. [stepper_y] # Časť stepper_z sa používa na popis ovládania steppera # os Z v karteziánskom robote. [stepper_z]

source: [printer] kinematics: corexy max_z_velocity: # This sets the maximum velocity (in mm/s) of movement along the z # axis. This setting can be used to restrict the maximum speed of # the z stepper motor. The default is to use max_velocity for # max_z_velocity. max_z_accel: # This sets the maximum acceleration (in mm/s^2) of movement along # the z axis. It limits the acceleration of the z stepper motor. The # default is to use max_accel for max_z_accel. # The stepper_x section is used to describe the X axis as well as the # stepper controlling the X+Y movement. [stepper_x] # The stepper_y section is used to describe the Y axis as well as the # stepper controlling the X-Y movement. [stepper_y] # The stepper_z section is used to describe the stepper controlling # the Z axis. [stepper_z]
sk: [tlačiareň] kinematika: Corexy max_z_velocity: # Toto nastavuje maximálnu rýchlosť (v mm/s) pohybu pozdĺž z # os. Toto nastavenie možno použiť na obmedzenie maximálnej rýchlosti # krokový motor z. Predvolené je použitie max_velocity pre # max_z_velocity. max_z_accel: # Toto nastavuje maximálne zrýchlenie (v mm/s^2) pohybu pozdĺž # os z. Obmedzuje zrýchlenie krokového motora z. The # predvolené je použitie max_accel pre max_z_accel. # Časť stepper_x sa používa na opis osi X, ako aj osi X # stepper ovládajúci pohyb X+Y. [stepper_x] # Sekcia stepper_y sa používa na opis osi Y, ako aj osi Y # stepper ovládajúci pohyb X-Y. [stepper_y] # Časť stepper_z sa používa na popis ovládania steppera # os Z. [stepper_z]

source: [printer] kinematics: corexz max_z_velocity: # This sets the maximum velocity (in mm/s) of movement along the z # axis. The default is to use max_velocity for max_z_velocity. max_z_accel: # This sets the maximum acceleration (in mm/s^2) of movement along # the z axis. The default is to use max_accel for max_z_accel. # The stepper_x section is used to describe the X axis as well as the # stepper controlling the X+Z movement. [stepper_x] # The stepper_y section is used to describe the stepper controlling # the Y axis. [stepper_y] # The stepper_z section is used to describe the Z axis as well as the # stepper controlling the X-Z movement. [stepper_z]
sk: [tlačiareň] kinematika: corexz max_z_velocity: # Toto nastavuje maximálnu rýchlosť (v mm/s) pohybu pozdĺž z # os. Predvolená hodnota je použitie max_velocity pre max_z_velocity. max_z_accel: # Toto nastavuje maximálne zrýchlenie (v mm/s^2) pohybu pozdĺž # os z. Predvolené je použitie max_accel pre max_z_accel. # Časť stepper_x sa používa na opis osi X, ako aj osi X # stepper ovládajúci pohyb X+Z. [stepper_x] # Sekcia stepper_y sa používa na popis ovládania steppera # os Y. [stepper_y] # Časť stepper_z sa používa na popis osi Z, ako aj osi Z # stepper ovládajúci pohyb X-Z. [stepper_z]

source: [printer] kinematics: hybrid_corexz max_z_velocity: # This sets the maximum velocity (in mm/s) of movement along the z # axis. The default is to use max_velocity for max_z_velocity. max_z_accel: # This sets the maximum acceleration (in mm/s^2) of movement along # the z axis. The default is to use max_accel for max_z_accel. # The stepper_x section is used to describe the X axis as well as the # stepper controlling the X-Z movement. [stepper_x] # The stepper_y section is used to describe the stepper controlling # the Y axis. [stepper_y] # The stepper_z section is used to describe the stepper controlling # the Z axis. [stepper_z]
sk: [tlačiareň] kinematika: hybrid_corexz max_z_velocity: # Toto nastavuje maximálnu rýchlosť (v mm/s) pohybu pozdĺž z # os. Predvolená hodnota je použitie max_velocity pre max_z_velocity. max_z_accel: # Toto nastavuje maximálne zrýchlenie (v mm/s^2) pohybu pozdĺž # os z. Predvolené je použitie max_accel pre max_z_accel. # Časť stepper_x sa používa na opis osi X, ako aj osi X # stepper ovládajúci pohyb X-Z. [stepper_x] # Sekcia stepper_y sa používa na popis ovládania steppera # os Y. [stepper_y] # Časť stepper_z sa používa na popis ovládania steppera # os Z. [stepper_z]
