Repository: fran6p/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Config_Reference.po
Languages: sk

source: [printer] kinematics: delta max_z_velocity: # For delta printers this limits the maximum velocity (in mm/s) of # moves with z axis movement. This setting can be used to reduce the # maximum speed of up/down moves (which require a higher step rate # than other moves on a delta printer). The default is to use # max_velocity for max_z_velocity. #max_z_accel: # This sets the maximum acceleration (in mm/s^2) of movement along # the z axis. Setting this may be useful if the printer can reach higher # acceleration on XY moves than Z moves (eg, when using input shaper). # The default is to use max_accel for max_z_accel. #minimum_z_position: 0 # The minimum Z position that the user may command the head to move # to. The default is 0. delta_radius: # Radius (in mm) of the horizontal circle formed by the three linear # axis towers. This parameter may also be calculated as: # delta_radius = smooth_rod_offset - effector_offset - carriage_offset # This parameter must be provided. #print_radius: # The radius (in mm) of valid toolhead XY coordinates. One may use # this setting to customize the range checking of toolhead moves. If # a large value is specified here then it may be possible to command # the toolhead into a collision with a tower. The default is to use # delta_radius for print_radius (which would normally prevent a # tower collision). # The stepper_a section describes the stepper controlling the front # left tower (at 210 degrees). This section also controls the homing # parameters (homing_speed, homing_retract_dist) for all towers. [stepper_a] position_endstop: # Distance (in mm) between the nozzle and the bed when the nozzle is # in the center of the build area and the endstop triggers. This # parameter must be provided for stepper_a; for stepper_b and # stepper_c this parameter defaults to the value specified for # stepper_a. arm_length: # Length (in mm) of the diagonal rod that connects this tower to the # print head. This parameter must be provided for stepper_a; for # stepper_b and stepper_c this parameter defaults to the value # specified for stepper_a. #angle: # This option specifies the angle (in degrees) that the tower is # at. The default is 210 for stepper_a, 330 for stepper_b, and 90 # for stepper_c. # The stepper_b section describes the stepper controlling the front # right tower (at 330 degrees). [stepper_b] # The stepper_c section describes the stepper controlling the rear # tower (at 90 degrees). [stepper_c] # The delta_calibrate section enables a DELTA_CALIBRATE extended # g-code command that can calibrate the tower endstop positions and # angles. [delta_calibrate] radius: # Radius (in mm) of the area that may be probed. This is the radius # of nozzle coordinates to be probed; if using an automatic probe # with an XY offset then choose a radius small enough so that the # probe always fits over the bed. This parameter must be provided. #speed: 50 # The speed (in mm/s) of non-probing moves during the calibration. # The default is 50. #horizontal_move_z: 5 # The height (in mm) that the head should be commanded to move to # just prior to starting a probe operation. The default is 5.
sk: [tlačiareň] kinematika: delta max_z_velocity: # Pre delta tlačiarne to obmedzuje maximálnu rýchlosť (v mm/s). # sa pohybuje s pohybom osi z. Toto nastavenie možno použiť na zníženie # maximálna rýchlosť pohybov nahor/nadol (ktoré vyžadujú vyššiu rýchlosť krokov # než iné pohyby na delta tlačiarni). Predvolená hodnota je použiť # max_velocity pre max_z_velocity. #max_z_accel: # Toto nastavuje maximálne zrýchlenie (v mm/s^2) pohybu pozdĺž # os z. Nastavenie môže byť užitočné, ak tlačiareň dosiahne vyššie # zrýchlenie pri XY pohyboch ako pri Z (napr. pri použití vstupného tvarovača). # Predvolené je použitie max_accel pre max_z_accel. #minimum_z_position: 0 # Minimálna poloha Z, ktorú môže používateľ prikázať pohybu hlavy # až. Predvolená hodnota je 0. delta_radius: # Polomer (v mm) vodorovného kruhu tvoreného tromi lineárnymi # osové veže. Tento parameter možno vypočítať aj takto: # delta_radius = smooth_rod_offset - effector_offset - carg_offset # Tento parameter musí byť zadaný. #print_radius: # Polomer (v mm) platných súradníc XY hlavy nástroja. Jeden môže použiť # toto nastavenie na prispôsobenie kontroly rozsahu pohybov nástrojovej hlavy. Ak # je tu zadaná veľká hodnota, potom je možné zadať príkaz # nástrojová hlava do zrážky s vežou. Predvolená hodnota je použiť # delta_radius pre print_radius (čo by normálne zabránilo a # kolízia veže). # Časť stepper_a popisuje stepper ovládajúci prednú časť # ľavá veža (pri 210 stupňoch). Táto sekcia tiež riadi navádzanie # parametrov (homing_speed, homing_retract_dist) pre všetky veže. [stepper_a] position_endstop: # Vzdialenosť (v mm) medzi tryskou a lôžkom, keď je tryska zapnutá # v strede stavebnej oblasti a spúšťa sa koncový doraz. Toto # parameter musí byť poskytnutý pre stepper_a; pre stepper_b a # stepper_c tento parameter má predvolenú hodnotu zadanú pre # stepper_a. dĺžka ruky: # Dĺžka (v mm) diagonálnej tyče, ktorá spája túto vežu s # tlačová hlava. Tento parameter musí byť poskytnutý pre stepper_a; pre # stepper_b a stepper_c tento parameter má predvolenú hodnotu # zadané pre stepper_a. #uhol: # Táto možnosť určuje uhol (v stupňoch), pod ktorým je veža # o. Predvolená hodnota je 210 pre stepper_a, 330 pre stepper_b a 90 # pre stepper_c. # Časť stepper_b popisuje stepper ovládajúci prednú časť # pravá veža (pri 330 stupňoch). [stepper_b] # Časť stepper_c popisuje stepper ovládajúci zadnú časť # veža (pri 90 stupňoch). [stepper_c] # Sekcia delta_calibrate umožňuje rozšírenie DELTA_CALIBRATE # Príkaz g-kódu, ktorý dokáže kalibrovať polohy koncových dorazov veže a # uhly. [delta_calibrate] polomer: # Polomer (v mm) oblasti, ktorá môže byť snímaná. Toto je polomer # súradníc trysky, ktoré sa majú snímať; ak používate automatickú sondu # s posunom XY, potom zvoľte dostatočne malý polomer, aby #sonda sa vždy zmestí nad posteľ. Tento parameter je potrebné zadať. #rýchlosť: 50 # Rýchlosť (v mm/s) nesnímaných pohybov počas kalibrácie. # Predvolená hodnota je 50. #horizontal_move_z: 5 # Výška (v mm), do ktorej sa má hlava pohnúť # tesne pred spustením operácie sondy. Predvolená hodnota je 5.

source: BMP280/BME280/BME680 two wire interface (I2C) environmental sensors. Note that these sensors are not intended for use with extruders and heater beds, but rather for monitoring ambient temperature (C), pressure (hPa), relative humidity and in case of the BME680 gas level. See [sample-macros.cfg](../config/sample-macros.cfg) for a gcode_macro that may be used to report pressure and humidity in addition to temperature.
sk: BMP280/BME280/BME680 senzory prostredia s dvoma vodičmi rozhrania (I2C). Upozorňujeme, že tieto snímače nie sú určené na použitie s extrudérmi a ohrievačmi, ale skôr na monitorovanie okolitej teploty (C), tlaku (hPa), relatívnej vlhkosti a v prípade hladiny plynu BME680. Pozrite si [sample-macros.cfg](../config/sample-macros.cfg), kde nájdete gcode_macro, ktoré možno použiť na hlásenie tlaku a vlhkosti okrem teploty.

source: POLAR KINEMATICS ARE A WORK IN PROGRESS. Moves around the 0, 0 position are known to not work properly.
sk: POLÁRNA KINEMATIKA PREBIEHA. Je známe, že pohyby okolo polohy 0, 0 nefungujú správne.

source: CABLE WINCH SUPPORT IS EXPERIMENTAL. Homing is not implemented on cable winch kinematics. In order to home the printer, manually send movement commands until the toolhead is at 0, 0, 0 and then issue a `G28` command.
sk: PODPORA KÁBLOVÉHO NAVIJÁKA JE EXPERIMENTÁLNA. Navádzanie nie je implementované na kinematike lanového navijaka. Ak chcete tlačiareň vrátiť do pôvodného stavu, manuálne odošlite príkazy pohybu, kým nebude hlava nástroja na 0, 0, 0, a potom zadajte príkaz „G28“.

source: [printer] kinematics: winch # The stepper_a section describes the stepper connected to the first # cable winch. A minimum of 3 and a maximum of 26 cable winches may be # defined (stepper_a to stepper_z) though it is common to define 4. [stepper_a] rotation_distance: # The rotation_distance is the nominal distance (in mm) the toolhead # moves towards the cable winch for each full rotation of the # stepper motor. This parameter must be provided. anchor_x: anchor_y: anchor_z: # The X, Y, and Z position of the cable winch in cartesian space. # These parameters must be provided.
sk: [tlačiareň] kinematika: navijak # Časť stepper_a popisuje stepper pripojený k prvému # lanový navijak. Minimálne môžu byť 3 a maximálne 26 lanových navijakov # definované (stepper_a až stepper_z), hoci je bežné definovať 4. [stepper_a] rotačná_vzdialenosť: # Rotation_distance je nominálna vzdialenosť (v mm) od hlavy nástroja # sa posunie smerom k lanovému navijaku pri každom plnom otočení # krokový motor. Tento parameter je potrebné zadať. kotva_x: kotva_y: kotva_z: # Poloha X, Y a Z lanového navijaka v karteziánskom priestore. # Tieto parametre musia byť poskytnuté.

source: rectangular bed, probe_count = 3, 3: x---x---x (max_point) | x---x---x | (min_point) x---x---x round bed, round_probe_count = 5, bed_radius = r: x (0, r) end / x---x---x \ (-r, 0) x---x---x---x---x (r, 0) \ x---x---x / x (0, -r) start
sk: obdĺžnikové lôžko, počet sond = 3, 3: x---x---x (max_point) | x---x---x | (min_bod) x---x---x okrúhla posteľ, round_probe_count = 5, bed_radius = r: x (0, r) koniec / x---x---x \ (-r, 0) x---x---x---x---x (r, 0) \ x---x---x / x (0, -r) zač

source: [bed_tilt] #x_adjust: 0 # The amount to add to each move's Z height for each mm on the X # axis. The default is 0. #y_adjust: 0 # The amount to add to each move's Z height for each mm on the Y # axis. The default is 0. #z_adjust: 0 # The amount to add to the Z height when the nozzle is nominally at # 0, 0. The default is 0. # The remaining parameters control a BED_TILT_CALIBRATE extended # g-code command that may be used to calibrate appropriate x and y # adjustment parameters. #points: # A list of X, Y coordinates (one per line; subsequent lines # indented) that should be probed during a BED_TILT_CALIBRATE # command. Specify coordinates of the nozzle and be sure the probe # is above the bed at the given nozzle coordinates. The default is # to not enable the command. #speed: 50 # The speed (in mm/s) of non-probing moves during the calibration. # The default is 50. #horizontal_move_z: 5 # The height (in mm) that the head should be commanded to move to # just prior to starting a probe operation. The default is 5.
sk: [bed_tilt] #x_adjust: 0 # Množstvo, ktoré sa má pridať k výške Z každého pohybu pre každý mm na X # os. Predvolená hodnota je 0. #y_adjust: 0 # Množstvo, ktoré sa má pridať k výške Z každého pohybu pre každý mm na Y # os. Predvolená hodnota je 0. #z_adjust: 0 # Množstvo, ktoré sa má pridať k výške Z, keď je dýza v nominálnej polohe # 0, 0. Predvolená hodnota je 0. # Zostávajúce parametre ovládajú rozšírenú BED_TILT_CALIBRATE # príkaz g-code, ktorý možno použiť na kalibráciu vhodných x a y # parametre nastavenia. #body: # Zoznam súradníc X, Y (jedna na riadok; nasledujúce riadky # odsadené), ktoré by mali byť testované počas BED_TILT_CALIBRATE # príkaz. Zadajte súradnice dýzy a uistite sa, že ide o sondu # je nad lôžkom na daných súradniciach trysky. Predvolená hodnota je #, aby sa príkaz nepovolil. #rýchlosť: 50 # Rýchlosť (v mm/s) nesnímaných pohybov počas kalibrácie. # Predvolená hodnota je 50. #horizontal_move_z: 5 # Výška (v mm), do ktorej sa má hlava pohnúť # tesne pred spustením operácie sondy. Predvolená hodnota je 5.

source: [bed_screws] #screw1: # The X, Y coordinate of the first bed leveling screw. This is a # position to command the nozzle to that is directly above the bed # screw (or as close as possible while still being above the bed). # This parameter must be provided. #screw1_name: # An arbitrary name for the given screw. This name is displayed when # the helper script runs. The default is to use a name based upon # the screw XY location. #screw1_fine_adjust: # An X, Y coordinate to command the nozzle to so that one can fine # tune the bed leveling screw. The default is to not perform fine # adjustments on the bed screw. #screw2: #screw2_name: #screw2_fine_adjust: #... # Additional bed leveling screws. At least three screws must be # defined. #horizontal_move_z: 5 # The height (in mm) that the head should be commanded to move to # when moving from one screw location to the next. The default is 5. #probe_height: 0 # The height of the probe (in mm) after adjusting for the thermal # expansion of bed and nozzle. The default is zero. #speed: 50 # The speed (in mm/s) of non-probing moves during the calibration. # The default is 50. #probe_speed: 5 # The speed (in mm/s) when moving from a horizontal_move_z position # to a probe_height position. The default is 5.
sk: [posteľné_skrutky] #skrutka1: # Súradnice X, Y prvej vyrovnávacej skrutky lôžka. Toto je # poloha na ovládanie trysky, ktorá je priamo nad posteľou # skrutku (alebo čo najbližšie, kým je stále nad posteľou). # Tento parameter musí byť zadaný. #screw1_name: # Ľubovoľný názov pre danú skrutku. Tento názov sa zobrazí, keď # sa spustí pomocný skript. Predvolené je použiť názov založený na # miesto skrutky XY. #screw1_fine_adjust: # Súradnica X, Y na prikázanie dýze, aby bolo možné jemné # nalaďte vyrovnávaciu skrutku lôžka. Predvolená hodnota je nefungovať dobre # úpravy na skrutke lôžka. #skrutka2: #screw2_name: #screw2_fine_adjust: #... # Prídavné vyrovnávacie skrutky lôžka. Musia byť aspoň tri skrutky # definované. #horizontal_move_z: 5 # Výška (v mm), do ktorej sa má hlava pohnúť # pri prechode z jedného miesta skrutky na ďalšie. Predvolená hodnota je 5. #probe_height: 0 # Výška sondy (v mm) po úprave pre tepelnú teplotu # rozšírenie lôžka a trysky. Predvolená hodnota je nula. #rýchlosť: 50 # Rýchlosť (v mm/s) nesnímaných pohybov počas kalibrácie. # Predvolená hodnota je 50. #probe_speed: 5 # Rýchlosť (v mm/s) pri pohybe z polohy horizontal_move_z # do polohy probe_height. Predvolená hodnota je 5.

source: [quad_gantry_level] #gantry_corners: # A newline separated list of X, Y coordinates describing the two # opposing corners of the gantry. The first entry corresponds to Z, # the second to Z2. This parameter must be provided. #points: # A newline separated list of four X, Y points that should be probed # during a QUAD_GANTRY_LEVEL command. Order of the locations is # important, and should correspond to Z, Z1, Z2, and Z3 location in # order. This parameter must be provided. For maximum accuracy, # ensure your probe offsets are configured. #speed: 50 # The speed (in mm/s) of non-probing moves during the calibration. # The default is 50. #horizontal_move_z: 5 # The height (in mm) that the head should be commanded to move to # just prior to starting a probe operation. The default is 5. #max_adjust: 4 # Safety limit if an adjustment greater than this value is requested # quad_gantry_level will abort. #retries: 0 # Number of times to retry if the probed points aren't within # tolerance. #retry_tolerance: 0 # If retries are enabled then retry if largest and smallest probed # points differ more than retry_tolerance.
sk: [quad_gantry_level] #gantry_corners: # Novým riadkom oddelený zoznam súradníc X, Y, ktoré ich opisujú # protiľahlé rohy portálu. Prvý záznam zodpovedá Z, # druhý do Z2. Tento parameter je potrebné zadať. #body: # Novým riadkom oddelený zoznam štyroch bodov X, Y, ktoré by sa mali testovať # počas príkazu QUAD_GANTRY_LEVEL. Poradie miest je # dôležité a malo by zodpovedať umiestneniu Z, Z1, Z2 a Z3 # objednať. Tento parameter je potrebné zadať. Pre maximálnu presnosť, # uistite sa, že sú nakonfigurované odchýlky sondy. #rýchlosť: 50 # Rýchlosť (v mm/s) nesnímaných pohybov počas kalibrácie. # Predvolená hodnota je 50. #horizontal_move_z: 5 # Výška (v mm), do ktorej sa má hlava pohnúť # tesne pred spustením operácie sondy. Predvolená hodnota je 5. #max_adjust: 4 # Bezpečnostný limit, ak je požadovaná úprava väčšia ako táto hodnota # quad_gantry_level sa preruší. #opakovania: 0 # Počet opakovaní, ak sa snímané body nenachádzajú v rámci # tolerancia. #retry_tolerance: 0 # Ak sú povolené pokusy, skúste to znova, ak sa sníma najväčší a najmenší # bodov sa líši viac ako retry_tolerance.

source: Safe Z homing. One may use this mechanism to home the Z axis at a specific X, Y coordinate. This is useful if the toolhead, for example has to move to the center of the bed before Z can be homed.
sk: Bezpečné navádzanie Z. Tento mechanizmus možno použiť na umiestnenie osi Z na špecifickú súradnicu X, Y. To je užitočné, ak sa napríklad hlava nástroja musí presunúť do stredu lôžka predtým, ako sa Z môže vrátiť.

source: [adxl345] cs_pin: # The SPI enable pin for the sensor. This parameter must be provided. #spi_speed: 5000000 # The SPI speed (in hz) to use when communicating with the chip. # The default is 5000000. #spi_bus: #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # See the "common SPI settings" section for a description of the # above parameters. #axes_map: x, y, z # The accelerometer axis for each of the printer's X, Y, and Z axes. # This may be useful if the accelerometer is mounted in an # orientation that does not match the printer orientation. For # example, one could set this to "y, x, z" to swap the X and Y axes. # It is also possible to negate an axis if the accelerometer # direction is reversed (eg, "x, z, -y"). The default is "x, y, z". #rate: 3200 # Output data rate for ADXL345. ADXL345 supports the following data # rates: 3200, 1600, 800, 400, 200, 100, 50, and 25. Note that it is # not recommended to change this rate from the default 3200, and # rates below 800 will considerably affect the quality of resonance # measurements.
sk: [adxl345] cs_pin: # Pin aktivácie SPI pre senzor. Tento parameter je potrebné zadať. #spi_speed: 5000000 # Rýchlosť SPI (v Hz), ktorá sa má použiť pri komunikácii s čipom. # Predvolená hodnota je 5 000 000. #spi_bus: #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # Popis nájdete v časti „spoločné nastavenia SPI“. # vyššie uvedené parametre. #axes_map: x, y, z # Os akcelerometra pre každú z osí X, Y a Z tlačiarne. # To môže byť užitočné, ak je akcelerometer namontovaný v # orientácia, ktorá sa nezhoduje s orientáciou tlačiarne. Pre # príklad, dalo by sa to nastaviť na "y, x, z", aby sa vymenili osi X a Y. # Je tiež možné negovať os, ak je akcelerometer # smer je obrátený (napr. "x, z, -y"). Predvolená hodnota je „x, y, z“. #sadzba: 3200 # Výstupná dátová rýchlosť pre ADXL345. ADXL345 podporuje nasledujúce údaje # sadzby: 3200, 1600, 800, 400, 200, 100, 50 a 25. Upozorňujeme, že je # sa neodporúča meniť túto sadzbu z predvolenej hodnoty 3200 a # frekvencie pod 800 výrazne ovplyvnia kvalitu rezonancie # meraní.

source: See the [bed mesh guide](Bed_Mesh.md) and [command reference](G-Codes.md#bed_mesh) for additional information.
sk: Ďalšie informácie nájdete v [sprievodcovi sieťkou postele] (Bed_Mesh.md) a [odkaz na príkaz] (G-Codes.md#bed_mesh).

source: See the [command reference](G-Codes.md#bed_tilt) for additional information.
sk: Ďalšie informácie nájdete v [odkaz na príkaz](G-Codes.md#bed_tilt).

source: See the [leveling guide](Manual_Level.md#adjusting-bed-leveling-screws) and [command reference](G-Codes.md#bed_screws) for additional information.
sk: Ďalšie informácie nájdete v [príručke na vyrovnávanie](Manual_Level.md#adjusting-bed-leveling-screws) a [referencia príkazu](G-Codes.md#bed_screws).

source: See the [leveling guide](Manual_Level.md#adjusting-bed-leveling-screws-using-the-bed-probe) and [command reference](G-Codes.md#screws_tilt_adjust) for additional information.
sk: Ďalšie informácie nájdete v [príručke na vyrovnávanie](Manual_Level.md#adjusting-bed-leveling-screws-using-the-bed-probe) a [referencia príkazu](G-Codes.md#screws_tilt_adjust).

source: Multiple Z stepper tilt adjustment. This feature enables independent adjustment of multiple z steppers (see the "stepper_z1" section) to adjust for tilt. If this section is present then a Z_TILT_ADJUST extended [G-Code command](G-Codes.md#z_tilt) becomes available.
sk: Viacnásobné nastavenie náklonu kroka Z. Táto funkcia umožňuje nezávislé nastavenie viacerých stepperov z (pozri časť „stepper_z1“) na nastavenie sklonu. Ak je táto sekcia prítomná, potom bude k dispozícii rozšírený [príkaz G-kódu] (G-Codes.md#z_tilt) Z_TILT_ADJUST.

source: Printer Skew Correction. It is possible to use software to correct printer skew across 3 planes, xy, xz, yz. This is done by printing a calibration model along a plane and measuring three lengths. Due to the nature of skew correction these lengths are set via gcode. See [Skew Correction](Skew_Correction.md) and [Command Reference](G-Codes.md#skew_correction) for details.
sk: Korekcia zošikmenia tlačiarne. Je možné použiť softvér na opravu zošikmenia tlačiarne cez 3 roviny, xy, xz, yz. Robí sa to vytlačením kalibračného modelu pozdĺž roviny a meraním troch dĺžok. Vzhľadom na povahu korekcie zošikmenia sa tieto dĺžky nastavujú pomocou gcode. Podrobnosti nájdete v [Korekcia zošikmenia](Skew_Correction.md) a [Referencia príkazov](G-Codes.md#skew_correction).

source: See the [endstop phases guide](Endstop_Phase.md) and [command reference](G-Codes.md#endstop_phase) for additional information.
sk: Ďalšie informácie nájdete v [príručke koncových fáz](Endstop_Phase.md) a [odkaz na príkaz](G-Codes.md#endstop_phase).

source: Execute a gcode on a set delay. See the [command template guide](Command_Templates.md#delayed-gcodes) and [command reference](G-Codes.md#delayed_gcode) for more information.
sk: Vykonajte gcode s nastaveným oneskorením. Ďalšie informácie nájdete v [sprievodcovi šablónami príkazov](Command_Templates.md#delayed-gcodes) a [referencia príkazov](G-Codes.md#delayed_gcode).

source: See the [command reference](G-Codes.md#sdcard_loop) for supported commands. See the [sample-macros.cfg](../config/sample-macros.cfg) file for a Marlin compatible M808 G-Code macro.
sk: Podporované príkazy nájdete v [odkaz na príkaz](G-Codes.md#sdcard_loop). Makro M808 G-Code kompatibilné s Marlin nájdete v súbore [sample-macros.cfg](../config/sample-macros.cfg).

source: Pause/Resume functionality with support of position capture and restore. See the [command reference](G-Codes.md#pause_resume) for more information.
sk: Funkcia pozastavenia/obnovenia s podporou zachytenia a obnovenia polohy. Ďalšie informácie nájdete v [odkaz na príkaz](G-Codes.md#pause_resume).

source: Firmware filament retraction. This enables G10 (retract) and G11 (unretract) GCODE commands issued by many slicers. The parameters below provide startup defaults, although the values can be adjusted via the SET_RETRACTION [command](G-Codes.md#firmware_retraction)), allowing per-filament settings and runtime tuning.
sk: Zatiahnutie filamentu firmvéru. To umožňuje príkazy GCODE G10 (zatiahnutie) a G11 (odtiahnutie) vydávané mnohými rezačmi. Parametre uvedené nižšie poskytujú predvolené hodnoty spustenia, aj keď hodnoty možno upraviť pomocou príkazu SET_RETRACTION [príkaz](G-Codes.md#firmware_retraction)), čo umožňuje nastavenie jednotlivých vlákien a ladenie za chodu.

source: Enable the "M118" and "RESPOND" extended [commands](G-Codes.md#respond).
sk: Povoľte „M118“ a „RESPOND“ rozšírené [príkazy] (G-Codes.md#respond).

source: Enables [resonance compensation](Resonance_Compensation.md). Also see the [command reference](G-Codes.md#input_shaper).
sk: Povolí [kompenzáciu rezonancie](Resonance_Compensation.md). Pozri tiež [odkaz na príkaz](G-Codes.md#input_shaper).
