Repository: fran6p/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Config_Reference.po
Languages: sk

source: Micro-controller configuration
sk: Konfigurácia mikrokontroléra

source: Many config options require the name of a micro-controller pin. Klipper uses the hardware names for these pins - for example `PA4`.
sk: Mnoho možností konfigurácie vyžaduje názov kolíka mikroovládača. Klipper používa názvy hardvéru pre tieto piny - napríklad `PA4`.

source: Pin names may be preceded by `!` to indicate that a reverse polarity should be used (eg, trigger on low instead of high).
sk: Názvy pinov môžu byť označené znakom `!`, čo znamená, že by sa mala použiť opačná polarita (napr. spustenie pri nízkej namiesto vysokej).

source: Input pins may be preceded by `^` to indicate that a hardware pull-up resistor should be enabled for the pin. If the micro-controller supports pull-down resistors then an input pin may alternatively be preceded by `~`.
sk: Vstupným kolíkom môže predchádzať znak „^“, ktorý označuje, že pre kolík by mal byť povolený hardvérový pull-up rezistor. Ak mikroovládač podporuje sťahovacie odpory, potom pred vstupným kolíkom môže alternatívne predchádzať „~“.

source: Note, some config sections may "create" additional pins. Where this occurs, the config section defining the pins must be listed in the config file before any sections using those pins.
sk: Všimnite si, že niektoré konfiguračné sekcie môžu „vytvoriť“ ďalšie piny. Ak k tomu dôjde, konfiguračná sekcia definujúca piny musí byť uvedená v konfiguračnom súbore pred akýmikoľvek sekciami, ktoré tieto piny používajú.

source: Configuration of the primary micro-controller.
sk: Konfigurácia primárneho mikrokontroléra.

source: Additional micro-controllers (one may define any number of sections with an "mcu" prefix). Additional micro-controllers introduce additional pins that may be configured as heaters, steppers, fans, etc.. For example, if an "[mcu extra_mcu]" section is introduced, then pins such as "extra_mcu:ar9" may then be used elsewhere in the config (where "ar9" is a hardware pin name or alias name on the given mcu).
sk: Dodatočné mikrokontroléry (je možné definovať ľubovoľný počet sekcií s predponou "mcu"). Dodatočné mikroovládače zavádzajú ďalšie kolíky, ktoré môžu byť nakonfigurované ako ohrievače, steppery, ventilátory atď. Napríklad, ak sa zavedie sekcia "[mcu extra_mcu]", potom kolíky ako "extra_mcu:ar9" možno použiť inde v konfigurácii (kde "ar9" je názov hardvérového pinu alebo alias na danom mcu).

source: Common kinematic settings
sk: Bežné kinematické nastavenia

source: Cartesian Kinematics
sk: Kartézska kinematika

source: See [example-cartesian.cfg](../config/example-cartesian.cfg) for an example cartesian kinematics config file.
sk: Príklad konfiguračného súboru karteziánskej kinematiky nájdete v [example-cartesian.cfg](../config/example-cartesian.cfg).

source: Only parameters specific to cartesian printers are described here - see [common kinematic settings](#common-kinematic-settings) for available parameters.
sk: Tu sú popísané iba parametre špecifické pre kartezánske tlačiarne – dostupné parametre nájdete v časti [bežné kinematické nastavenia](#common-kinematic-settings).

source: Linear Delta Kinematics
sk: Lineárna delta kinematika

source: See [example-delta.cfg](../config/example-delta.cfg) for an example linear delta kinematics config file. See the [delta calibrate guide](Delta_Calibrate.md) for information on calibration.
sk: Príklad konfiguračného súboru lineárnej delta kinematiky nájdete v [example-delta.cfg](../config/example-delta.cfg). Informácie o kalibrácii nájdete v [príručke delta kalibrácie] (Delta_Calibrate.md).

source: Only parameters specific to linear delta printers are described here - see [common kinematic settings](#common-kinematic-settings) for available parameters.
sk: Tu sú popísané iba parametre špecifické pre lineárne delta tlačiarne – dostupné parametre nájdete v časti [bežné kinematické nastavenia](#common-kinematic-settings).

source: CoreXY Kinematics
sk: Kinematika CoreXY

source: See [example-corexy.cfg](../config/example-corexy.cfg) for an example corexy (and h-bot) kinematics file.
sk: Pozrite si [example-corexy.cfg](../config/example-corexy.cfg), kde nájdete príklad súboru kinematiky corexy (a h-bot).

source: Only parameters specific to corexy printers are described here - see [common kinematic settings](#common-kinematic-settings) for available parameters.
sk: Tu sú popísané iba parametre špecifické pre tlačiarne Corexy – dostupné parametre nájdete v časti [bežné kinematické nastavenia](#common-kinematic-settings).

source: CoreXZ Kinematics
sk: Kinematika CoreXZ

source: See [example-corexz.cfg](../config/example-corexz.cfg) for an example corexz kinematics config file.
sk: Príklad konfiguračného súboru kinematiky corexz nájdete v [example-corexz.cfg](../config/example-corexz.cfg).

source: Only parameters specific to corexz printers are described here - see [common kinematic settings](#common-kinematic-settings) for available parameters.
sk: Tu sú popísané iba parametre špecifické pre tlačiarne Corexz – dostupné parametre nájdete v časti [bežné kinematické nastavenia](#common-kinematic-settings).

source: Hybrid-CoreXY Kinematics
sk: Hybrid-CoreXY kinematika

source: See [example-hybrid-corexy.cfg](../config/example-hybrid-corexy.cfg) for an example hybrid corexy kinematics config file.
sk: Príklad konfiguračného súboru hybridnej kinematiky Corexy nájdete v [example-hybrid-corexy.cfg](../config/example-hybrid-corexy.cfg).

source: Only parameters specific to hybrid corexy printers are described here see [common kinematic settings](#common-kinematic-settings) for available parameters.
sk: Tu sú popísané iba parametre špecifické pre hybridné tlačiarne Corexy, kde nájdete dostupné parametre v časti [bežné kinematické nastavenia](#common-kinematic-settings).

source: Hybrid-CoreXZ Kinematics
sk: Hybrid-CoreXZ kinematika

source: See [example-hybrid-corexz.cfg](../config/example-hybrid-corexz.cfg) for an example hybrid corexz kinematics config file.
sk: Príklad konfiguračného súboru hybridnej kinematiky corexz nájdete v [example-hybrid-corexz.cfg](../config/example-hybrid-corexz.cfg).

source: Polar Kinematics
sk: Polárna kinematika

source: See [example-polar.cfg](../config/example-polar.cfg) for an example polar kinematics config file.
sk: Príklad konfiguračného súboru polárnej kinematiky nájdete v [example-polar.cfg](../config/example-polar.cfg).

source: Only parameters specific to polar printers are described here - see [common kinematic settings](#common-kinematic-settings) for available parameters.
sk: Tu sú popísané iba parametre špecifické pre polárne tlačiarne – dostupné parametre nájdete v časti [bežné kinematické nastavenia](#common-kinematic-settings).

source: Rotary delta Kinematics
sk: Rotačná delta kinematika

source: See [example-rotary-delta.cfg](../config/example-rotary-delta.cfg) for an example rotary delta kinematics config file.
sk: Príklad konfiguračného súboru rotačnej delta kinematiky nájdete v [example-rotary-delta.cfg](../config/example-rotary-delta.cfg).

source: Only parameters specific to rotary delta printers are described here - see [common kinematic settings](#common-kinematic-settings) for available parameters.
sk: Tu sú popísané iba parametre špecifické pre rotačné delta tlačiarne – dostupné parametre nájdete v [bežné kinematické nastavenia](#common-kinematic-settings).

source: ROTARY DELTA KINEMATICS ARE A WORK IN PROGRESS. Homing moves may timeout and some boundary checks are not implemented.
sk: OTOČNÁ DELTA KINEMATIKA SÚ PRÁCA. Pohyby navádzania môžu uplynúť časový limit a niektoré kontroly hraníc nie sú implementované.

source: Cable winch Kinematics
sk: Navíjanie kábla Kinematika

source: See the [example-winch.cfg](../config/example-winch.cfg) for an example cable winch kinematics config file.
sk: Príklad konfiguračného súboru kinematiky káblového navijaka nájdete v [example-winch.cfg](../config/example-winch.cfg).

source: Only parameters specific to cable winch printers are described here - see [common kinematic settings](#common-kinematic-settings) for available parameters.
sk: Tu sú popísané iba parametre špecifické pre tlačiarne káblových navijakov – dostupné parametre nájdete v časti [bežné kinematické nastavenia](#common-kinematic-settings).

source: None Kinematics
sk: Žiadna kinematika

source: It is possible to define a special "none" kinematics to disable kinematic support in Klipper. This may be useful for controlling devices that are not typical 3d-printers or for debugging purposes.
sk: Je možné definovať špeciálnu "žiadnu" kinematiku na vypnutie kinematickej podpory v Klipper. To môže byť užitočné pri ovládaní zariadení, ktoré nie sú typickými 3D tlačiarňami, alebo na účely ladenia.

source: Common extruder and heated bed support
sk: Spoločný extrudér a podpora vyhrievaného lôžka

source: Bed level support
sk: Podpora úrovne lôžka

source: Mesh Bed Leveling. One may define a bed_mesh config section to enable move transformations that offset the z axis based on a mesh generated from probed points. When using a probe to home the z-axis, it is recommended to define a safe_z_home section in printer.cfg to home toward the center of the print area.
sk: Vyrovnávanie sieťového lôžka. Je možné definovať konfiguračnú sekciu bed_mesh na umožnenie transformácií pohybu, ktoré odsadzujú os z na základe siete vygenerovanej zo snímaných bodov. Pri použití sondy na umiestnenie osi z sa odporúča definovať sekciu safe_z_home v súbore printer.cfg smerom k stredu oblasti tlače.Vyrovnávanie sieťového lôžka. Je možné definovať konfiguračnú sekciu bed_mesh na umožnenie transformácií pohybu, ktoré odsadzujú os z na základe siete vygenerovanej zo snímaných bodov. Pri použití sondy na umiestnenie osi z sa odporúča definovať sekciu safe_z_home v súbore printer.cfg smerom k stredu oblasti tlače.

source: Bed tilt compensation. One may define a bed_tilt config section to enable move transformations that account for a tilted bed. Note that bed_mesh and bed_tilt are incompatible; both cannot be defined.
sk: Kompenzácia sklonu lôžka. Je možné definovať konfiguračnú sekciu bed_tilt, ktorá umožní transformácie pohybu, ktoré zodpovedajú naklonenej posteli. Všimnite si, že bed_mesh a bed_tilt sú nekompatibilné; oboje nemožno definovať.

source: Moving gantry leveling using 4 independently controlled Z motors. Corrects hyperbolic parabola effects (potato chip) on moving gantry which is more flexible. WARNING: Using this on a moving bed may lead to undesirable results. If this section is present then a QUAD_GANTRY_LEVEL extended G-Code command becomes available. This routine assumes the following Z motor configuration:
sk: Nivelácia pohyblivého portálu pomocou 4 nezávisle riadených Z motorov. Opravuje efekty hyperbolickej paraboly (zemiakový čip) na pohyblivom portáli, ktorý je flexibilnejší. VAROVANIE: Použitie tohto na pohyblivom lôžku môže viesť k nežiaducim výsledkom. Ak je táto sekcia prítomná, sprístupní sa rozšírený príkaz G-kódu QUAD_GANTRY_LEVEL. Táto rutina predpokladá nasledujúcu konfiguráciu motora Z:

source: Customized homing
sk: Prispôsobené navádzanie

source: Homing override. One may use this mechanism to run a series of g-code commands in place of a G28 found in the normal g-code input. This may be useful on printers that require a specific procedure to home the machine.
sk: Prepísanie navádzania. Tento mechanizmus možno použiť na spustenie série príkazov g-kódu namiesto G28, ktorý sa nachádza v normálnom vstupe g-kódu. To môže byť užitočné na tlačiarňach, ktoré vyžadujú špecifický postup na umiestnenie zariadenia.

source: G-Code macros and events
sk: Makrá a udalosti G-Code

source: G-Code macros (one may define any number of sections with a "gcode_macro" prefix). See the [command template guide](Command_Templates.md) for more information.
sk: Makrá G-Code (je možné definovať ľubovoľný počet sekcií s predponou „gcode_macro“). Ďalšie informácie nájdete v [príručke šablón príkazov](Command_Templates.md).

source: Idle timeout. An idle timeout is automatically enabled - add an explicit idle_timeout config section to change the default settings.
sk: Časový limit nečinnosti. Automaticky je povolený časový limit nečinnosti – pridajte explicitnú konfiguračnú sekciu idle_timeout, aby ste zmenili predvolené nastavenia.

source: Optional G-Code features
sk: Voliteľné funkcie G-Code

source: A virtual sdcard may be useful if the host machine is not fast enough to run OctoPrint well. It allows the Klipper host software to directly print gcode files stored in a directory on the host using standard sdcard G-Code commands (eg, M24).
sk: Virtuálna karta sdcard môže byť užitočná, ak hostiteľský počítač nie je dostatočne rýchly na to, aby dobre spustil OctoPrint. Umožňuje hostiteľskému softvéru Klipper priamo tlačiť súbory gcode uložené v adresári na hostiteľovi pomocou štandardných príkazov sdcard G-Code (napr. M24).

source: Some printers with stage-clearing features, such as a part ejector or a belt printer, can find use in looping sections of the sdcard file. (For example, to print the same part over and over, or repeat the a section of a part for a chain or other repeated pattern).
sk: Niektoré tlačiarne s funkciami čistenia pódia, ako je vyhadzovač súčiastok alebo pásová tlačiareň, môžu nájsť využitie v slučkách sekcií súboru sdcard. (Napríklad na vytlačenie tej istej časti znova a znova alebo na opakovanie časti časti pre reťaz alebo iný opakujúci sa vzor).

source: Resonance compensation
sk: Rezonančná kompenzácia

source: Config file helpers
sk: Pomocníci konfiguračného súboru

source: Board pin aliases (one may define any number of sections with a "board_pins" prefix). Use this to define aliases for the pins on a micro-controller.
sk: Aliasy pinov na tabuli (možno definovať ľubovoľný počet sekcií s predponou "board_pins"). Použite toto na definovanie aliasov pre kolíky na mikroovládači.

source: Include file support. One may include additional config file from the main printer config file. Wildcards may also be used (eg, "configs/*.cfg").
sk: Zahrňte podporu súborov. Jeden môže obsahovať ďalší konfiguračný súbor z hlavného konfiguračného súboru tlačiarne. Môžu sa použiť aj zástupné znaky (napr. "configs/*.cfg").

source: Bed probing hardware
sk: Hardvér na sondovanie postele

source: BLTouch probe. One may define this section (instead of a probe section) to enable a BLTouch probe. See [BL-Touch guide](BLTouch.md) and [command reference](G-Codes.md#bltouch) for further information. A virtual "probe:z_virtual_endstop" pin is also created (see the "probe" section for the details).
sk: BLDotyková sonda. Je možné definovať túto sekciu (namiesto sekcie sondy), aby sa umožnila sonda BLTouch. Ďalšie informácie nájdete v [BL-Touch sprievodca](BLTouch.md) a [príkazový odkaz](G-Codes.md#bltouch). Vytvorí sa aj virtuálny kolík „probe:z_virtual_endstop“ (podrobnosti nájdete v časti „sonda“).

source: Additional stepper motors and extruders
sk: Prídavné krokové motory a extrudéry

source: Multi-stepper axes. On a cartesian style printer, the stepper controlling a given axis may have additional config blocks defining steppers that should be stepped in concert with the primary stepper. One may define any number of sections with a numeric suffix starting at 1 (for example, "stepper_z1", "stepper_z2", etc.).
sk: Viackrokové osi. Na tlačiarni karteziánskeho štýlu môže mať krokový ovládač ovládajúci danú os ďalšie konfiguračné bloky definujúce krokové kroky, ktoré by mali byť krokované v súlade s primárnym krokovým krokom. Je možné definovať ľubovoľný počet sekcií s číselnou príponou začínajúcou od 1 (napríklad „stepper_z1“, „stepper_z2“ atď.).

source: In a multi-extruder printer add an additional extruder section for each additional extruder. The additional extruder sections should be named "extruder1", "extruder2", "extruder3", and so on. See the "extruder" section for a description of available parameters.
sk: V tlačiarni s viacerými extrudérmi pridajte ďalšiu sekciu extrudéra pre každý ďalší extrudér. Ďalšie sekcie extrudéra by mali byť pomenované "extruder1", "extruder2", "extruder3" atď. Popis dostupných parametrov nájdete v časti "extrudér".

source: See [sample-multi-extruder.cfg](../config/sample-multi-extruder.cfg) for an example configuration.
sk: Príklad konfigurácie nájdete v [sample-multi-extruder.cfg](../config/sample-multi-extruder.cfg).

source: See [sample-idex.cfg](../config/sample-idex.cfg) for an example configuration.
sk: Príklad konfigurácie nájdete v [sample-idex.cfg](../config/sample-idex.cfg).

source: Custom heaters and sensors
sk: Vlastné ohrievače a senzory

source: Heater and temperature sensor verification. Heater verification is automatically enabled for each heater that is configured on the printer. Use verify_heater sections to change the default settings.
sk: Overenie ohrievača a snímača teploty. Overenie ohrievača je automaticky povolené pre každý ohrievač, ktorý je nakonfigurovaný na tlačiarni. Ak chcete zmeniť predvolené nastavenia, použite sekcie verifikačný ohrev.

source: Custom thermistors (one may define any number of sections with a "thermistor" prefix). A custom thermistor may be used in the sensor_type field of a heater config section. (For example, if one defines a "[thermistor my_thermistor]" section then one may use a "sensor_type: my_thermistor" when defining a heater.) Be sure to place the thermistor section in the config file above its first use in a heater section.
sk: Vlastné termistory (možno definovať ľubovoľný počet sekcií s predponou "termistor"). Vlastný termistor možno použiť v poli sensor_type sekcie konfigurácie ohrievača. (Napríklad, ak definujete sekciu "[termistor my_thermistor]", potom môžete pri definovaní ohrievača použiť sekciu "sensor_type: my_thermistor".) Nezabudnite umiestniť sekciu termistora do konfiguračného súboru nad jej prvým použitím v sekcii ohrievača .

source: Custom ADC temperature sensors (one may define any number of sections with an "adc_temperature" prefix). This allows one to define a custom temperature sensor that measures a voltage on an Analog to Digital Converter (ADC) pin and uses linear interpolation between a set of configured temperature/voltage (or temperature/resistance) measurements to determine the temperature. The resulting sensor can be used as a sensor_type in a heater section. (For example, if one defines a "[adc_temperature my_sensor]" section then one may use a "sensor_type: my_sensor" when defining a heater.) Be sure to place the sensor section in the config file above its first use in a heater section.
sk: Vlastné snímače teploty ADC (je možné definovať ľubovoľný počet sekcií s predponou "adc_temperature"). To umožňuje definovať vlastný teplotný senzor, ktorý meria napätie na kolíku analógovo-digitálneho prevodníka (ADC) a používa lineárnu interpoláciu medzi súborom nakonfigurovaných meraní teploty/napätia (alebo teploty/odporu) na určenie teploty. Výsledný snímač možno použiť ako typ snímača v sekcii ohrievača. (Ak napríklad definujete sekciu "[adc_temperature my_sensor]", potom môžete pri definovaní ohrievača použiť "sensor_type: my_sensor".) Nezabudnite umiestniť sekciu senzora do konfiguračného súboru nad jej prvé použitie v sekcii ohrievača .

source: Generic temperature sensors. One can define any number of additional temperature sensors that are reported via the M105 command.
sk: Generické snímače teploty. Je možné definovať ľubovoľný počet prídavných snímačov teploty, ktoré sú hlásené príkazom M105.

source: Common thermistors
sk: Bežné termistory

source: Common thermistors. The following parameters are available in heater sections that use one of these sensors.
sk: Bežné termistory. Nasledujúce parametre sú dostupné v sekciách ohrievača, ktoré používajú jeden z týchto snímačov.

source: Common temperature amplifiers
sk: Bežné teplotné zosilňovače

source: Common temperature amplifiers. The following parameters are available in heater sections that use one of these sensors.
sk: Bežné teplotné zosilňovače. Nasledujúce parametre sú dostupné v sekciách ohrievača, ktoré používajú jeden z týchto snímačov.

source: Directly connected PT1000 sensor
sk: Priamo pripojený snímač PT1000

source: Directly connected PT1000 sensor. The following parameters are available in heater sections that use one of these sensors.
sk: Priamo pripojený snímač PT1000. Nasledujúce parametre sú dostupné v sekciách ohrievača, ktoré používajú jeden z týchto snímačov.

source: MAXxxxxx temperature sensors
sk: MAXxxxxx teplotné senzory

source: MAXxxxxx serial peripheral interface (SPI) temperature based sensors. The following parameters are available in heater sections that use one of these sensor types.
sk: Senzory teploty založené na sériovom periférnom rozhraní (SPI) MAXxxxxx. Nasledujúce parametre sú dostupné v sekciách ohrievača, ktoré používajú jeden z týchto typov snímačov.

source: BMP280/BME280/BME680 temperature sensor
sk: BMP280/BME280/BME680 teplotný sensor

source: HTU21D family two wire interface (I2C) environmental sensor. Note that this sensor is not intended for use with extruders and heater beds, but rather for monitoring ambient temperature (C) and relative humidity. See [sample-macros.cfg](../config/sample-macros.cfg) for a gcode_macro that may be used to report humidity in addition to temperature.
sk: Senzor prostredia s dvojvodičovým rozhraním (I2C) rodiny HTU21D. Upozorňujeme, že tento snímač nie je určený na použitie s extrudérmi a ohrievačmi, ale skôr na monitorovanie okolitej teploty (C) a relatívnej vlhkosti. Pozrite si [sample-macros.cfg](../config/sample-macros.cfg), kde nájdete gcode_macro, ktoré možno použiť na hlásenie vlhkosti okrem teploty.

source: LM75 temperature sensor
sk: snímač teploty LM75

source: Builtin micro-controller temperature sensor
sk: Zabudovaný snímač teploty mikrokontroléra

source: Host temperature sensor
sk: Snímač teploty hostiteľa

source: DS18B20 temperature sensor
sk: snímač teploty DS18B20

source: DS18B20 is a 1-wire (w1) digital temperature sensor. Note that this sensor is not intended for use with extruders and heater beds, but rather for monitoring ambient temperature (C). These sensors have range up to 125 C, so are usable for e.g. chamber temperature monitoring. They can also function as simple fan/heater controllers. DS18B20 sensors are only supported on the "host mcu", e.g. the Raspberry Pi. The w1-gpio Linux kernel module must be installed.
sk: DS18B20 je 1-vodičový (w1) digitálny snímač teploty. Upozorňujeme, že tento snímač nie je určený na použitie s extrudérmi a ohrievačmi, ale skôr na monitorovanie okolitej teploty (C). Tieto snímače majú rozsah až 125 C, takže sú použiteľné napr. monitorovanie teploty v komore. Môžu tiež fungovať ako jednoduché ovládače ventilátora/vykurovania. Senzory DS18B20 sú podporované len na "host mcu", napr. Raspberry Pi. Musí byť nainštalovaný modul jadra w1-gpio Linux.

source: Fans
sk: Ventilátor

source: Print cooling fan.
sk: Chladiaci ventilátor tlače.

source: Heater cooling fans (one may define any number of sections with a "heater_fan" prefix). A "heater fan" is a fan that will be enabled whenever its associated heater is active. By default, a heater_fan has a shutdown_speed equal to max_power.
sk: Chladiace ventilátory ohrievača (je možné definovať ľubovoľný počet sekcií s predponou "heater_fan"). "Ventilátor ohrievača" je ventilátor, ktorý sa aktivuje vždy, keď je aktívny príslušný ohrievač. V predvolenom nastavení má ohrievačheat_fan rýchlosť vypnutia rovnajúcu sa max_power.

source: PCA9533 LED support. The PCA9533 is used on the mightyboard.
sk: Podpora LED PCA9533. PCA9533 sa používa na doske strongyboard.
