Repository: fran6p/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Config_Reference.po
Languages: sk

source: [mcp4018 my_digipot] scl_pin: # The SCL "clock" pin. This parameter must be provided. sda_pin: # The SDA "data" pin. This parameter must be provided. wiper: # The value to statically set the given MCP4018 "wiper" to. This is # typically set to a number between 0.0 and 1.0 with 1.0 being the # highest resistance and 0.0 being the lowest resistance. However, # the range may be changed with the 'scale' parameter (see below). # This parameter must be provided. #scale: # This parameter can be used to alter how the 'wiper' parameter is # interpreted. If provided, then the 'wiper' parameter should be # between 0.0 and 'scale'. This may be useful when the MCP4018 is # used to set stepper voltage references. The 'scale' can be set to # the equivalent stepper amperage if the MCP4018 is at its highest # resistance, and then the 'wiper' parameter can be specified using # the desired amperage value for the stepper. The default is to not # scale the 'wiper' parameter.
sk: [mcp4018 my_digipot] scl_pin: # Pin "hodiny" SCL. Tento parameter je potrebné zadať. sda_pin: # Dátový kolík SDA. Tento parameter je potrebné zadať. stierač: # Hodnota, na ktorú sa má staticky nastaviť daný „stierač“ MCP4018. Toto je # sa zvyčajne nastavuje na číslo medzi 0,0 a 1,0, pričom 1,0 je # najvyšší odpor a 0,0 je najnižší odpor. však # rozsah je možné zmeniť pomocou parametra 'scale' (pozri nižšie). # Tento parameter musí byť zadaný. #mierka: # Tento parameter možno použiť na zmenu parametra „stierača“. # vykladané. Ak je k dispozícii, potom by mal byť parameter „stierač“. # medzi 0,0 a 'scale'. To môže byť užitočné, keď je MCP4018 # slúži na nastavenie krokových referencií napätia. „Mierka“ sa dá nastaviť na # ekvivalentná kroková intenzita prúdu, ak je MCP4018 na najvyššej úrovni # odpor a potom je možné zadať parameter 'stierač' pomocou # požadovaná hodnota prúdu pre stepper. Predvolená hodnota je nie # škálovať parameter 'stierač'.

source: [display] lcd_type: hd44780 # Set to "hd44780" for hd44780 displays. rs_pin: e_pin: d4_pin: d5_pin: d6_pin: d7_pin: # The pins connected to an hd44780 type lcd. These parameters must # be provided. #hd44780_protocol_init: True # Perform 8-bit/4-bit protocol initialization on an hd44780 display. # This is necessary on real hd44780 devices. However, one may need # to disable this on some "clone" devices. The default is True. #line_length: # Set the number of characters per line for an hd44780 type lcd. # Possible values are 20 (default) and 16. The number of lines is # fixed to 4. ...
sk: [zobraziť] lcd_type: hd44780 # Nastavte na "hd44780" pre displeje hd44780. rs_pin: e_pin: d4_pin: d5_pin: d6_pin: d7_pin: # Kolíky pripojené k lcd typu hd44780. Tieto parametre musia # byť poskytovaný. #hd44780_protocol_init: Pravda # Vykonajte inicializáciu 8-bitového/4-bitového protokolu na displeji hd44780. # Toto je potrebné na skutočných zariadeniach hd44780. Jeden však môže potrebovať #, aby ste to zakázali na niektorých „klonovacích“ zariadeniach. Predvolená hodnota je True. #line_length: # Nastavte počet znakov na riadok pre lcd typu hd44780. # Možné hodnoty sú 20 (predvolené) a 16. Počet riadkov je # opravené na 4. ...

source: [display] lcd_type: hd44780_spi # Set to "hd44780_spi" for hd44780_spi displays. latch_pin: spi_software_sclk_pin: spi_software_mosi_pin: spi_software_miso_pin: # The pins connected to the shift register controlling the display. # The spi_software_miso_pin needs to be set to an unused pin of the # printer mainboard as the shift register does not have a MISO pin, # but the software spi implementation requires this pin to be # configured. #hd44780_protocol_init: True # Perform 8-bit/4-bit protocol initialization on an hd44780 display. # This is necessary on real hd44780 devices. However, one may need # to disable this on some "clone" devices. The default is True. #line_length: # Set the number of characters per line for an hd44780 type lcd. # Possible values are 20 (default) and 16. The number of lines is # fixed to 4. ...
sk: [zobraziť] lcd_type: hd44780_spi # Nastavte na „hd44780_spi“ pre displeje hd44780_spi. latch_pin: spi_software_sclk_pin: spi_software_mosi_pin: spi_software_miso_pin: # Kolíky pripojené k posuvnému registru ovládajúcemu displej. # Spi_software_miso_pin musí byť nastavený na nepoužitý pin # základná doska tlačiarne, pretože posuvný register nemá kolík MISO, # ale implementácia spi softvéru vyžaduje, aby tento pin bol # nakonfigurované. #hd44780_protocol_init: Pravda # Vykonajte inicializáciu 8-bitového/4-bitového protokolu na displeji hd44780. # Toto je potrebné na skutočných zariadeniach hd44780. Jeden však môže potrebovať #, aby ste to zakázali na niektorých „klonovacích“ zariadeniach. Predvolená hodnota je True. #line_length: # Nastavte počet znakov na riadok pre lcd typu hd44780. # Možné hodnoty sú 20 (predvolené) a 16. Počet riadkov je # opravené na 4. ...

source: [display] lcd_type: st7920 # Set to "st7920" for st7920 displays. cs_pin: sclk_pin: sid_pin: # The pins connected to an st7920 type lcd. These parameters must be # provided. ...
sk: [zobraziť] lcd_type: st7920 # Pre displeje st7920 nastavte na "st7920". cs_pin: sclk_pin: sid_pin: # Kolíky pripojené k lcd typu st7920. Tieto parametre musia byť # poskytnuté. ...

source: [display] lcd_type: emulated_st7920 # Set to "emulated_st7920" for emulated_st7920 displays. en_pin: spi_software_sclk_pin: spi_software_mosi_pin: spi_software_miso_pin: # The pins connected to an emulated_st7920 type lcd. The en_pin # corresponds to the cs_pin of the st7920 type lcd, # spi_software_sclk_pin corresponds to sclk_pin and # spi_software_mosi_pin corresponds to sid_pin. The # spi_software_miso_pin needs to be set to an unused pin of the # printer mainboard as the st7920 as no MISO pin but the software # spi implementation requires this pin to be configured. ...
sk: [zobraziť] lcd_type: emulated_st7920 # Nastavte na "emulated_st7920" pre obrazovky emulated_st7920. en_pin: spi_software_sclk_pin: spi_software_mosi_pin: spi_software_miso_pin: # Kolíky pripojené k lcd typu emulated_st7920. En_pin # zodpovedá cs_pin lcd typu st7920, # spi_software_sclk_pin zodpovedá sclk_pin a # spi_software_mosi_pin zodpovedá sid_pin. The # spi_software_miso_pin musí byť nastavený na nepoužívaný pin # základná doska tlačiarne ako st7920 bez pinu MISO, ale so softvérom # spi implementácia vyžaduje, aby bol tento pin nakonfigurovaný. ...

source: [display] lcd_type: uc1701 # Set to "uc1701" for uc1701 displays. cs_pin: a0_pin: # The pins connected to a uc1701 type lcd. These parameters must be # provided. #rst_pin: # The pin connected to the "rst" pin on the lcd. If it is not # specified then the hardware must have a pull-up on the # corresponding lcd line. #contrast: # The contrast to set. The value may range from 0 to 63 and the # default is 40. ...
sk: [zobraziť] lcd_type: uc1701 # Nastavte na "uc1701" pre uc1701 displeje. cs_pin: a0_pin: # Kolíky pripojené k LCD typu uc1701. Tieto parametre musia byť # poskytnuté. #rst_pin: # Kolík pripojený k „prvému“ kolíku na lcd. Ak nie je # špecifikované, potom musí mať hardvér vyťahovací prvok # zodpovedajúca lcd linka. #kontrast: # Kontrast, ktorý sa má nastaviť. Hodnota sa môže pohybovať od 0 do 63 a # predvolená hodnota je 40. ...

source: [display_data my_group_name my_data_name] position: # Comma separated row and column of the display position that should # be used to display the information. This parameter must be # provided. text: # The text to show at the given position. This field is evaluated # using command templates (see docs/Command_Templates.md). This # parameter must be provided.
sk: [display_data my_group_name my_data_name] pozícia: # Čiarkami oddelený riadok a stĺpec pozície zobrazenia, ktorý by mal # sa používa na zobrazenie informácií. Tento parameter musí byť # poskytnuté. text: # Text, ktorý sa má zobraziť na danej pozícii. Toto pole sa vyhodnocuje # pomocou šablón príkazov (pozri docs/Command_Templates.md). Toto Musíte zadať # parameter.

source: [display_glyph my_display_glyph] #data: # The display data, stored as 16 lines consisting of 16 bits (1 per # pixel) where '.' is a blank pixel and '*' is an on pixel (e.g., # "****************" to display a solid horizontal line). # Alternatively, one can use '0' for a blank pixel and '1' for an on # pixel. Put each display line into a separate config line. The # glyph must consist of exactly 16 lines with 16 bits each. This # parameter is optional. #hd44780_data: # Glyph to use on 20x4 hd44780 displays. The glyph must consist of # exactly 8 lines with 5 bits each. This parameter is optional. #hd44780_slot: # The hd44780 hardware index (0..7) to store the glyph at. If # multiple distinct images use the same slot then make sure to only # use one of those images in any given screen. This parameter is # required if hd44780_data is specified.
sk: [display_glyph my_display_glyph] #data: # Údaje na displeji uložené ako 16 riadkov pozostávajúcich zo 16 bitov (1 na # pixel), kde '.' je prázdny pixel a „*“ je zapnutý pixel (napr. # "****************" na zobrazenie plnej vodorovnej čiary). # Alternatívne je možné použiť „0“ pre prázdny pixel a „1“ pre zapnutie # pixel. Vložte každý riadok zobrazenia do samostatného konfiguračného riadku. The # glyf musí pozostávať z presne 16 riadkov so 16 bitmi. Toto # parameter je voliteľný. #hd44780_data: # Glyf na použitie na displejoch 20x4 hd44780. Glyf musí pozostávať z # presne 8 riadkov po 5 bitoch. Tento parameter je voliteľný. #hd44780_slot: # Hardvérový index hd44780 (0..7), na ktorý sa má glyf uložiť. Ak # viaceré odlišné obrázky používajú rovnaký slot, potom sa uistite, že iba # použite jeden z týchto obrázkov na ľubovoľnej obrazovke. Tento parameter je # povinné, ak je zadaný hd44780_data.

source: [display my_extra_display] # See the "display" section for available parameters.
sk: [display my_extra_display] # Dostupné parametre nájdete v časti „zobrazenie“.

source: # Common parameters available for all menu config sections. #[menu __some_list __some_name] #type: disabled # Permanently disabled menu element, only required attribute is 'type'. # Allows you to easily disable/hide existing menu items. #[menu some_name] #type: # One of command, input, list, text: # command - basic menu element with various script triggers # input - same like 'command' but has value changing capabilities. # Press will start/stop edit mode. # list - it allows for menu items to be grouped together in a # scrollable list. Add to the list by creating menu # configurations using "some_list" as a prefix - for # example: [menu some_list some_item_in_the_list] # vsdlist - same as 'list' but will append files from virtual sdcard # (will be removed in the future) #name: # Name of menu item - evaluated as a template. #enable: # Template that evaluates to True or False. #index: # Position where an item needs to be inserted in list. By default # the item is added at the end. #[menu some_list] #type: list #name: #enable: # See above for a description of these parameters. #[menu some_list some_command] #type: command #name: #enable: # See above for a description of these parameters. #gcode: # Script to run on button click or long click. Evaluated as a # template. #[menu some_list some_input] #type: input #name: #enable: # See above for a description of these parameters. #input: # Initial value to use when editing - evaluated as a template. # Result must be float. #input_min: # Minimum value of range - evaluated as a template. Default -99999. #input_max: # Maximum value of range - evaluated as a template. Default 99999. #input_step: # Editing step - Must be a positive integer or float value. It has # internal fast rate step. When "(input_max - input_min) / # input_step > 100" then fast rate step is 10 * input_step else fast # rate step is same input_step. #realtime: # This attribute accepts static boolean value. When enabled then # gcode script is run after each value change. The default is False. #gcode: # Script to run on button click, long click or value change. # Evaluated as a template. The button click will trigger the edit # mode start or end.
sk: # Spoločné parametre dostupné pre všetky sekcie konfigurácie menu. #[menu __some_list __some_name] #type: zakázané # Natrvalo zakázaný prvok ponuky, povinným atribútom je iba 'typ'. # Umožňuje vám jednoducho zakázať/skryť existujúce položky ponuky. #[menu some_name] #typ: # Jeden z príkazu, vstupu, zoznamu, textu: # command - základný prvok menu s rôznymi spúšťačmi skriptov # input – rovnaký ako „príkaz“, ale má schopnosť meniť hodnotu. # Stlačením spustíte/zastavíte režim úprav. # zoznam - umožňuje zoskupiť položky menu do a # rolovateľný zoznam. Pridajte do zoznamu vytvorením ponuky # konfigurácií s použitím "nejakého_zoznamu" ako predpony - pre # príklad: [menu some_list some_item_in_the_list] # vsdlist - to isté ako 'list', ale pripojí súbory z virtuálnej sdcard # (bude odstránené v budúcnosti) #názov: # Názov položky menu - vyhodnotené ako šablóna. #enable: # Šablóna, ktorá sa vyhodnotí ako True alebo False. #index: # Pozícia, kde je potrebné vložiť položku do zoznamu. Predvolene # položka sa pridá na koniec. #[menu some_list] #typ: zoznam #názov: #enable: # Popis týchto parametrov nájdete vyššie. #[menu some_list some_command] #type: príkaz #názov: #enable: # Popis týchto parametrov nájdete vyššie. #gcode: # Skript na spustenie kliknutím na tlačidlo alebo dlhým kliknutím. Vyhodnotené ako a # šablóna. #[menu some_list some_input] #typ: vstup #názov: #enable: # Popis týchto parametrov nájdete vyššie. #input: # Počiatočná hodnota, ktorá sa má použiť pri úpravách – vyhodnotená ako šablóna. # Výsledok musí byť pohyblivý. #input_min: # Minimálna hodnota rozsahu - vyhodnotená ako šablóna. Predvolená hodnota -99999. #input_max: # Maximálna hodnota rozsahu - vyhodnotená ako šablóna. Predvolená hodnota 99999. #input_step: # Krok úpravy – Musí to byť kladné celé číslo alebo pohyblivá hodnota. Má # interný krok rýchlej rýchlosti. Keď "(vstup_max - vstup_min) / # input_step > 100" potom rýchly krok je 10 * input_step inak rýchly # krok rýchlosti je rovnaký input_step. #reálny čas: # Tento atribút akceptuje statickú boolovskú hodnotu. Keď je aktivovaná # skript gcode sa spustí po každej zmene hodnoty. Predvolená hodnota je False. #gcode: # Skript na spustenie po kliknutí na tlačidlo, dlhom kliknutí alebo zmene hodnoty. # Vyhodnotené ako šablóna. Kliknutím na tlačidlo sa spustí úprava # začiatok alebo koniec režimu.

source: [filament_switch_sensor my_sensor] #pause_on_runout: True # When set to True, a PAUSE will execute immediately after a runout # is detected. Note that if pause_on_runout is False and the # runout_gcode is omitted then runout detection is disabled. Default # is True. #runout_gcode: # A list of G-Code commands to execute after a filament runout is # detected. See docs/Command_Templates.md for G-Code format. If # pause_on_runout is set to True this G-Code will run after the # PAUSE is complete. The default is not to run any G-Code commands. #insert_gcode: # A list of G-Code commands to execute after a filament insert is # detected. See docs/Command_Templates.md for G-Code format. The # default is not to run any G-Code commands, which disables insert # detection. #event_delay: 3.0 # The minimum amount of time in seconds to delay between events. # Events triggered during this time period will be silently # ignored. The default is 3 seconds. #pause_delay: 0.5 # The amount of time to delay, in seconds, between the pause command # dispatch and execution of the runout_gcode. It may be useful to # increase this delay if OctoPrint exhibits strange pause behavior. # Default is 0.5 seconds. #switch_pin: # The pin on which the switch is connected. This parameter must be # provided.
sk: [filament_switch_sensor my_sensor] #pause_on_runout: Pravda # Keď je nastavené na True, PAUSE sa spustí ihneď po vyčerpaní # je zistený. Všimnite si, že ak je pause_on_runout False a # runout_gcode je vynechaný, potom je detekcia runout zakázaná. Predvolené # je pravda. #runout_gcode: # Zoznam príkazov kódu G, ktoré sa majú vykonať po vyčerpaní vlákna # zistených. Formát G-kódu nájdete na stránke docs/Command_Templates.md. Ak # pause_on_runout je nastavené na True tento G-kód sa spustí po # PAUSE je dokončená. Štandardne sa nespúšťajú žiadne príkazy G-kódu. #insert_gcode: # Zoznam príkazov kódu G, ktoré sa majú vykonať po vložení vlákna # zistených. Formát G-kódu nájdete na stránke docs/Command_Templates.md. The # predvolené je nespúšťať žiadne príkazy G-kódu, čo zakazuje vkladanie # detekcia. #event_delay: 3.0 # Minimálny čas v sekundách na oneskorenie medzi udalosťami. # Udalosti spustené počas tohto časového obdobia budú tiché # ignorované. Predvolená hodnota je 3 sekundy. #pause_delay: 0,5 # Čas oneskorenia v sekundách medzi príkazom pauzy # odoslanie a vykonanie runout_gcode. Môže to byť užitočné # zvýšte toto oneskorenie, ak OctoPrint vykazuje zvláštne správanie pri pozastavení. # Predvolená hodnota je 0,5 sekundy. #switch_pin: # Pin, na ktorom je pripojený spínač. Tento parameter musí byť # poskytnuté.

source: [filament_motion_sensor my_sensor] detection_length: 7.0 # The minimum length of filament pulled through the sensor to trigger # a state change on the switch_pin # Default is 7 mm. extruder: # The name of the extruder section this sensor is associated with. # This parameter must be provided. switch_pin: #pause_on_runout: #runout_gcode: #insert_gcode: #event_delay: #pause_delay: # See the "filament_switch_sensor" section for a description of the # above parameters.
sk: [filament_motion_sensor my_sensor] dĺžka_detekcie: 7,0 # Minimálna dĺžka vlákna pretiahnutého cez snímač na spustenie # zmena stavu na prepínači # Predvolená hodnota je 7 mm. extrudér: # Názov sekcie extrudéra, s ktorou je tento senzor spojený. # Tento parameter musí byť zadaný. prepínač: #pause_on_runout: #runout_gcode: #insert_gcode: #event_delay: #pause_delay: # Pozrite si časť "filament_switch_sensor" pre popis # vyššie uvedené parametre.

source: [hall_filament_width_sensor] adc1: adc2: # Analog input pins connected to the sensor. These parameters must # be provided. #cal_dia1: 1.50 #cal_dia2: 2.00 # The calibration values (in mm) for the sensors. The default is # 1.50 for cal_dia1 and 2.00 for cal_dia2. #raw_dia1: 9500 #raw_dia2: 10500 # The raw calibration values for the sensors. The default is 9500 # for raw_dia1 and 10500 for raw_dia2. #default_nominal_filament_diameter: 1.75 # The nominal filament diameter. This parameter must be provided. #max_difference: 0.200 # Maximum allowed filament diameter difference in millimeters (mm). # If difference between nominal filament diameter and sensor output # is more than +- max_difference, extrusion multiplier is set back # to %100. The default is 0.200. #measurement_delay: 70 # The distance from sensor to the melting chamber/hot-end in # millimeters (mm). The filament between the sensor and the hot-end # will be treated as the default_nominal_filament_diameter. Host # module works with FIFO logic. It keeps each sensor value and # position in an array and POP them back in correct position. This # parameter must be provided. #enable: False # Sensor enabled or disabled after power on. The default is to # disable. #measurement_interval: 10 # The approximate distance (in mm) between sensor readings. The # default is 10mm. #logging: False # Out diameter to terminal and klipper.log can be turn on|of by # command. #min_diameter: 1.0 # Minimal diameter for trigger virtual filament_switch_sensor. #use_current_dia_while_delay: False # Use the current diameter instead of the nominal diameter while # the measurement delay has not run through. #pause_on_runout: #runout_gcode: #insert_gcode: #event_delay: #pause_delay: # See the "filament_switch_sensor" section for a description of the # above parameters.
sk: [hall_filament_width_sensor] adc1: adc2: # Analógové vstupné kolíky pripojené k senzoru. Tieto parametre musia # byť poskytovaný. #cal_dia1: 1,50 #cal_dia2: 2,00 # Kalibračné hodnoty (v mm) pre snímače. Predvolená hodnota je # 1,50 pre cal_dia1 a 2,00 pre cal_dia2. #raw_dia1: 9500 #raw_dia2: 10500 # Hrubé kalibračné hodnoty pre senzory. Predvolená hodnota je 9500 # pre raw_dia1 a 10500 pre raw_dia2. #default_nominal_filament_diameter: 1,75 # Menovitý priemer vlákna. Tento parameter je potrebné zadať. #max_difference: 0,200 # Maximálny povolený rozdiel priemeru vlákna v milimetroch (mm). # Ak je rozdiel medzi menovitým priemerom vlákna a výstupom snímača # je viac ako +- max_difference, multiplikátor vytláčania je nastavený späť # až %100. Predvolená hodnota je 0,200. #measurement_delay: 70 # Vzdialenosť od snímača k taviacej komore/horúcej časti # milimetrov (mm). Vlákno medzi snímačom a horúcim koncom # sa bude považovať za default_nominal_filament_diameter. Hostiteľ # modul pracuje s logikou FIFO. Zachováva hodnotu každého snímača a # pozíciu v poli a POP ich späť na správnu pozíciu. Toto Musíte zadať # parameter. #enable: False # Senzor aktivovaný alebo zakázaný po zapnutí. Predvolená hodnota je # zakázať. #interval_merania: 10 # Približná vzdialenosť (v mm) medzi hodnotami snímača. The # predvolená hodnota je 10 mm. #logging: Nepravda # Výstupný priemer do terminálu a klipper.log je možné zapnúť|z # príkaz. #min_diameter: 1,0 # Minimálny priemer pre spúšťací virtuálny filament_switch_sensor. #use_current_dia_while_delay: Nesprávne # Použite aktuálny priemer namiesto menovitého priemeru # oneskorenie merania neprebehlo. #pause_on_runout: #runout_gcode: #insert_gcode: #event_delay: #pause_delay: # Pozrite si časť "filament_switch_sensor" pre popis # vyššie uvedené parametre.

source: [adc_scaled my_name] vref_pin: # The ADC pin to use for VREF monitoring. This parameter must be # provided. vssa_pin: # The ADC pin to use for VSSA monitoring. This parameter must be # provided. #smooth_time: 2.0 # A time value (in seconds) over which the vref and vssa # measurements will be smoothed to reduce the impact of measurement # noise. The default is 2 seconds.
sk: [adc_scaled my_name] vref_pin: # Pin ADC, ktorý sa má použiť na monitorovanie VREF. Tento parameter musí byť # poskytnuté. vssa_pin: # Pin ADC na použitie na monitorovanie VSSA. Tento parameter musí byť # poskytnuté. #smooth_time: 2,0 # Časová hodnota (v sekundách), nad ktorou sú hodnoty vref a vssa # meraní bude vyhladených, aby sa znížil vplyv merania # hluk. Predvolená hodnota je 2 sekundy.

source: #spi_speed: # The SPI speed (in hz) to use when communicating with the device. # The default depends on the type of device. #spi_bus: # If the micro-controller supports multiple SPI busses then one may # specify the micro-controller bus name here. The default depends on # the type of micro-controller. #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # Specify the above parameters to use "software based SPI". This # mode does not require micro-controller hardware support (typically # any general purpose pins may be used). The default is to not use # "software spi".
sk: #spi_speed: # Rýchlosť SPI (v Hz), ktorá sa má použiť pri komunikácii so zariadením. # Predvolené nastavenie závisí od typu zariadenia. #spi_bus: # Ak mikrokontrolér podporuje viacero zberníc SPI, potom jedna môže # tu zadajte názov zbernice mikrokontroléra. Predvolená hodnota závisí od # typ mikrokontroléra. #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # Ak chcete použiť "softvérové SPI", zadajte vyššie uvedené parametre. Toto Režim # nevyžaduje hardvérovú podporu mikrokontroléra (zvyčajne # môžu sa použiť akékoľvek kolíky na všeobecné použitie). Predvolená hodnota je nepoužívať # "softvér spi".
