Repository: fran6p/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Config_Reference.po
Languages: sk

source: [duplicate_pin_override] pins: # A comma separated list of pins that may be used multiple times in # a config file without normal error checks. This parameter must be # provided.
sk: [duplicate_pin_override] špendlíky: # Čiarkami oddelený zoznam pinov, ktoré možno použiť viackrát # konfiguračný súbor bez bežných kontrol chýb. Tento parameter musí byť # poskytnuté.

source: SAMD SERCOM configuration to specify which pins to use on a given SERCOM. One may define any number of sections with a "samd_sercom" prefix. Each SERCOM must be configured prior to using it as SPI or I2C peripheral. Place this config section above any other section that makes use of SPI or I2C buses.
sk: Konfigurácia SAMD SERCOM na určenie, ktoré kolíky sa majú použiť na danom SERCOM. Je možné definovať ľubovoľný počet sekcií s predponou „samd_sercom“. Každý SERCOM musí byť pred použitím ako periférne zariadenie SPI alebo I2C nakonfigurovaný. Umiestnite túto konfiguračnú sekciu nad akúkoľvek inú sekciu, ktorá využíva zbernice SPI alebo I2C.

source: [samd_sercom my_sercom] sercom: # The name of the sercom bus to configure in the micro-controller. # Available names are "sercom0", "sercom1", etc.. This parameter # must be provided. tx_pin: # MOSI pin for SPI communication, or SDA (data) pin for I2C # communication. The pin must have a valid pinmux configuration # for the given SERCOM peripheral. This parameter must be provided. #rx_pin: # MISO pin for SPI communication. This pin is not used for I2C # communication (I2C uses tx_pin for both sending and receiving). # The pin must have a valid pinmux configuration for the given # SERCOM peripheral. This parameter is optional. clk_pin: # CLK pin for SPI communication, or SCL (clock) pin for I2C # communication. The pin must have a valid pinmux configuration # for the given SERCOM peripheral. This parameter must be provided.
sk: [samd_sercom my_sercom] sercom: # Názov sercom zbernice na konfiguráciu v mikrokontroléri. # Dostupné názvy sú "sercom0", "sercom1" atď. Tento parameter # musí byť poskytnuté. tx_pin: # MOSI pin pre SPI komunikáciu, alebo SDA (dátový) pin pre I2C #komunikacia. Pin musí mať platnú konfiguráciu pinmux # pre danú perifériu SERCOM. Tento parameter je potrebné zadať. #rx_pin: # MISO pin pre komunikáciu SPI. Tento kolík sa nepoužíva pre I2C # komunikácia (I2C používa tx_pin na odosielanie aj prijímanie). # Pin musí mať platnú konfiguráciu pinmux pre danú položku # Periférne zariadenie SERCOM. Tento parameter je voliteľný. clk_pin: # CLK pin pre SPI komunikáciu alebo SCL (hodinový) pin pre I2C #komunikacia. Pin musí mať platnú konfiguráciu pinmux # pre danú perifériu SERCOM. Tento parameter je potrebné zadať.

source: Configuration reference
sk: Odkaz na konfiguráciu

source: Controller cooling fan (one may define any number of sections with a "controller_fan" prefix). A "controller fan" is a fan that will be enabled whenever its associated heater or its associated stepper driver is active. The fan will stop whenever an idle_timeout is reached to ensure no overheating will occur after deactivating a watched component.
sk: Ventilátor chladenia regulátora (je možné definovať ľubovoľný počet sekcií s predponou "controller_fan"). "Ventilátor regulátora" je ventilátor, ktorý sa aktivuje vždy, keď je aktívny príslušný ohrievač alebo jeho priradený krokový ovládač. Ventilátor sa zastaví vždy, keď sa dosiahne idle_timeout, aby sa zabezpečilo, že po deaktivácii sledovaného komponentu nedôjde k prehriatiu.

source: See the [rotation distance document](Rotation_Distance.md) for information on calculating the `rotation_distance` parameter. See the [Multi-MCU homing](Multi_MCU_Homing.md) document for information on homing using multiple micro-controllers.
sk: Informácie o výpočte parametra `rotation_distance` nájdete v [dokumente o vzdialenosti rotácie](Rotation_Distance.md). Informácie o navádzaní pomocou viacerých mikroovládačov nájdete v dokumente [Multi-MCU_Homing.md].

source: [probe] pin: # Probe detection pin. If the pin is on a different microcontroller # than the Z steppers then it enables "multi-mcu homing". This # parameter must be provided. #deactivate_on_each_sample: True # This determines if Klipper should execute deactivation gcode # between each probe attempt when performing a multiple probe # sequence. The default is True. #x_offset: 0.0 # The distance (in mm) between the probe and the nozzle along the # x-axis. The default is 0. #y_offset: 0.0 # The distance (in mm) between the probe and the nozzle along the # y-axis. The default is 0. z_offset: # The distance (in mm) between the bed and the nozzle when the probe # triggers. This parameter must be provided. #speed: 5.0 # Speed (in mm/s) of the Z axis when probing. The default is 5mm/s. #samples: 1 # The number of times to probe each point. The probed z-values will # be averaged. The default is to probe 1 time. #sample_retract_dist: 2.0 # The distance (in mm) to lift the toolhead between each sample (if # sampling more than once). The default is 2mm. #lift_speed: # Speed (in mm/s) of the Z axis when lifting the probe between # samples. The default is to use the same value as the 'speed' # parameter. #samples_result: average # The calculation method when sampling more than once - either # "median" or "average". The default is average. #samples_tolerance: 0.100 # The maximum Z distance (in mm) that a sample may differ from other # samples. If this tolerance is exceeded then either an error is # reported or the attempt is restarted (see # samples_tolerance_retries). The default is 0.100mm. #samples_tolerance_retries: 0 # The number of times to retry if a sample is found that exceeds # samples_tolerance. On a retry, all current samples are discarded # and the probe attempt is restarted. If a valid set of samples are # not obtained in the given number of retries then an error is # reported. The default is zero which causes an error to be reported # on the first sample that exceeds samples_tolerance. #activate_gcode: # A list of G-Code commands to execute prior to each probe attempt. # See docs/Command_Templates.md for G-Code format. This may be # useful if the probe needs to be activated in some way. Do not # issue any commands here that move the toolhead (eg, G1). The # default is to not run any special G-Code commands on activation. #deactivate_gcode: # A list of G-Code commands to execute after each probe attempt # completes. See docs/Command_Templates.md for G-Code format. Do not # issue any commands here that move the toolhead. The default is to # not run any special G-Code commands on deactivation.
sk: [sonda] pripnúť: # Detekčný kolík sondy. Ak je kolík na inom mikrokontroléri # než steppery Z potom umožňuje "multi-mcu navádzanie". Toto Musíte zadať # parameter. #deactivate_on_each_sample: Pravda # Toto určuje, či má Klipper vykonať deaktiváciu gcode # medzi každým pokusom o sondu pri vykonávaní viacerých sond # sekvencia. Predvolená hodnota je True. #x_offset: 0,0 # Vzdialenosť (v mm) medzi sondou a tryskou pozdĺž # os x. Predvolená hodnota je 0. #y_offset: 0,0 # Vzdialenosť (v mm) medzi sondou a tryskou pozdĺž # os y. Predvolená hodnota je 0. z_offset: # Vzdialenosť (v mm) medzi lôžkom a tryskou pri sonde # spúšťačov. Tento parameter je potrebné zadať. #rýchlosť: 5,0 # Rýchlosť (v mm/s) osi Z pri snímaní. Predvolená hodnota je 5 mm/s. #vzorky: 1 # Počet testov každého bodu. Skúšané z-hodnoty budú # byť spriemerovaný. Štandardne je sonda 1 krát. #sample_retract_dist: 2.0 # Vzdialenosť (v mm) na zdvihnutie nástrojovej hlavy medzi každou vzorkou (ak # odber vzoriek viac ako raz). Predvolená hodnota je 2 mm. #lift_speed: # Rýchlosť (v mm/s) osi Z pri zdvíhaní sondy medzi # vzorky. Predvolená hodnota je použiť rovnakú hodnotu ako „rýchlosť“ # parameter. #samples_result: priemer # Metóda výpočtu pri odbere vzoriek viac ako raz - buď # "medián" alebo "priemer". Predvolená hodnota je priemerná. #tolerancia_vzorkov: 0,100 # Maximálna vzdialenosť Z (v mm), ktorou sa vzorka môže líšiť od ostatných # vzorky. Ak je táto tolerancia prekročená, ide buď o chybu # hlásené alebo sa pokus reštartuje (pozri # sample_tolerance_retries). Predvolená hodnota je 0,100 mm. #samples_tolerance_retries: 0 # Počet opakovaní, ak sa nájde vzorka, ktorá presahuje hodnotu # vzorky_tolerancia. Pri opätovnom pokuse sa všetky aktuálne vzorky zahodia # a pokus o sondu sa reštartuje. Ak je platný súbor vzoriek # sa nedosiahne v danom počte opakovaní, potom je chyba # nahlásených. Predvolená hodnota je nula, čo spôsobí hlásenie chyby # na prvej vzorke, ktorá presahuje toleranciu vzoriek. #activate_gcode: # Zoznam príkazov G-kódu, ktoré sa majú vykonať pred každým pokusom o sondu. # Formát G-kódu nájdete na stránke docs/Command_Templates.md. Toto môže byť # užitočné, ak treba sondu nejakým spôsobom aktivovať. nie # tu zadajte akékoľvek príkazy, ktoré pohybujú hlavou nástroja (napr. G1). The # predvolené je nespúšťať žiadne špeciálne príkazy G-kódu pri aktivácii. #deactivate_gcode: # Zoznam príkazov G-kódu, ktoré sa majú vykonať po každom pokuse o sondu # dokončení. Formát G-kódu nájdete na stránke docs/Command_Templates.md. nie # tu zadajte akékoľvek príkazy, ktoré posunú hlavu nástroja. Predvolená hodnota je # pri deaktivácii nespúšťajte žiadne špeciálne príkazy G-kódu.

source: [display] lcd_type: # The type of LCD chip in use. This may be "hd44780", "hd44780_spi", # "st7920", "emulated_st7920", "uc1701", "ssd1306", or "sh1106". # See the display sections below for information on each type and # additional parameters they provide. This parameter must be # provided. #display_group: # The name of the display_data group to show on the display. This # controls the content of the screen (see the "display_data" section # for more information). The default is _default_20x4 for hd44780 # displays and _default_16x4 for other displays. #menu_timeout: # Timeout for menu. Being inactive this amount of seconds will # trigger menu exit or return to root menu when having autorun # enabled. The default is 0 seconds (disabled) #menu_root: # Name of the main menu section to show when clicking the encoder # on the home screen. The defaults is __main, and this shows the # the default menus as defined in klippy/extras/display/menu.cfg #menu_reverse_navigation: # When enabled it will reverse up and down directions for list # navigation. The default is False. This parameter is optional. #encoder_pins: # The pins connected to encoder. 2 pins must be provided when using # encoder. This parameter must be provided when using menu. #encoder_steps_per_detent: # How many steps the encoder emits per detent ("click"). If the # encoder takes two detents to move between entries or moves two # entries from one detent, try changing this. Allowed values are 2 # (half-stepping) or 4 (full-stepping). The default is 4. #click_pin: # The pin connected to 'enter' button or encoder 'click'. This # parameter must be provided when using menu. The presence of an # 'analog_range_click_pin' config parameter turns this parameter # from digital to analog. #back_pin: # The pin connected to 'back' button. This parameter is optional, # menu can be used without it. The presence of an # 'analog_range_back_pin' config parameter turns this parameter from # digital to analog. #up_pin: # The pin connected to 'up' button. This parameter must be provided # when using menu without encoder. The presence of an # 'analog_range_up_pin' config parameter turns this parameter from # digital to analog. #down_pin: # The pin connected to 'down' button. This parameter must be # provided when using menu without encoder. The presence of an # 'analog_range_down_pin' config parameter turns this parameter from # digital to analog. #kill_pin: # The pin connected to 'kill' button. This button will call # emergency stop. The presence of an 'analog_range_kill_pin' config # parameter turns this parameter from digital to analog. #analog_pullup_resistor: 4700 # The resistance (in ohms) of the pullup attached to the analog # button. The default is 4700 ohms. #analog_range_click_pin: # The resistance range for a 'enter' button. Range minimum and # maximum comma-separated values must be provided when using analog # button. #analog_range_back_pin: # The resistance range for a 'back' button. Range minimum and # maximum comma-separated values must be provided when using analog # button. #analog_range_up_pin: # The resistance range for a 'up' button. Range minimum and maximum # comma-separated values must be provided when using analog button. #analog_range_down_pin: # The resistance range for a 'down' button. Range minimum and # maximum comma-separated values must be provided when using analog # button. #analog_range_kill_pin: # The resistance range for a 'kill' button. Range minimum and # maximum comma-separated values must be provided when using analog # button.
sk: [zobraziť] lcd_type: # Typ používaného LCD čipu. Môže to byť "hd44780", "hd44780_spi", # "st7920", "emulated_st7920", "uc1701", "ssd1306" alebo "sh1106". # Informácie o jednotlivých typoch a typoch nájdete v častiach zobrazenia nižšie # ďalšie parametre, ktoré poskytujú. Tento parameter musí byť # poskytnuté. #display_group: # Názov skupiny display_data, ktorá sa má zobraziť na displeji. Toto # riadi obsah obrazovky (pozrite si časť „display_data“. # Pre viac informácií). Predvolená hodnota je _default_20x4 pre hd44780 # displejov a _default_16x4 pre ostatné displeje. #menu_timeout: # Časový limit pre menu. Ak je toto množstvo sekúnd neaktívne, bude to tak # spúšťacie menu ukončenie alebo návrat do koreňového menu pri automatickom spustení # povolené. Predvolená hodnota je 0 sekúnd (zakázané) #menu_root: # Názov časti hlavnej ponuky, ktorá sa zobrazí po kliknutí na kódovač # na domovskej obrazovke. Predvolená hodnota je __main a toto zobrazuje # predvolené ponuky definované v klippy/extras/display/menu.cfg #menu_reverse_navigation: # Keď je povolená, bude sa pre zoznam obracať nahor a nadol # navigácia. Predvolená hodnota je False. Tento parameter je voliteľný. #encoder_pins: # Kolíky pripojené ku kódovaču. Pri použití musia byť poskytnuté 2 kolíky # kódovač. Tento parameter je potrebné zadať pri používaní ponuky. #encoder_steps_per_detent: # Koľko krokov vydá kódovač na zarážku ("kliknutie"). Ak # kódovač má dve zarážky na pohyb medzi záznamami alebo pohybuje dvoma # záznamov z jednej zarážky, skúste to zmeniť. Povolené hodnoty sú 2 # (polovičný krok) alebo 4 (úplný krok). Predvolená hodnota je 4. #click_pin: # Kolík pripojený k tlačidlu „enter“ alebo „kliknutiu“ kódovača. Toto Pri používaní ponuky je potrebné zadať # parameter. Prítomnosť an # 'analog_range_click_pin' konfiguračný parameter zmení tento parameter # z digitálneho na analógový. #back_pin: # Kolík pripojený k tlačidlu „späť“. Tento parameter je voliteľný, # menu je možné použiť aj bez neho. Prítomnosť an # 'analog_range_back_pin' konfiguračný parameter zmení tento parameter z # digitálne na analógové. #up_pin: # Kolík pripojený k tlačidlu „hore“. Tento parameter je potrebné zadať # pri používaní ponuky bez kódovača. Prítomnosť an # 'analog_range_up_pin' konfiguračný parameter zmení tento parameter z # digitálne na analógové. #down_pin: # Kolík pripojený k tlačidlu „dole“. Tento parameter musí byť # poskytnuté pri používaní ponuky bez kódovača. Prítomnosť an # 'analog_range_down_pin' konfiguračný parameter zmení tento parameter # digitálne na analógové. #kill_pin: # Kolík pripojený k tlačidlu „zabiť“. Toto tlačidlo zavolá # núdzová zastávka. Prítomnosť konfigurácie 'analog_range_kill_pin' # parameter zmení tento parameter z digitálneho na analógový. #analog_pullup_rezistor: 4700 # Odpor (v ohmoch) pullupu pripojeného k analógu # tlačidlo. Predvolená hodnota je 4700 ohmov. #analog_range_click_pin: # Rozsah odporu pre tlačidlo „enter“. Minimálny dosah a Pri použití analógového signálu je potrebné zadať maximálne hodnoty oddelené čiarkou # tlačidlo. #analog_range_back_pin: # Rozsah odporu pre tlačidlo „späť“. Minimálny dosah a Pri použití analógového signálu je potrebné zadať maximálne hodnoty oddelené čiarkou # tlačidlo. #analog_range_up_pin: # Rozsah odporu pre tlačidlo „hore“. Minimálny a maximálny rozsah Pri použití analógového tlačidla je potrebné zadať # hodnoty oddelené čiarkou. #analog_range_down_pin: # Rozsah odporu pre tlačidlo „dole“. Minimálny dosah a Pri použití analógového signálu je potrebné zadať maximálne hodnoty oddelené čiarkou # tlačidlo. #analog_range_kill_pin: # Rozsah odporu pre tlačidlo „zabiť“. Minimálny dosah a Pri použití analógového signálu je potrebné zadať maximálne hodnoty oddelené čiarkou # tlačidlo.

source: sensor_type: # One of "EPCOS 100K B57560G104F", "ATC Semitec 104GT-2", # "ATC Semitec 104NT-4-R025H42G", "Generic 3950", # "Honeywell 100K 135-104LAG-J01", "NTC 100K MGB18-104F39050L32", # "SliceEngineering 450", or "TDK NTCG104LH104JT1" sensor_pin: # Analog input pin connected to the thermistor. This parameter must # be provided. #pullup_resistor: 4700 # The resistance (in ohms) of the pullup attached to the thermistor. # The default is 4700 ohms. #inline_resistor: 0 # The resistance (in ohms) of an extra (not heat varying) resistor # that is placed inline with the thermistor. It is rare to set this. # The default is 0 ohms.
sk: senzor_typ: # Jeden z "EPCOS 100K B57560G104F", "ATC Semitec 104GT-2", # "ATC Semitec 104NT-4-R025H42G", "Generic 3950", # "Honeywell 100K 135-104LAG-J01", "NTC 100K MGB18-104F39050L32", # "SliceEngineering 450" alebo "TDK NTCG104LH104JT1" senzor_pin: # Analógový vstupný kolík pripojený k termistoru. Tento parameter musí # byť poskytovaný. #pullup_rezistor: 4700 # Odpor (v ohmoch) pullupu pripojeného k termistoru. # Predvolená hodnota je 4700 ohmov. #inline_rezistor: 0 # Odpor (v ohmoch) prídavného odporu (bez zmeny teploty). #, ktorý je umiestnený v rade s termistorom. Toto je zriedkavé nastaviť. # Predvolená hodnota je 0 ohmov.

source: Hall filament width sensor (see [Hall Filament Width Sensor](Hall_Filament_Width_Sensor.md)).
sk: Senzor šírky Hallovho vlákna (pozri [Senzor šírky Hallovho vlákna](Hall_Filament_Width_Sensor.md)).

source: Replicape support - see the [beaglebone guide](Beaglebone.md) and the [generic-replicape.cfg](../config/generic-replicape.cfg) file for an example.
sk: Podpora repliky – príklad nájdete v [príručke pre beaglebone](Beaglebone.md) a v súbore [generic-replicape.cfg](../config/generic-replicape.cfg).
