Repository: fran6p/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Config_Reference.po
Languages: sk

source: [printer] kinematics: rotary_delta max_z_velocity: # For delta printers this limits the maximum velocity (in mm/s) of # moves with z axis movement. This setting can be used to reduce the # maximum speed of up/down moves (which require a higher step rate # than other moves on a delta printer). The default is to use # max_velocity for max_z_velocity. #minimum_z_position: 0 # The minimum Z position that the user may command the head to move # to. The default is 0. shoulder_radius: # Radius (in mm) of the horizontal circle formed by the three # shoulder joints, minus the radius of the circle formed by the # effector joints. This parameter may also be calculated as: # shoulder_radius = (delta_f - delta_e) / sqrt(12) # This parameter must be provided. shoulder_height: # Distance (in mm) of the shoulder joints from the bed, minus the # effector toolhead height. This parameter must be provided. # The stepper_a section describes the stepper controlling the rear # right arm (at 30 degrees). This section also controls the homing # parameters (homing_speed, homing_retract_dist) for all arms. [stepper_a] gear_ratio: # A gear_ratio must be specified and rotation_distance may not be # specified. For example, if the arm has an 80 toothed pulley driven # by a pulley with 16 teeth, which is in turn connected to a 60 # toothed pulley driven by a stepper with a 16 toothed pulley, then # one would specify a gear ratio of "80:16, 60:16". This parameter # must be provided. position_endstop: # Distance (in mm) between the nozzle and the bed when the nozzle is # in the center of the build area and the endstop triggers. This # parameter must be provided for stepper_a; for stepper_b and # stepper_c this parameter defaults to the value specified for # stepper_a. upper_arm_length: # Length (in mm) of the arm connecting the "shoulder joint" to the # "elbow joint". This parameter must be provided for stepper_a; for # stepper_b and stepper_c this parameter defaults to the value # specified for stepper_a. lower_arm_length: # Length (in mm) of the arm connecting the "elbow joint" to the # "effector joint". This parameter must be provided for stepper_a; # for stepper_b and stepper_c this parameter defaults to the value # specified for stepper_a. #angle: # This option specifies the angle (in degrees) that the arm is at. # The default is 30 for stepper_a, 150 for stepper_b, and 270 for # stepper_c. # The stepper_b section describes the stepper controlling the rear # left arm (at 150 degrees). [stepper_b] # The stepper_c section describes the stepper controlling the front # arm (at 270 degrees). [stepper_c] # The delta_calibrate section enables a DELTA_CALIBRATE extended # g-code command that can calibrate the shoulder endstop positions. [delta_calibrate] radius: # Radius (in mm) of the area that may be probed. This is the radius # of nozzle coordinates to be probed; if using an automatic probe # with an XY offset then choose a radius small enough so that the # probe always fits over the bed. This parameter must be provided. #speed: 50 # The speed (in mm/s) of non-probing moves during the calibration. # The default is 50. #horizontal_move_z: 5 # The height (in mm) that the head should be commanded to move to # just prior to starting a probe operation. The default is 5.
sk: [tlačiareň] kinematika: rotačná_delta max_z_velocity: # Pre delta tlačiarne to obmedzuje maximálnu rýchlosť (v mm/s). # sa pohybuje s pohybom osi z. Toto nastavenie možno použiť na zníženie # maximálna rýchlosť pohybov nahor/nadol (ktoré vyžadujú vyššiu rýchlosť krokov # než iné pohyby na delta tlačiarni). Predvolená hodnota je použiť # max_velocity pre max_z_velocity. #minimum_z_position: 0 # Minimálna poloha Z, ktorú môže používateľ prikázať pohybu hlavy # až. Predvolená hodnota je 0. polomer_ ramena: # Polomer (v mm) vodorovného kruhu tvoreného tromi # ramenných kĺbov mínus polomer kruhu tvoreného # efektorové kĺby. Tento parameter možno vypočítať aj takto: # ramenný_radius = (delta_f - delta_e) / sqrt(12) # Tento parameter musí byť zadaný. ramenná_výška: # Vzdialenosť (v mm) ramenných kĺbov od lôžka mínus # výška nástrojovej hlavy efektora. Tento parameter je potrebné zadať. # Časť stepper_a popisuje stepper ovládajúci zadnú časť # pravá ruka (pri 30 stupňoch). Táto sekcia tiež riadi navádzanie # parametrov (homing_speed, homing_retract_dist) pre všetky ramená. [stepper_a] prevodový pomer: # Musí byť špecifikovaný gear_ratio a rotácia nesmie byť # špecifikované. Napríklad, ak má rameno poháňanú 80 ozubenú kladku # pomocou kladky so 16 zubami, ktorá je zase pripojená k 60 # ozubená remenica poháňaná stepperom so 16 ozubenou remenicou, potom # jeden by špecifikoval prevodový pomer "80:16, 60:16". Tento parameter # musí byť poskytnuté. position_endstop: # Vzdialenosť (v mm) medzi tryskou a lôžkom, keď je tryska zapnutá # v strede stavebnej oblasti a spúšťa sa koncový doraz. Toto # parameter musí byť poskytnutý pre stepper_a; pre stepper_b a # stepper_c tento parameter má predvolenú hodnotu zadanú pre # stepper_a. dĺžka_horného_ramene: # Dĺžka (v mm) ramena spájajúceho "ramenný kĺb" s # "lakťový kĺb". Tento parameter musí byť poskytnutý pre stepper_a; pre # stepper_b a stepper_c tento parameter má predvolenú hodnotu # zadané pre stepper_a. Lower_arm_length: # Dĺžka (v mm) ramena spájajúceho "lakťový kĺb" s # "efektorový kĺb". Tento parameter musí byť poskytnutý pre stepper_a; # pre stepper_b a stepper_c tento parameter má predvolenú hodnotu # zadané pre stepper_a. #uhol: # Táto možnosť určuje uhol (v stupňoch), v ktorom je rameno. # Predvolená hodnota je 30 pre stepper_a, 150 pre stepper_b a 270 pre # stepper_c. # Časť stepper_b popisuje stepper ovládajúci zadnú časť # ľavá ruka (v uhle 150 stupňov). [stepper_b] # Časť stepper_c popisuje stepper ovládajúci prednú časť # rameno (pri 270 stupňoch). [stepper_c] # Sekcia delta_calibrate umožňuje rozšírenie DELTA_CALIBRATE # Príkaz g-kódu, ktorý dokáže kalibrovať polohy koncových dorazov ramien. [delta_calibrate] polomer: # Polomer (v mm) oblasti, ktorá môže byť snímaná. Toto je polomer # súradníc trysky, ktoré sa majú snímať; ak používate automatickú sondu # s posunom XY, potom zvoľte dostatočne malý polomer, aby #sonda sa vždy zmestí nad posteľ. Tento parameter je potrebné zadať. #rýchlosť: 50 # Rýchlosť (v mm/s) nesnímaných pohybov počas kalibrácie. # Predvolená hodnota je 50. #horizontal_move_z: 5 # Výška (v mm), do ktorej sa má hlava pohnúť # tesne pred spustením operácie sondy. Predvolená hodnota je 5.

source: [printer] kinematics: none max_velocity: 1 max_accel: 1 # The max_velocity and max_accel parameters must be defined. The # values are not used for "none" kinematics.
sk: [tlačiareň] kinematika: žiadna maximálna_rýchlosť: 1 max_accel: 1 # Parametre max_velocity a max_accel musia byť definované. The # hodnoty sa nepoužívajú pre „žiadnu“ kinematiku.

source: [heater_bed] heater_pin: sensor_type: sensor_pin: control: min_temp: max_temp: # See the "extruder" section for a description of the above parameters.
sk: [heat_bed] ohrievač_pin: senzor_typ: senzor_pin: ovládanie: min_temp: max_temp: # Popis vyššie uvedených parametrov nájdete v časti "extrudér".

source: [homing_override] gcode: # A list of G-Code commands to execute in place of G28 commands # found in the normal g-code input. See docs/Command_Templates.md # for G-Code format. If a G28 is contained in this list of commands # then it will invoke the normal homing procedure for the printer. # The commands listed here must home all axes. This parameter must # be provided. #axes: xyz # The axes to override. For example, if this is set to "z" then the # override script will only be run when the z axis is homed (eg, via # a "G28" or "G28 Z0" command). Note, the override script should # still home all axes. The default is "xyz" which causes the # override script to be run in place of all G28 commands. #set_position_x: #set_position_y: #set_position_z: # If specified, the printer will assume the axis is at the specified # position prior to running the above g-code commands. Setting this # disables homing checks for that axis. This may be useful if the # head must move prior to invoking the normal G28 mechanism for an # axis. The default is to not force a position for an axis.
sk: [homing_override] gcode: # Zoznam príkazov kódu G, ktoré sa majú vykonať namiesto príkazov G28 # nájdené v bežnom vstupe g-kódu. Pozrite si docs/Command_Templates.md # pre formát G-Code. Ak sa v tomto zozname príkazov nachádza G28 # potom vyvolá normálnu procedúru navádzania tlačiarne. # Príkazy uvedené v tomto zozname musia uviesť všetky osi. Tento parameter musí # byť poskytovaný. #axes: xyz # Osi, ktoré sa majú prepísať. Napríklad, ak je toto nastavené na "z", potom # skript override sa spustí iba vtedy, keď je os z nastavená (napr. cez # príkaz "G28" alebo "G28 Z0"). Všimnite si, že by mal prepísať skript # ešte doma všetky osi. Predvolená hodnota je "xyz", čo spôsobuje # skript override, ktorý sa má spustiť namiesto všetkých príkazov G28. #set_position_x: #set_position_y: #set_position_z: # Ak je zadané, tlačiareň bude predpokladať, že os je v zadanej polohe # pozíciu pred spustením vyššie uvedených príkazov g-kódu. Nastavenie tohto # zakáže kontroly navádzania pre túto os. To môže byť užitočné, ak # hlava sa musí pohnúť pred spustením normálneho mechanizmu G28 # os. Predvolená hodnota je nevynútená poloha pre os.

source: [endstop_phase stepper_z] #endstop_accuracy: # Sets the expected accuracy (in mm) of the endstop. This represents # the maximum error distance the endstop may trigger (eg, if an # endstop may occasionally trigger 100um early or up to 100um late # then set this to 0.200 for 200um). The default is # 4*rotation_distance/full_steps_per_rotation. #trigger_phase: # This specifies the phase of the stepper motor driver to expect # when hitting the endstop. It is composed of two numbers separated # by a forward slash character - the phase and the total number of # phases (eg, "7/64"). Only set this value if one is sure the # stepper motor driver is reset every time the mcu is reset. If this # is not set, then the stepper phase will be detected on the first # home and that phase will be used on all subsequent homes. #endstop_align_zero: False # If true then the position_endstop of the axis will effectively be # modified so that the zero position for the axis occurs at a full # step on the stepper motor. (If used on the Z axis and the print # layer height is a multiple of a full step distance then every # layer will occur on a full step.) The default is False.
sk: [endstop_phase stepper_z] #endstop_accuracy: # Nastavuje očakávanú presnosť (v mm) koncového dorazu. Toto predstavuje # maximálna vzdialenosť chyby, ktorú môže koncový doraz spustiť (napr # endstop môže príležitostne spustiť o 100 um skôr alebo až o 100 um neskoro # potom to nastavte na 0,200 pre 200 um). Predvolená hodnota je # 4*rotation_distance/full_steps_per_rotation. #trigger_phase: # Toto špecifikuje očakávanú fázu ovládača krokového motora # pri náraze na koncovú zarážku. Skladá sa z dvoch oddelených čísel # znakom lomky - fáza a celkový počet # fáz (napr. "7/64"). Túto hodnotu nastavte iba vtedy, ak ste si istí # ovládač krokového motora sa resetuje pri každom resete mcu. Ak toto # nie je nastavené, potom sa kroková fáza zistí na prvej # domov a táto fáza sa použije vo všetkých nasledujúcich domoch. #endstop_align_zero: Nepravda # Ak je pravda, potom bude koncová zarážka position_endstop osi efektívne # upravené tak, aby nulová poloha pre os bola úplná # nastúpte na krokový motor. (Ak sa použije na osi Z a výtlačok # výška vrstvy je násobkom vzdialenosti celého kroku potom každá # vrstva sa vyskytne na úplnom kroku.) Predvolená hodnota je False.

source: [gcode_macro my_cmd] #gcode: # A list of G-Code commands to execute in place of "my_cmd". See # docs/Command_Templates.md for G-Code format. This parameter must # be provided. #variable_<name>: # One may specify any number of options with a "variable_" prefix. # The given variable name will be assigned the given value (parsed # as a Python literal) and will be available during macro expansion. # For example, a config with "variable_fan_speed = 75" might have # gcode commands containing "M106 S{ fan_speed * 255 }". Variables # can be changed at run-time using the SET_GCODE_VARIABLE command # (see docs/Command_Templates.md for details). Variable names may # not use upper case characters. #rename_existing: # This option will cause the macro to override an existing G-Code # command and provide the previous definition of the command via the # name provided here. This can be used to override builtin G-Code # commands. Care should be taken when overriding commands as it can # cause complex and unexpected results. The default is to not # override an existing G-Code command. #description: G-Code macro # This will add a short description used at the HELP command or while # using the auto completion feature. Default "G-Code macro"
sk: [gcode_macro my_cmd] #gcode: # Zoznam príkazov G-Code, ktoré sa majú vykonať namiesto "my_cmd". Pozri # docs/Command_Templates.md pre formát G-Code. Tento parameter musí # byť poskytovaný. #variable_<názov>: # Môžete zadať ľubovoľný počet možností s predponou "variable_". # Danému názvu premennej bude priradená daná hodnota (analyzovaná # ako literál Pythonu) a bude k dispozícii počas rozšírenia makra. # Napríklad konfigurácia s "variable_fan_speed = 75" môže mať # príkazy gcode obsahujúce "M106 S{ fan_speed * 255 }". Premenné # možno zmeniť za behu pomocou príkazu SET_GCODE_VARIABLE # (podrobnosti nájdete v docs/Command_Templates.md). Názvy premenných môžu # nepoužívajte veľké písmená. #rename_existing: # Táto možnosť spôsobí, že makro prepíše existujúci kód G # a poskytnite predchádzajúcu definíciu príkazu cez Tu je uvedené # meno. Toto možno použiť na prepísanie vstavaného kódu G-Code # príkazov. Pri prepisovaní príkazov by ste mali byť opatrní # spôsobiť zložité a neočakávané výsledky. Predvolená hodnota je nie # prepíše existujúci príkaz G-kódu. #description: Makro G-Code # Toto pridá krátky popis použitý pri príkaze HELP alebo while # pomocou funkcie automatického dokončovania. Predvolené „makro G-Code“

source: [delayed_gcode my_delayed_gcode] gcode: # A list of G-Code commands to execute when the delay duration has # elapsed. G-Code templates are supported. This parameter must be # provided. #initial_duration: 0.0 # The duration of the initial delay (in seconds). If set to a # non-zero value the delayed_gcode will execute the specified number # of seconds after the printer enters the "ready" state. This can be # useful for initialization procedures or a repeating delayed_gcode. # If set to 0 the delayed_gcode will not execute on startup. # Default is 0.
sk: [delayed_gcode my_delayed_gcode] gcode: # Zoznam príkazov G-kódu, ktoré sa majú vykonať po uplynutí doby oneskorenia # uplynulo. Šablóny G-Code sú podporované. Tento parameter musí byť # poskytnuté. #initial_duration: 0,0 # Trvanie počiatočného oneskorenia (v sekundách). Ak je nastavený na a # nenulová hodnota delayed_gcode vykoná zadané číslo # sekúnd po tom, čo tlačiareň prejde do stavu „pripravená“. Toto môže byť # užitočné pre inicializačné procedúry alebo opakujúci sa delayed_gcode. # Ak je nastavené na 0, delayed_gcode sa nespustí pri štarte. # Predvolená hodnota je 0.

source: [save_variables] filename: # Required - provide a filename that would be used to save the # variables to disk e.g. ~/variables.cfg
sk: [save_variables] názov súboru: # Povinné - zadajte názov súboru, ktorý sa použije na uloženie súboru # premenné na disk napr. ~/variables.cfg

source: [idle_timeout] #gcode: # A list of G-Code commands to execute on an idle timeout. See # docs/Command_Templates.md for G-Code format. The default is to run # "TURN_OFF_HEATERS" and "M84". #timeout: 600 # Idle time (in seconds) to wait before running the above G-Code # commands. The default is 600 seconds.
sk: [idle_timeout] #gcode: # Zoznam príkazov kódu G, ktoré sa majú vykonať v čase nečinnosti. Pozri # docs/Command_Templates.md pre formát G-Code. Predvolené nastavenie je spustiť # "TURN_OFF_HEATERS" a "M84". #timeout: 600 # Čas nečinnosti (v sekundách) na čakanie pred spustením vyššie uvedeného G-kódu # príkazov. Predvolená hodnota je 600 sekúnd.

source: [force_move] #enable_force_move: False # Set to true to enable FORCE_MOVE and SET_KINEMATIC_POSITION # extended G-Code commands. The default is false.
sk: [force_move] #enable_force_move: Nepravda # Ak chcete povoliť FORCE_MOVE a SET_KINEMATIC_POSITION, nastavte na hodnotu true # rozšírené príkazy G-Code. Predvolená hodnota je nepravda.

source: [pause_resume] #recover_velocity: 50. # When capture/restore is enabled, the speed at which to return to # the captured position (in mm/s). Default is 50.0 mm/s.
sk: [pause_resume] #recover_velocity: 50. # Keď je povolené zachytávanie/obnovenie, rýchlosť, na ktorú sa má vrátiť # zachytená poloha (v mm/s). Predvolená hodnota je 50,0 mm/s.

source: [firmware_retraction] #retract_length: 0 # The length of filament (in mm) to retract when G10 is activated, # and to unretract when G11 is activated (but see # unretract_extra_length below). The default is 0 mm. #retract_speed: 20 # The speed of retraction, in mm/s. The default is 20 mm/s. #unretract_extra_length: 0 # The length (in mm) of *additional* filament to add when # unretracting. #unretract_speed: 10 # The speed of unretraction, in mm/s. The default is 10 mm/s.
sk: [firmware_retraction] #retract_length: 0 # Dĺžka vlákna (v mm), ktorá sa má zatiahnuť pri aktivácii G10, # a na odtiahnutie, keď je aktivovaná G11 (ale pozri # unretract_extra_length nižšie). Predvolená hodnota je 0 mm. #retract_speed: 20 # Rýchlosť sťahovania v mm/s. Predvolená hodnota je 20 mm/s. #unretract_extra_length: 0 # Dĺžka (v mm) *ďalšieho* vlákna, ktoré sa má pridať # odtiahnutie. #unretract_speed: 10 # Rýchlosť roztiahnutia v mm/s. Predvolená hodnota je 10 mm/s.

source: [gcode_arcs] #resolution: 1.0 # An arc will be split into segments. Each segment's length will # equal the resolution in mm set above. Lower values will produce a # finer arc, but also more work for your machine. Arcs smaller than # the configured value will become straight lines. The default is # 1mm.
sk: [gcode_arcs] #rozlíšenie: 1.0 # Oblúk bude rozdelený na segmenty. Dĺžka každého segmentu bude # sa rovná vyššie nastavenému rozlíšeniu v mm. Nižšie hodnoty spôsobia a # jemnejší oblúk, ale aj viac práce pre váš stroj. Oblúky menšie ako # nakonfigurovaná hodnota sa zmení na rovné čiary. Predvolená hodnota je # 1 mm.

source: [respond] #default_type: echo # Sets the default prefix of the "M118" and "RESPOND" output to one # of the following: # echo: "echo: " (This is the default) # command: "// " # error: "!! " #default_prefix: echo: # Directly sets the default prefix. If present, this value will # override the "default_type".
sk: [odpovedať] #default_type: echo # Nastaví predvolenú predponu výstupu „M118“ a „RESPOND“ na jednu # z nasledujúcich: # echo: "echo: " (Toto je predvolené nastavenie) # príkaz: "// " # chyba: "!! " #default_prefix: echo: # Priamo nastaví predvolenú predponu. Ak je prítomná, táto hodnota bude # prepíše "default_type".

source: [input_shaper] #shaper_freq_x: 0 # A frequency (in Hz) of the input shaper for X axis. This is # usually a resonance frequency of X axis that the input shaper # should suppress. For more complex shapers, like 2- and 3-hump EI # input shapers, this parameter can be set from different # considerations. The default value is 0, which disables input # shaping for X axis. #shaper_freq_y: 0 # A frequency (in Hz) of the input shaper for Y axis. This is # usually a resonance frequency of Y axis that the input shaper # should suppress. For more complex shapers, like 2- and 3-hump EI # input shapers, this parameter can be set from different # considerations. The default value is 0, which disables input # shaping for Y axis. #shaper_type: mzv # A type of the input shaper to use for both X and Y axes. Supported # shapers are zv, mzv, zvd, ei, 2hump_ei, and 3hump_ei. The default # is mzv input shaper. #shaper_type_x: #shaper_type_y: # If shaper_type is not set, these two parameters can be used to # configure different input shapers for X and Y axes. The same # values are supported as for shaper_type parameter. #damping_ratio_x: 0.1 #damping_ratio_y: 0.1 # Damping ratios of vibrations of X and Y axes used by input shapers # to improve vibration suppression. Default value is 0.1 which is a # good all-round value for most printers. In most circumstances this # parameter requires no tuning and should not be changed.
sk: [input_shaper] #shaper_freq_x: 0 # Frekvencia (v Hz) vstupného tvarovača pre os X. Toto je # zvyčajne rezonančná frekvencia osi X, ktorá je vstupným tvarovačom # by mal potlačiť. Pre zložitejšie tvarovače, ako sú 2- a 3-hrbové EI # vstupné tvarovače, tento parameter je možné nastaviť z rôznych # úvah. Predvolená hodnota je 0, čo deaktivuje vstup # tvarovanie pre os X. #shaper_freq_y: 0 # Frekvencia (v Hz) vstupného tvarovača pre os Y. Toto je # zvyčajne rezonančná frekvencia osi Y, ktorá je vstupným tvarovačom # by mal potlačiť. Pre zložitejšie tvarovače, ako sú 2- a 3-hrbové EI # vstupné tvarovače, tento parameter je možné nastaviť z rôznych # úvah. Predvolená hodnota je 0, čo deaktivuje vstup # tvarovanie pre os Y. #shaper_type: mzv # Typ vstupného tvarovača, ktorý sa má použiť pre osi X aj Y. Podporované # shapers sú zv, mzv, zvd, ei, 2hump_ei a 3hump_ei. Predvolená hodnota # je tvarovač vstupu mzv. #shaper_type_x: #shaper_type_y: # Ak nie je nastavený shaper_type, možno použiť tieto dva parametre # nakonfigurujte rôzne vstupné tvarovače pre osi X a Y. Rovnaký # hodnoty sú podporované ako pre parameter shaper_type. #damping_ratio_x: 0,1 #damping_ratio_y: 0,1 # Pomery tlmenia vibrácií osí X a Y používané vstupnými tvarovačmi # na zlepšenie potláčania vibrácií. Predvolená hodnota je 0,1, čo je a # dobrá všestranná hodnota pre väčšinu tlačiarní. Vo väčšine prípadov toto # parameter nevyžaduje žiadne ladenie a nemal by sa meniť.

source: [board_pins my_aliases] mcu: mcu # A comma separated list of micro-controllers that may use the # aliases. The default is to apply the aliases to the main "mcu". aliases: aliases_<name>: # A comma separated list of "name=value" aliases to create for the # given micro-controller. For example, "EXP1_1=PE6" would create an # "EXP1_1" alias for the "PE6" pin. However, if "value" is enclosed # in "<>" then "name" is created as a reserved pin (for example, # "EXP1_9=<GND>" would reserve "EXP1_9"). Any number of options # starting with "aliases_" may be specified.
sk: [nástenné_piny my_aliases] mcu: mcu # Čiarkami oddelený zoznam mikroovládačov, ktoré môžu používať # aliasov. Predvolene sa aliasy použijú na hlavnú „mcu“. prezývky: aliasy_<meno>: # Čiarkami oddelený zoznam aliasov "name=value", ktoré sa majú vytvoriť pre # daný mikroovládač. Napríklad „EXP1_1=PE6“ by vytvorilo # Alias "EXP1_1" pre kolík "PE6". Ak je však priložená „hodnota“. # v "<>", potom "name" sa vytvorí ako rezervovaný pin (napr. # "EXP1_9=<GND>" by rezervovalo "EXP1_9"). Ľubovoľný počet možností Môže byť špecifikované # začínajúce na "aliases_".
