Repository: fran6p/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Config_Reference.po
Languages: sk

source: [manual_stepper my_stepper] #step_pin: #dir_pin: #enable_pin: #microsteps: #rotation_distance: # See the "stepper" section for a description of these parameters. #velocity: # Set the default velocity (in mm/s) for the stepper. This value # will be used if a MANUAL_STEPPER command does not specify a SPEED # parameter. The default is 5mm/s. #accel: # Set the default acceleration (in mm/s^2) for the stepper. An # acceleration of zero will result in no acceleration. This value # will be used if a MANUAL_STEPPER command does not specify an ACCEL # parameter. The default is zero. #endstop_pin: # Endstop switch detection pin. If specified, then one may perform # "homing moves" by adding a STOP_ON_ENDSTOP parameter to # MANUAL_STEPPER movement commands.
sk: [manual_stepper my_stepper] #step_pin: #dir_pin: #enable_pin: #mikrokroky: #rotation_distance: # Popis týchto parametrov nájdete v časti „stepper“. #rýchlosť: # Nastavte predvolenú rýchlosť (v mm/s) pre stepper. Táto hodnota # sa použije, ak príkaz MANUAL_STEPPER nešpecifikuje SPEED # parameter. Predvolená hodnota je 5 mm/s. #accel: # Nastavte predvolené zrýchlenie (v mm/s^2) pre stepper. An # nulové zrýchlenie nebude mať za následok žiadne zrýchlenie. Táto hodnota # sa použije, ak príkaz MANUAL_STEPPER nešpecifikuje ACCEL # parameter. Predvolená hodnota je nula. #endstop_pin: # Detekčný kolík koncového spínača. Ak je to špecifikované, môže sa vykonať # "pohyby nasmerovania" pridaním parametra STOP_ON_ENDSTOP do # príkazov pohybu MANUAL_STEPPER.

source: [homing_heaters] #steppers: # A comma separated list of steppers that should cause heaters to be # disabled. The default is to disable heaters for any homing/probing # move. # Typical example: stepper_z #heaters: # A comma separated list of heaters to disable during homing/probing # moves. The default is to disable all heaters. # Typical example: extruder, heater_bed
sk: [homing_heaters] #steppers: # Čiarkami oddelený zoznam stepperov, ktoré by mali spôsobiť, že ohrievače budú # zakázané. Predvolené nastavenie je vypnutie ohrievačov pre akékoľvek navádzanie/sondovanie # ťah. # Typický príklad: stepper_z #ohrievače: # Čiarkami oddelený zoznam ohrievačov, ktoré sa majú vypnúť počas navádzania/sondovania # ťahov. Predvolené nastavenie je vypnutie všetkých ohrievačov. # Typický príklad: extruder, heat_bed

source: [adc_temperature my_sensor] #temperature1: #voltage1: #temperature2: #voltage2: #... # A set of temperatures (in Celsius) and voltages (in Volts) to use # as reference when converting a temperature. A heater section using # this sensor may also specify adc_voltage and voltage_offset # parameters to define the ADC voltage (see "Common temperature # amplifiers" section for details). At least two measurements must # be provided. #temperature1: #resistance1: #temperature2: #resistance2: #... # Alternatively one may specify a set of temperatures (in Celsius) # and resistance (in Ohms) to use as reference when converting a # temperature. A heater section using this sensor may also specify a # pullup_resistor parameter (see "extruder" section for details). At # least two measurements must be provided.
sk: [adc_temperature my_sensor] #teplota1: #napätie1: #teplota2: #napätie2: #... # Súbor teplôt (v stupňoch Celzia) a napätia (vo voltoch), ktoré sa majú použiť # ako referencia pri prevode teploty. Použitie ohrievača # tento senzor môže tiež špecifikovať adc_voltage a voltage_offset # parametre na definovanie napätia ADC (pozri „Bežná teplota) Podrobnosti nájdete v sekcii # zosilňovače. Musia sa vykonať aspoň dve merania # byť poskytovaný. #teplota1: #odpor1: #teplota2: #odpor2: #... # Alternatívne je možné špecifikovať súbor teplôt (v stupňoch Celzia) # a odpor (v ohmoch), ktoré sa majú použiť ako referenčné pri konverzii a # teplota. Ohrievacia sekcia využívajúca tento snímač môže tiež špecifikovať a # parameter pullup_resistor (podrobnosti nájdete v časti "extruder"). O # musia byť poskytnuté aspoň dve merania.

source: [heater_generic my_generic_heater] #gcode_id: # The id to use when reporting the temperature in the M105 command. # This parameter must be provided. #heater_pin: #max_power: #sensor_type: #sensor_pin: #smooth_time: #control: #pid_Kp: #pid_Ki: #pid_Kd: #pwm_cycle_time: #min_temp: #max_temp: # See the "extruder" section for the definition of the above # parameters.
sk: [heater_generic my_generic_heater] #gcode_id: # ID, ktoré sa má použiť pri hlásení teploty v príkaze M105. # Tento parameter musí byť zadaný. #heater_pin: #max_power: #sensor_type: #sensor_pin: #smooth_time: #ovládanie: #pid_Kp: #pid_Ki: #pid_Kd: #pwm_cycle_time: #min_temp: #max_temp: # Definíciu vyššie uvedeného nájdete v časti „extruder“. # parametrov.

source: sensor_type: # One of "PT100 INA826", "AD595", "AD597", "AD8494", "AD8495", # "AD8496", or "AD8497". sensor_pin: # Analog input pin connected to the sensor. This parameter must be # provided. #adc_voltage: 5.0 # The ADC comparison voltage (in Volts). The default is 5 volts. #voltage_offset: 0 # The ADC voltage offset (in Volts). The default is 0.
sk: senzor_typ: # Jeden z "PT100 INA826", "AD595", "AD597", "AD8494", "AD8495", # "AD8496" alebo "AD8497". senzor_pin: # Analógový vstupný kolík pripojený k senzoru. Tento parameter musí byť # poskytnuté. #adc_voltage: 5.0 # Porovnávacie napätie ADC (vo voltoch). Predvolená hodnota je 5 voltov. #voltage_offset: 0 # Posun napätia ADC (vo voltoch). Predvolená hodnota je 0.

source: sensor_type: PT1000 sensor_pin: # Analog input pin connected to the sensor. This parameter must be # provided. #pullup_resistor: 4700 # The resistance (in ohms) of the pullup attached to the sensor. The # default is 4700 ohms.
sk: typ_senzora: PT1000 senzor_pin: # Analógový vstupný kolík pripojený k senzoru. Tento parameter musí byť # poskytnuté. #pullup_rezistor: 4700 # Odpor (v ohmoch) pullupu pripojeného k senzoru. The # predvolená hodnota je 4700 ohmov.

source: sensor_type: # One of "MAX6675", "MAX31855", "MAX31856", or "MAX31865". sensor_pin: # The chip select line for the sensor chip. This parameter must be # provided. #spi_speed: 4000000 # The SPI speed (in hz) to use when communicating with the chip. # The default is 4000000. #spi_bus: #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # See the "common SPI settings" section for a description of the # above parameters. #tc_type: K #tc_use_50Hz_filter: False #tc_averaging_count: 1 # The above parameters control the sensor parameters of MAX31856 # chips. The defaults for each parameter are next to the parameter # name in the above list. #rtd_nominal_r: 100 #rtd_reference_r: 430 #rtd_num_of_wires: 2 #rtd_use_50Hz_filter: False # The above parameters control the sensor parameters of MAX31865 # chips. The defaults for each parameter are next to the parameter # name in the above list.
sk: senzor_typ: # Jeden z "MAX6675", "MAX31855", "MAX31856" alebo "MAX31865". senzor_pin: # Riadok výberu čipu pre senzorový čip. Tento parameter musí byť # poskytnuté. #spi_speed: 4000000 # Rýchlosť SPI (v Hz), ktorá sa má použiť pri komunikácii s čipom. # Predvolená hodnota je 4 000 000. #spi_bus: #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # Popis nájdete v časti „spoločné nastavenia SPI“. # vyššie uvedené parametre. #tc_type: K #tc_use_50Hz_filter: Nepravda #tc_averaging_count: 1 # Vyššie uvedené parametre riadia parametre snímača MAX31856 # lupienky. Predvolené hodnoty pre každý parameter sú vedľa parametra # meno vo vyššie uvedenom zozname. #rtd_nominal_r: 100 #rtd_reference_r: 430 #rtd_num_of_wires: 2 #rtd_use_50Hz_filter: Nepravda # Vyššie uvedené parametre riadia parametre snímača MAX31865 # lupienky. Predvolené hodnoty pre každý parameter sú vedľa parametra # meno vo vyššie uvedenom zozname.

source: sensor_type: temperature_mcu #sensor_mcu: mcu # The micro-controller to read from. The default is "mcu". #sensor_temperature1: #sensor_adc1: # Specify the above two parameters (a temperature in Celsius and an # ADC value as a float between 0.0 and 1.0) to calibrate the # micro-controller temperature. This may improve the reported # temperature accuracy on some chips. A typical way to obtain this # calibration information is to completely remove power from the # printer for a few hours (to ensure it is at the ambient # temperature), then power it up and use the QUERY_ADC command to # obtain an ADC measurement. Use some other temperature sensor on # the printer to find the corresponding ambient temperature. The # default is to use the factory calibration data on the # micro-controller (if applicable) or the nominal values from the # micro-controller specification. #sensor_temperature2: #sensor_adc2: # If sensor_temperature1/sensor_adc1 is specified then one may also # specify sensor_temperature2/sensor_adc2 calibration data. Doing so # may provide calibrated "temperature slope" information. The # default is to use the factory calibration data on the # micro-controller (if applicable) or the nominal values from the # micro-controller specification.
sk: typ_senzora: teplota_mcu #sensor_mcu: mcu # Mikroovládač na čítanie. Predvolená hodnota je "mcu". #sensor_temperature1: #sensor_adc1: # Zadajte dva vyššie uvedené parametre (teplotu v stupňoch Celzia a an # Hodnota ADC ako plávajúca medzi 0,0 a 1,0) na kalibráciu # teplota mikroregulátora. To môže zlepšiť hlásené # presnosť teploty na niektorých čipoch. Typický spôsob, ako to získať # informácie o kalibrácii majú úplne odpojiť napájanie # tlačiareň na niekoľko hodín (aby ste sa uistili, že je v okolitom prostredí # teplota), potom ho zapnite a použite príkaz QUERY_ADC # získajte meranie ADC. Použite iný snímač teploty # tlačiareň, aby ste našli zodpovedajúcu okolitú teplotu. The # predvolené je použitie údajov kalibrácie z výroby na # mikroovládač (ak je k dispozícii) alebo nominálne hodnoty z # Špecifikácia mikrokontroléra. #sensor_temperature2: #sensor_adc2: # Ak je špecifikovaný senzor_teplota1/sensor_adc1, môžete tiež # špecifikujte kalibračné údaje senzor_teplota2/sensor_adc2. Pritom # môže poskytnúť kalibrované informácie o „teplotnom sklone“. The # predvolené je použitie údajov kalibrácie z výroby na # mikroovládač (ak je k dispozícii) alebo nominálne hodnoty z # Špecifikácia mikrokontroléra.

source: sensor_type: temperature_host #sensor_path: # The path to temperature system file. The default is # "/sys/class/thermal/thermal_zone0/temp" which is the temperature # system file on a Raspberry Pi computer.
sk: sensor_type: teplotný_hostiteľ #sensor_path: # Cesta k systémovému súboru teploty. Predvolená hodnota je # "/sys/class/thermal/thermal_zone0/temp", čo je teplota # systémový súbor na počítači Raspberry Pi.

source: sensor_type: DS18B20 serial_no: # Each 1-wire device has a unique serial number used to identify the device, # usually in the format 28-031674b175ff. This parameter must be provided. # Attached 1-wire devices can be listed using the following Linux command: # ls /sys/bus/w1/devices/ #ds18_report_time: # Interval in seconds between readings. Default is 3.0, with a minimum of 1.0 #sensor_mcu: # The micro-controller to read from. Must be the host_mcu
sk: typ_senzora: DS18B20 sériové číslo: # Každé 1-vodičové zariadenie má jedinečné sériové číslo používané na identifikáciu zariadenia, # zvyčajne vo formáte 28-031674b175ff. Tento parameter je potrebné zadať. # Pripojené 1-drôtové zariadenia je možné zobraziť pomocou nasledujúceho príkazu Linux: # ls /sys/bus/w1/devices/ #ds18_report_time: # Interval v sekundách medzi odčítaniami. Predvolená hodnota je 3.0 s minimom 1.0 #sensor_mcu: # Mikroovládač na čítanie. Musí to byť host_mcu

source: [servo my_servo] pin: # PWM output pin controlling the servo. This parameter must be # provided. #maximum_servo_angle: 180 # The maximum angle (in degrees) that this servo can be set to. The # default is 180 degrees. #minimum_pulse_width: 0.001 # The minimum pulse width time (in seconds). This should correspond # with an angle of 0 degrees. The default is 0.001 seconds. #maximum_pulse_width: 0.002 # The maximum pulse width time (in seconds). This should correspond # with an angle of maximum_servo_angle. The default is 0.002 # seconds. #initial_angle: # Initial angle (in degrees) to set the servo to. The default is to # not send any signal at startup. #initial_pulse_width: # Initial pulse width time (in seconds) to set the servo to. (This # is only valid if initial_angle is not set.) The default is to not # send any signal at startup.
sk: [servo my_servo] pripnúť: # Výstupný kolík PWM ovládajúci servo. Tento parameter musí byť # poskytnuté. #maximum_servo_angle: 180 # Maximálny uhol (v stupňoch), na ktorý je možné nastaviť toto servo. The # predvolená hodnota je 180 stupňov. #minimum_pulse_width: 0,001 # Minimálny čas šírky impulzu (v sekundách). Toto by malo zodpovedať # s uhlom 0 stupňov. Predvolená hodnota je 0,001 sekundy. #maximum_pulse_width: 0,002 # Čas maximálnej šírky impulzu (v sekundách). Toto by malo zodpovedať # s uhlom maximum_servo_angle. Predvolená hodnota je 0,002 # sekúnd. #initial_angle: # Počiatočný uhol (v stupňoch) na nastavenie serva. Predvolená hodnota je # neposiela žiadny signál pri spustení. #initial_pulse_width: # Čas počiatočnej šírky impulzu (v sekundách), na ktorý sa má servo nastaviť. (Toto # je platné iba vtedy, ak nie je nastavený počiatočný_uhol.) Predvolená hodnota je nie # poslať akýkoľvek signál pri spustení.

source: [gcode_button my_gcode_button] pin: # The pin on which the button is connected. This parameter must be # provided. #analog_range: # Two comma separated resistances (in Ohms) specifying the minimum # and maximum resistance range for the button. If analog_range is # provided then the pin must be an analog capable pin. The default # is to use digital gpio for the button. #analog_pullup_resistor: # The pullup resistance (in Ohms) when analog_range is specified. # The default is 4700 ohms. #press_gcode: # A list of G-Code commands to execute when the button is pressed. # G-Code templates are supported. This parameter must be provided. #release_gcode: # A list of G-Code commands to execute when the button is released. # G-Code templates are supported. The default is to not run any # commands on a button release.
sk: [gcode_button my_gcode_button] pripnúť: # Pin, na ktorom je tlačidlo pripojené. Tento parameter musí byť # poskytnuté. #analog_range: # Dva čiarkami oddelené odpory (v ohmoch) určujúce minimum # a maximálny rozsah odporu pre tlačidlo. Ak je analógový_rozsah # za predpokladu, že kolík musí byť analógový. Predvolená hodnota # je použitie digitálneho gpio pre tlačidlo. #analog_pullup_resistor: # Pullup odpor (v ohmoch), keď je špecifikovaný analog_range. # Predvolená hodnota je 4700 ohmov. #press_gcode: # Zoznam príkazov G-kódu, ktoré sa majú vykonať po stlačení tlačidla. # Šablóny G-Code sú podporované. Tento parameter je potrebné zadať. #release_gcode: # Zoznam príkazov G-kódu, ktoré sa majú vykonať po uvoľnení tlačidla. # Šablóny G-Code sú podporované. Predvolená hodnota je nespúšťať žiadne # príkazov pri uvoľnení tlačidla.

source: [output_pin my_pin] pin: # The pin to configure as an output. This parameter must be # provided. #pwm: False # Set if the output pin should be capable of pulse-width-modulation. # If this is true, the value fields should be between 0 and 1; if it # is false the value fields should be either 0 or 1. The default is # False. #static_value: # If this is set, then the pin is assigned to this value at startup # and the pin can not be changed during runtime. A static pin uses # slightly less ram in the micro-controller. The default is to use # runtime configuration of pins. #value: # The value to initially set the pin to during MCU configuration. # The default is 0 (for low voltage). #shutdown_value: # The value to set the pin to on an MCU shutdown event. The default # is 0 (for low voltage). #maximum_mcu_duration: # The maximum duration a non-shutdown value may be driven by the MCU # without an acknowledge from the host. # If host can not keep up with an update, the MCU will shutdown # and set all pins to their respective shutdown values. # Default: 0 (disabled) # Usual values are around 5 seconds. #cycle_time: 0.100 # The amount of time (in seconds) per PWM cycle. It is recommended # this be 10 milliseconds or greater when using software based PWM. # The default is 0.100 seconds for pwm pins. #hardware_pwm: False # Enable this to use hardware PWM instead of software PWM. When # using hardware PWM the actual cycle time is constrained by the # implementation and may be significantly different than the # requested cycle_time. The default is False. #scale: # This parameter can be used to alter how the 'value' and # 'shutdown_value' parameters are interpreted for pwm pins. If # provided, then the 'value' parameter should be between 0.0 and # 'scale'. This may be useful when configuring a PWM pin that # controls a stepper voltage reference. The 'scale' can be set to # the equivalent stepper amperage if the PWM were fully enabled, and # then the 'value' parameter can be specified using the desired # amperage for the stepper. The default is to not scale the 'value' # parameter.
sk: [output_pin my_pin] pripnúť: # Pin, ktorý sa má nakonfigurovať ako výstup. Tento parameter musí byť # poskytnuté. #pwm: Nepravda # Nastavte, či má byť výstupný kolík schopný modulácie šírky impulzu. # Ak je to pravda, polia hodnôt by mali byť medzi 0 a 1; Ak si to # je nepravda, polia hodnôt by mali byť 0 alebo 1. Predvolená hodnota je # Nepravdivé. #static_value: # Ak je toto nastavené, potom sa pri spustení priradí pin tejto hodnote # a pin nie je možné zmeniť počas prevádzky. Používa sa statický kolík # o niečo menej RAM v mikrokontroléri. Predvolená hodnota je použiť # runtime konfigurácia pinov. #value: # Hodnota, na ktorú sa má pôvodne nastaviť kolík počas konfigurácie MCU. # Predvolená hodnota je 0 (pre nízke napätie). #shutdown_value: # Hodnota, na ktorú sa má nastaviť kolík pri udalosti vypnutia MCU. Predvolená hodnota # je 0 (pre nízke napätie). #maximum_mcu_duration: # Maximálne trvanie hodnoty bez vypnutia môže riadiť MCU # bez potvrdenia od hostiteľa. # Ak hostiteľ nemôže držať krok s aktualizáciou, MCU sa vypne # a nastavte všetky kolíky na ich príslušné vypínacie hodnoty. # Predvolené: 0 (zakázané) # Bežné hodnoty sú okolo 5 sekúnd. #cycle_time: 0,100 # Množstvo času (v sekundách) na cyklus PWM. Odporúča sa # toto môže byť 10 milisekúnd alebo viac pri použití softvérového PWM. # Predvolená hodnota je 0,100 sekundy pre kolíky pwm. #hardware_pwm: Nepravda # Povoľte túto možnosť, ak chcete namiesto softvérového PWM použiť hardvérové PWM. Kedy # pomocou hardvérového PWM je skutočný čas cyklu obmedzený # implementácia a môže sa výrazne líšiť od # požadovaný cycle_time. Predvolená hodnota je False. #mierka: # Tento parameter možno použiť na zmenu spôsobu, akým sa 'hodnota' a # Parametre 'shutdown_value' sú interpretované pre piny pwm. Ak #, potom parameter 'value' by mal byť medzi 0,0 a # 'mierka'. To môže byť užitočné pri konfigurácii pinu PWM, ktorý # ovláda krokovú referenciu napätia. „Mierka“ sa dá nastaviť na # ekvivalentná kroková prúdová sila, ak bola PWM plne aktivovaná a # potom môže byť parameter 'value' špecifikovaný pomocou požadovaného # prúd pre stepper. Predvolená hodnota je neškálovať „hodnotu“ # parameter.

source: [multi_pin my_multi_pin] pins: # A comma separated list of pins associated with this alias. This # parameter must be provided.
sk: [multi_pin my_multi_pin] špendlíky: # Čiarkami oddelený zoznam pinov spojených s týmto aliasom. Toto Musíte zadať # parameter.

source: [ad5206 my_digipot] enable_pin: # The pin corresponding to the AD5206 chip select line. This pin # will be set to low at the start of SPI messages and raised to high # after the message completes. This parameter must be provided. #spi_speed: #spi_bus: #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # See the "common SPI settings" section for a description of the # above parameters. #channel_1: #channel_2: #channel_3: #channel_4: #channel_5: #channel_6: # The value to statically set the given AD5206 channel to. This is # typically set to a number between 0.0 and 1.0 with 1.0 being the # highest resistance and 0.0 being the lowest resistance. However, # the range may be changed with the 'scale' parameter (see below). # If a channel is not specified then it is left unconfigured. #scale: # This parameter can be used to alter how the 'channel_x' parameters # are interpreted. If provided, then the 'channel_x' parameters # should be between 0.0 and 'scale'. This may be useful when the # AD5206 is used to set stepper voltage references. The 'scale' can # be set to the equivalent stepper amperage if the AD5206 were at # its highest resistance, and then the 'channel_x' parameters can be # specified using the desired amperage value for the stepper. The # default is to not scale the 'channel_x' parameters.
sk: [ad5206 my_digipot] enable_pin: # Pin zodpovedajúci riadku výberu čipu AD5206. Tento špendlík # sa nastaví na nízku hodnotu na začiatku správ SPI a zvýši na vysokú # po dokončení správy. Tento parameter je potrebné zadať. #spi_speed: #spi_bus: #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # Popis nájdete v časti „spoločné nastavenia SPI“. # vyššie uvedené parametre. #channel_1: #channel_2: #channel_3: #channel_4: #channel_5: #channel_6: # Hodnota, na ktorú sa má staticky nastaviť daný kanál AD5206. Toto je # sa zvyčajne nastavuje na číslo medzi 0,0 a 1,0, pričom 1,0 je # najvyšší odpor a 0,0 je najnižší odpor. však # rozsah je možné zmeniť pomocou parametra 'scale' (pozri nižšie). # Ak kanál nie je špecifikovaný, zostane nenakonfigurovaný. #mierka: # Tento parameter možno použiť na zmenu parametrov 'channel_x' # sú interpretované. Ak sú uvedené, potom parametre „channel_x“. # by malo byť medzi 0,0 a 'scale'. To môže byť užitočné, keď # AD5206 sa používa na nastavenie krokových referencií napätia. „Váha“ môže # nastavte na ekvivalentnú krokovú intenzitu prúdu, ak by bol AD5206 na # jeho najvyšší odpor a potom môžu byť parametre 'channel_x' # špecifikované pomocou požadovanej hodnoty prúdu pre stepper. The # predvolené je neškálovať parametre 'channel_x'.
