Repository: fran6p/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Config_Reference.po
Languages: sk

source: [led my_led] #red_pin: #green_pin: #blue_pin: #white_pin: # The pin controlling the given LED color. At least one of the above # parameters must be provided. #cycle_time: 0.010 # The amount of time (in seconds) per PWM cycle. It is recommended # this be 10 milliseconds or greater when using software based PWM. # The default is 0.010 seconds. #hardware_pwm: False # Enable this to use hardware PWM instead of software PWM. When # using hardware PWM the actual cycle time is constrained by the # implementation and may be significantly different than the # requested cycle_time. The default is False. #initial_RED: 0.0 #initial_GREEN: 0.0 #initial_BLUE: 0.0 #initial_WHITE: 0.0 # Sets the initial LED color. Each value should be between 0.0 and # 1.0. The default for each color is 0.
sk: [viedol my_led] #red_pin: #green_pin: #blue_pin: #white_pin: # Pin ovládajúci danú farbu LED. Aspoň jeden z vyššie uvedených Je potrebné zadať # parametrov. #cycle_time: 0,010 # Množstvo času (v sekundách) na cyklus PWM. Odporúča sa # toto môže byť 10 milisekúnd alebo viac pri použití softvérového PWM. # Predvolená hodnota je 0,010 sekundy. #hardware_pwm: Nepravda # Povoľte túto možnosť, ak chcete namiesto softvérového PWM použiť hardvérové PWM. Kedy # pomocou hardvérového PWM je skutočný čas cyklu obmedzený # implementácia a môže sa výrazne líšiť od # požadovaný cycle_time. Predvolená hodnota je False. #initial_RED: 0,0 #initial_GREEN: 0,0 #initial_BLUE: 0,0 #initial_WHITE: 0,0 # Nastaví počiatočnú farbu LED. Každá hodnota by mala byť medzi 0,0 a # 1,0. Predvolená hodnota pre každú farbu je 0.

source: Neopixel (aka WS2812) LED support (one may define any number of sections with a "neopixel" prefix). See the [command reference](G-Codes.md#led) for more information.
sk: Neopixel (aka WS2812) podpora LED (je možné definovať ľubovoľný počet sekcií s predponou „neopixel“). Ďalšie informácie nájdete v [odkaz na príkaz](G-Codes.md#led).

source: Dotstar (aka APA102) LED support (one may define any number of sections with a "dotstar" prefix). See the [command reference](G-Codes.md#led) for more information.
sk: Dotstar (aka APA102) LED podpora (je možné definovať ľubovoľný počet sekcií s predponou "dotstar"). Ďalšie informácie nájdete v [odkaz na príkaz](G-Codes.md#led).

source: [dotstar my_dotstar] data_pin: # The pin connected to the data line of the dotstar. This parameter # must be provided. clock_pin: # The pin connected to the clock line of the dotstar. This parameter # must be provided. #chain_count: # See the "neopixel" section for information on this parameter. #initial_RED: 0.0 #initial_GREEN: 0.0 #initial_BLUE: 0.0 # See the "led" section for information on these parameters.
sk: [dotstar my_dotstar] data_pin: # Kolík pripojený k dátovej linke dotstar. Tento parameter # musí byť poskytnuté. clock_pin: # Kolík pripojený k hodinovej linke dotstar. Tento parameter # musí byť poskytnuté. #chain_count: # Informácie o tomto parametri nájdete v časti „neopixel“. #initial_RED: 0,0 #initial_GREEN: 0,0 #initial_BLUE: 0,0 # Informácie o týchto parametroch nájdete v časti „LED“.

source: Additional servos, buttons, and other pins
sk: Ďalšie servá, tlačidlá a ďalšie kolíky

source: Display data text "macros" (one may define any number of sections with a display_template prefix). See the [command templates](Command_Templates.md) document for information on template evaluation.
sk: Zobraziť dátový text "makrá" (možno definovať ľubovoľný počet sekcií s predponou display_template). Informácie o vyhodnocovaní šablón nájdete v dokumente [šablóny príkazov](Command_Templates.md).

source: [display_template my_template_name] #param_<name>: # One may specify any number of options with a "param_" prefix. The # given name will be assigned the given value (parsed as a Python # literal) and will be available during macro expansion. If the # parameter is passed in the call to render() then that value will # be used during macro expansion. For example, a config with # "param_speed = 75" might have a caller with # "render('my_template_name', param_speed=80)". Parameter names may # not use upper case characters. text: # The text to return when the this template is rendered. This field # is evaluated using command templates (see # docs/Command_Templates.md). This parameter must be provided.
sk: [display_template my_template_name] #param_<meno>: # Môžete zadať ľubovoľný počet možností s predponou "param_". The # krstnému názvu bude priradená daná hodnota (analyzovaná ako Python # literal) a bude k dispozícii počas rozšírenia makra. Ak Parameter # sa odovzdá vo volaní funkcie render(), potom bude táto hodnota # sa používa počas rozšírenia makra. Napríklad konfigurácia s # "param_speed = 75" môže mať volajúceho s # "render('my_template_name', param_speed=80)". Názvy parametrov môžu # nepoužívajte veľké písmená. text: # Text, ktorý sa má vrátiť po vykreslení tejto šablóny. Toto pole # sa vyhodnocuje pomocou šablón príkazov (pozri # docs/Command_Templates.md). Tento parameter je potrebné zadať.

source: Magnetic hall angle sensor support for reading stepper motor angle shaft measurements using a1333, as5047d, or tle5012b SPI chips. The measurements are available via the [API Server](API_Server.md) and [motion analysis tool](Debugging.md#motion-analysis-and-data-logging). See the [G-Code reference](G-Codes.md#angle) for available commands.
sk: Podpora magnetického hall uhlového snímača na čítanie meraní uhlového hriadeľa krokového motora pomocou čipov SPI a1333, as5047d alebo tle5012b. Merania sú dostupné cez [API Server](API_Server.md) a [nástroj na analýzu pohybu](Debugging.md#motion-analysis-and-data-logging). Dostupné príkazy nájdete v [Odkaz na kód G](G-Codes.md#uhol).

source: [angle my_angle_sensor] sensor_type: # The type of the magnetic hall sensor chip. Available choices are # "a1333", "as5047d", and "tle5012b". This parameter must be # specified. #sample_period: 0.000400 # The query period (in seconds) to use during measurements. The # default is 0.000400 (which is 2500 samples per second). #stepper: # The name of the stepper that the angle sensor is attached to (eg, # "stepper_x"). Setting this value enables an angle calibration # tool. To use this feature, the Python "numpy" package must be # installed. The default is to not enable angle calibration for the # angle sensor. cs_pin: # The SPI enable pin for the sensor. This parameter must be provided. #spi_speed: #spi_bus: #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # See the "common SPI settings" section for a description of the # above parameters.
sk: [uhol my_uhol_sensor] senzor_typ: # Typ magnetického hallového senzorového čipu. Dostupné možnosti sú # "a1333", "as5047d" a "tle5012b". Tento parameter musí byť # špecifikované. #sample_period: 0,000400 # Obdobie dopytu (v sekundách), ktoré sa má použiť počas meraní. The # predvolená hodnota je 0,000400 (čo je 2500 vzoriek za sekundu). #stepper: # Názov steppera, ku ktorému je pripojený snímač uhla (napr. # "stepper_x"). Nastavenie tejto hodnoty umožňuje kalibráciu uhla # nástroj. Na použitie tejto funkcie musí byť balík Python "numpy". # nainštalovaný. Predvolené nastavenie je nepovoliť kalibráciu uhla pre # snímač uhla. cs_pin: # Pin aktivácie SPI pre senzor. Tento parameter je potrebné zadať. #spi_speed: #spi_bus: #spi_software_sclk_pin: #spi_software_mosi_pin: #spi_software_miso_pin: # Popis nájdete v časti „spoločné nastavenia SPI“. # vyššie uvedené parametre.

source: [resonance_tester] #probe_points: # A list of X, Y, Z coordinates of points (one point per line) to test # resonances at. At least one point is required. Make sure that all # points with some safety margin in XY plane (~a few centimeters) # are reachable by the toolhead. #accel_chip: # A name of the accelerometer chip to use for measurements. If # adxl345 chip was defined without an explicit name, this parameter # can simply reference it as "accel_chip: adxl345", otherwise an # explicit name must be supplied as well, e.g. "accel_chip: adxl345 # my_chip_name". Either this, or the next two parameters must be # set. #accel_chip_x: #accel_chip_y: # Names of the accelerometer chips to use for measurements for each # of the axis. Can be useful, for instance, on bed slinger printer, # if two separate accelerometers are mounted on the bed (for Y axis) # and on the toolhead (for X axis). These parameters have the same # format as 'accel_chip' parameter. Only 'accel_chip' or these two # parameters must be provided. #max_smoothing: # Maximum input shaper smoothing to allow for each axis during shaper # auto-calibration (with 'SHAPER_CALIBRATE' command). By default no # maximum smoothing is specified. Refer to Measuring_Resonances guide # for more details on using this feature. #min_freq: 5 # Minimum frequency to test for resonances. The default is 5 Hz. #max_freq: 133.33 # Maximum frequency to test for resonances. The default is 133.33 Hz. #accel_per_hz: 75 # This parameter is used to determine which acceleration to use to # test a specific frequency: accel = accel_per_hz * freq. Higher the # value, the higher is the energy of the oscillations. Can be set to # a lower than the default value if the resonances get too strong on # the printer. However, lower values make measurements of # high-frequency resonances less precise. The default value is 75 # (mm/sec). #hz_per_sec: 1 # Determines the speed of the test. When testing all frequencies in # range [min_freq, max_freq], each second the frequency increases by # hz_per_sec. Small values make the test slow, and the large values # will decrease the precision of the test. The default value is 1.0 # (Hz/sec == sec^-2).
sk: [resonance_tester] #probe_points: # Zoznam súradníc X, Y, Z bodov (jeden bod na riadok) na testovanie # rezonancie pri. Vyžaduje sa aspoň jeden bod. Uistite sa, že všetky # bodov s určitou bezpečnostnou rezervou v rovine XY (~ niekoľko centimetrov) # sú dosiahnuteľné z hlavy nástroja. #accel_chip: # Názov čipu akcelerometra, ktorý sa má použiť na meranie. Ak # čip adxl345 bol definovaný bez explicitného názvu, tohto parametra # ho môže jednoducho odkazovať ako "accel_chip: adxl345", inak an # musí byť zadaný aj explicitný názov, napr. "accel_chip: adxl345 # my_chip_name". Musí to byť buď tento, alebo ďalšie dva parametre # sada. #accel_chip_x: #accel_chip_y: # Názvy čipov akcelerometra, ktoré sa majú použiť na meranie každého z nich # osi. Môže byť užitočný napríklad na tlačiarni posteľnej pračky, # ak sú na posteli namontované dva samostatné akcelerometre (pre os Y) # a na hlave nástroja (pre os X). Tieto parametre majú rovnaké # formát ako parameter 'accel_chip'. Iba „accel_chip“ alebo tieto dva Je potrebné zadať # parametrov. #max_smoothing: # Maximálne vyhladenie vstupného tvarovača, ktoré umožňuje každú os počas tvarovania # automatická kalibrácia (s príkazom 'SHAPER_CALIBRATE'). Štandardne nie # je špecifikované maximálne vyhladenie. Pozrite si príručku Measuring_Resonances # pre ďalšie podrobnosti o používaní tejto funkcie. #min_freq: 5 # Minimálna frekvencia na testovanie rezonancií. Predvolená hodnota je 5 Hz. #max_freq: 133,33 # Maximálna frekvencia na testovanie rezonancií. Predvolená hodnota je 133,33 Hz. #accel_per_hz: 75 # Tento parameter sa používa na určenie, ktoré zrýchlenie sa má použiť # otestujte konkrétnu frekvenciu: accel = accel_per_hz * frekv. Vyššie # hodnota, tým vyššia je energia kmitov. Dá sa nastaviť na # a nižšia ako predvolená hodnota, ak sú rezonancie príliš silné # tlačiareň. Nižšie hodnoty však robia merania # vysokofrekvenčné rezonancie sú menej presné. Predvolená hodnota je 75 # (mm/s). #hz_per_sec: 1 # Určuje rýchlosť testu. Pri testovaní všetkých frekvencií v # rozsah [min_freq, max_freq], každú sekundu sa frekvencia zvyšuje o # hz_per_sec. Malé hodnoty spomaľujú test a veľké hodnoty # zníži presnosť testu. Predvolená hodnota je 1,0 # (Hz/s == s^-2).

source: [smart_effector] pin: # Pin connected to the Smart Effector Z Probe output pin (pin 5). Note that # pullup resistor on the board is generally not required. However, if the # output pin is connected to the board pin with a pullup resistor, that # resistor must be high value (e.g. 10K Ohm or more). Some boards have a low # value pullup resistor on the Z probe input, which will likely result in an # always-triggered probe state. In this case, connect the Smart Effector to # a different pin on the board. This parameter is required. #control_pin: # Pin connected to the Smart Effector control input pin (pin 7). If provided, # Smart Effector sensitivity programming commands become available. #probe_accel: # If set, limits the acceleration of the probing moves (in mm/sec^2). # A sudden large acceleration at the beginning of the probing move may # cause spurious probe triggering, especially if the hotend is heavy. # To prevent that, it may be necessary to reduce the acceleration of # the probing moves via this parameter. #recovery_time: 0.4 # A delay between the travel moves and the probing moves in seconds. A fast # travel move prior to probing may result in a spurious probe triggering. # This may cause 'Probe triggered prior to movement' errors if no delay # is set. Value 0 disables the recovery delay. # Default value is 0.4. #x_offset: #y_offset: # Should be left unset (or set to 0). z_offset: # Trigger height of the probe. Start with -0.1 (mm), and adjust later using # `PROBE_CALIBRATE` command. This parameter must be provided. #speed: # Speed (in mm/s) of the Z axis when probing. It is recommended to start # with the probing speed of 20 mm/s and adjust it as necessary to improve # the accuracy and repeatability of the probe triggering. #samples: #sample_retract_dist: #samples_result: #samples_tolerance: #samples_tolerance_retries: #activate_gcode: #deactivate_gcode: #deactivate_on_each_sample: # See the "probe" section for more information on the parameters above.
sk: [smart_effector] pripnúť: # Kolík pripojený k výstupnému kolíku sondy Smart Effector Z (kolík 5). Poznač si to # pullup rezistor na doske sa vo všeobecnosti nevyžaduje. Avšak, ak # výstupný kolík je spojený s kolíkom dosky pullup rezistorom, že # rezistor musí mať vysokú hodnotu (napr. 10 kOhm alebo viac). Niektoré dosky majú nízku # hodnota pullup rezistora na vstupe sondy Z, čo pravdepodobne povedie k an # stav vždy spustenej sondy. V tomto prípade pripojte Smart Effector k # iný špendlík na nástenke. Tento parameter je povinný. #control_pin: # Kolík pripojený k riadiacemu vstupnému kolíku Smart Effector (kolík 7). Ak je poskytnuté, # Sprístupnia sa príkazy na programovanie citlivosti Smart Effector. #probe_accel: # Ak je nastavené, obmedzuje zrýchlenie snímacích pohybov (v mm/s^2). # Môže dôjsť k náhlemu veľkému zrýchleniu na začiatku snímacieho pohybu # spôsobiť falošné spustenie sondy, najmä ak je hotend ťažký. # Aby sa tomu zabránilo, môže byť potrebné znížiť zrýchlenie # sonda sa pohybuje cez tento parameter. #recovery_time: 0,4 # Oneskorenie medzi pohybmi pojazdu a pohybom snímania v sekundách. Pôst # pohyb pohybu pred snímaním môže viesť k falošnému spusteniu sondy. # Ak nedochádza k oneskoreniu, môže to spôsobiť chyby „sonda spustená pred pohybom“. # je nastavené. Hodnota 0 deaktivuje oneskorenie obnovy. # Predvolená hodnota je 0,4. #x_offset: #y_offset: # Malo by byť ponechané nenastavené (alebo nastavené na 0). z_offset: # Výška spustenia sondy. Začnite s -0,1 (mm) a upravte neskôr # príkaz `PROBE_CALIBRATE`. Tento parameter je potrebné zadať. #rýchlosť: # Rýchlosť (v mm/s) osi Z pri snímaní. Odporúča sa začať # s rýchlosťou snímania 20 mm/s a podľa potreby ju upravte na zlepšenie # presnosť a opakovateľnosť spúšťania sondy. #vzorky: #sample_retract_dist: #samples_result: #samples_tolerance: #samples_tolerance_retries: #activate_gcode: #deactivate_gcode: #deactivate_on_each_sample: # Ďalšie informácie o vyššie uvedených parametroch nájdete v časti „sonda“.

source: Note that the [linux mcu](RPi_microcontroller.md) implementation does not currently support directly connected neopixels. The current design using the Linux kernel interface does not allow this scenario because the kernel GPIO interface is not fast enough to provide the required pulse rates.
sk: Všimnite si, že implementácia [linux mcu](RPi_microcontroller.md) momentálne nepodporuje priamo pripojené neopixely. Súčasný dizajn využívajúci rozhranie linuxového jadra tento scenár neumožňuje, pretože rozhranie GPIO jadra nie je dostatočne rýchle na to, aby poskytovalo požadované pulzové frekvencie.

source: [neopixel my_neopixel] pin: # The pin connected to the neopixel. This parameter must be # provided. #chain_count: # The number of Neopixel chips that are "daisy chained" to the # provided pin. The default is 1 (which indicates only a single # Neopixel is connected to the pin). #color_order: GRB # Set the pixel order required by the LED hardware (using a string # containing the letters R, G, B, W with W optional). Alternatively, # this may be a comma separated list of pixel orders - one for each # LED in the chain. The default is GRB. #initial_RED: 0.0 #initial_GREEN: 0.0 #initial_BLUE: 0.0 #initial_WHITE: 0.0 # See the "led" section for information on these parameters.
sk: [neopixel my_neopixel] pripnúť: # Kolík pripojený k neopixelu. Tento parameter musí byť # poskytnuté. #chain_count: # Počet čipov Neopixel, ktoré sú „daisy chained“ k # poskytnutý pin. Predvolená hodnota je 1 (čo znamená iba jeden # Neopixel je pripojený ku kolíku). #color_order: GRB # Nastavte poradie pixelov požadované hardvérom LED (pomocou reťazca # obsahujúce písmená R, G, B, W s W voliteľné). prípadne # toto môže byť čiarkami oddelený zoznam poradí pixelov – jeden pre každý # LED v reťazci. Predvolená hodnota je GRB. #initial_RED: 0,0 #initial_GREEN: 0,0 #initial_BLUE: 0,0 #initial_WHITE: 0,0 # Informácie o týchto parametroch nájdete v časti „LED“.

source: [safe_z_home] home_xy_position: # A X, Y coordinate (e.g. 100, 100) where the Z homing should be # performed. This parameter must be provided. #speed: 50.0 # Speed at which the toolhead is moved to the safe Z home # coordinate. The default is 50 mm/s #z_hop: # Distance (in mm) to lift the Z axis prior to homing. This is # applied to any homing command, even if it doesn't home the Z axis. # If the Z axis is already homed and the current Z position is less # than z_hop, then this will lift the head to a height of z_hop. If # the Z axis is not already homed the head is lifted by z_hop. # The default is to not implement Z hop. #z_hop_speed: 15.0 # Speed (in mm/s) at which the Z axis is lifted prior to homing. The # default is 15 mm/s. #move_to_previous: False # When set to True, the X and Y axes are reset to their previous # positions after Z axis homing. The default is False.
sk: [safe_z_home] home_xy_position: # A X, Y súradnica (napr. 100, 100), kde by malo byť navádzanie Z # vykonané. Tento parameter je potrebné zadať. #rýchlosť: 50,0 # Rýchlosť, ktorou sa hlava nástroja presunie do bezpečného Z domova # súradnica. Predvolená hodnota je 50 mm/s #z_hop: # Vzdialenosť (v mm) na zdvihnutie osi Z pred navádzaním. Toto je # sa použije na ľubovoľný príkaz navádzania, aj keď nevracia os Z. # Ak je os Z už nastavená a aktuálna poloha Z je menšia # než z_hop, potom to zdvihne hlavu do výšky z_hop. Ak # os Z ešte nie je nasmerovaná, hlava je zdvihnutá pomocou z_hop. # Predvolená hodnota je neimplementovať Z hop. #z_hop_speed: 15.0 # Rýchlosť (v mm/s), ktorou sa zdvíha os Z pred navádzaním. The # predvolená hodnota je 15 mm/s. #move_to_previous: Nepravda # Pri nastavení na hodnotu True sa osi X a Y obnovia na predchádzajúce # pozícií po navádzaní osi Z. Predvolená hodnota je False.

source: Enables support to exclude or cancel individual objects during the printing process.
sk: Umožňuje podporu na vylúčenie alebo zrušenie jednotlivých objektov počas procesu tlače.

source: See the [exclude objects guide](Exclude_Object.md) and [command reference](G-Codes.md#excludeobject) for additional information. See the [sample-macros.cfg](../config/sample-macros.cfg) file for a Marlin/RepRapFirmware compatible M486 G-Code macro.
sk: Ďalšie informácie nájdete v [príručke k vylúčeniu objektov](Exclude_Object.md) a [referencia príkazu](G-Codes.md#excludeobject). Makro M486 G-Code kompatibilné s Marlin/RepRapFirmware nájdete v súbore [sample-macros.cfg](../config/sample-macros.cfg).

source: Klipper includes definitions for many types of temperature sensors. These sensors may be used in any config section that requires a temperature sensor (such as an `[extruder]` or `[heater_bed]` section).
sk: Klipper obsahuje definície pre mnoho typov snímačov teploty. Tieto senzory je možné použiť v akejkoľvek konfiguračnej sekcii, ktorá vyžaduje teplotný senzor (ako je sekcia `[extruder]` alebo `[heater_bed]`).

source: [printer] kinematics: # The type of printer in use. This option may be one of: cartesian, # corexy, corexz, hybrid_corexy, hybrid_corexz, rotary_delta, delta, # deltesian, polar, winch, or none. This parameter must be specified. max_velocity: # Maximum velocity (in mm/s) of the toolhead (relative to the # print). This parameter must be specified. max_accel: # Maximum acceleration (in mm/s^2) of the toolhead (relative to the # print). This parameter must be specified. #max_accel_to_decel: # A pseudo acceleration (in mm/s^2) controlling how fast the # toolhead may go from acceleration to deceleration. It is used to # reduce the top speed of short zig-zag moves (and thus reduce # printer vibration from these moves). The default is half of # max_accel. #square_corner_velocity: 5.0 # The maximum velocity (in mm/s) that the toolhead may travel a 90 # degree corner at. A non-zero value can reduce changes in extruder # flow rates by enabling instantaneous velocity changes of the # toolhead during cornering. This value configures the internal # centripetal velocity cornering algorithm; corners with angles # larger than 90 degrees will have a higher cornering velocity while # corners with angles less than 90 degrees will have a lower # cornering velocity. If this is set to zero then the toolhead will # decelerate to zero at each corner. The default is 5mm/s.
sk: [tlačiareň] kinematika: # Typ používanej tlačiarne. Táto možnosť môže byť jedna z: karteziánskej, # corexy, corexz, hybrid_corexy, hybrid_corexz, rotary_delta, delta, # deltézsky, polárny, navijak alebo žiadny. Tento parameter musí byť špecifikovaný. max_velocity: # Maximálna rýchlosť (v mm/s) nástrojovej hlavy (vo vzťahu k #tlač). Tento parameter musí byť špecifikovaný. max_accel: # Maximálne zrýchlenie (v mm/s^2) nástrojovej hlavy (vo vzťahu k #tlač). Tento parameter musí byť špecifikovaný. #max_accel_to_decel: # Pseudo zrýchlenie (v mm/s^2), ktoré riadi rýchlosť # nástrojová hlava môže prejsť zo zrýchlenia na spomalenie. Je zvyknutý # znížiť maximálnu rýchlosť krátkych cik-cak pohybov (a tým znížiť # vibrácie tlačiarne z týchto pohybov). Predvolená hodnota je polovica # max_accel. #square_corner_velocity: 5,0 # Maximálna rýchlosť (v mm/s), ktorou môže nástrojová hlava prejsť 90 # stupeň roh pri. Nenulová hodnota môže znížiť zmeny v extrudéri # prietokov povolením okamžitých zmien rýchlosti # nástrojová hlava počas zatáčania. Táto hodnota konfiguruje interné # algoritmus dostredivej rýchlosti zatáčania; rohy s uhlami # väčší ako 90 stupňov bude mať vyššiu rýchlosť v zákrute # rohy s uhlami menšími ako 90 stupňov budú mať nižšie # rýchlosť v zákrute. Ak je toto nastavené na nulu, nástrojová hlava bude # spomalenie na nulu v každom rohu. Predvolená hodnota je 5 mm/s.

source: Deltesian Kinematics
sk: Deltézska kinematika
