Repository: fran6p/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Delta_Calibrate.po
Languages: ru

source: This document describes Klipper's automatic calibration system for "delta" style printers.
ru: В этом документе описывается система автоматической калибровки Klipper для принтеров типа "delta".

source: Delta calibration involves finding the tower endstop positions, tower angles, delta radius, and delta arm lengths. These settings control printer motion on a delta printer. Each one of these parameters has a non-obvious and non-linear impact and it is difficult to calibrate them manually. In contrast, the software calibration code can provide excellent results with just a few minutes of time. No special probing hardware is necessary.
ru: Дельта-калибровка включает в себя определение положений концевых упоров башни, углов башни, дельта-радиуса и длины дельта-рычагов. Эти настройки управляют перемещением принтера на принтере delta. Каждый из этих параметров оказывает неочевидное и нелинейное влияние, и их трудно откалибровать вручную. Напротив, программный код калибровки может обеспечить отличные результаты всего за несколько минут. Никакого специального зондирующего оборудования не требуется.

source: Ultimately, the delta calibration is dependent on the precision of the tower endstop switches. If one is using Trinamic stepper motor drivers then consider enabling [endstop phase](Endstop_Phase.md) detection to improve the accuracy of those switches.
ru: В конечном счете, дельта-калибровка зависит от точности концевых выключателей башни. Если вы используете драйверы шаговых двигателей Trinamic, то рассмотрите возможность включения [endstop phase](Endstop_Phase.md) обнаружения для повышения точности этих переключателей.

source: Automatic vs manual probing
ru: Автоматическое и ручное зондирование

source: Klipper supports calibrating the delta parameters via a manual probing method or via an automatic Z probe.
ru: Klipper поддерживает калибровку дельта-параметров с помощью ручного метода измерения или с помощью автоматического Z-зонда.

source: A number of delta printer kits come with automatic Z probes that are not sufficiently accurate (specifically, small differences in arm length can cause effector tilt which can skew an automatic probe). If using an automatic probe then first [calibrate the probe](Probe_Calibrate.md) and then check for a [probe location bias](Probe_Calibrate.md#location-bias-check). If the automatic probe has a bias of more than 25 microns (.025mm) then use manual probing instead. Manual probing only takes a few minutes and it eliminates error introduced by the probe.
ru: Некоторые комплекты дельта-принтеров поставляются с автоматическими Z-зондами, которые не обладают достаточной точностью (в частности, небольшая разница в длине может вызвать наклон эффектора, что может исказить показания автоматического датчика). Если используется автоматический датчик, то сначала необходимо откалибровать датчик [calibrate the probe](Probe_Calibrate.md), а затем проверить смещение положения датчика [probe location bias](Probe_Calibrate.md#location-bias-check). Если смещение автоматического датчика превышает 25 микрон (.025 мм), то вместо этого используйте ручное зондирование. Ручное зондирование занимает всего несколько минут и устраняет погрешность, вносимую зондом.

source: If using a probe that is mounted on the side of the hotend (that is, it has an X or Y offset) then note that performing delta calibration will invalidate the results of probe calibration. These types of probes are rarely suitable for use on a delta (because minor effector tilt will result in a probe location bias). If using the probe anyway, then be sure to rerun probe calibration after any delta calibration.
ru: Если используется датчик, установленный сбоку от хотэнда (т.е. имеющий смещение по оси X или Y), то следует учитывать, что при выполнении дельта-калибровки результаты калибровки датчика будут недействительными. Такие датчики редко подходят для дельта-калибровки (поскольку незначительный наклон эффектора приведет к смещению положения датчика). Если датчик все же используется, то после выполнения дельта-калибровки обязательно выполните повторную калибровку датчика.

source: Basic delta calibration
ru: Базовая дельта-калибровка

source: Klipper has a DELTA_CALIBRATE command that can perform basic delta calibration. This command probes seven different points on the bed and calculates new values for the tower angles, tower endstops, and delta radius.
ru: В Klipper есть команда DELTA_CALIBRATE, которая может выполнять базовую дельта-калибровку. Эта команда исследует семь различных точек на станине и вычисляет новые значения для углов башни, торцевых поверхностей башни и радиуса дельты.

source: In order to perform this calibration the initial delta parameters (arm lengths, radius, and endstop positions) must be provided and they should have an accuracy to within a few millimeters. Most delta printer kits will provide these parameters - configure the printer with these initial defaults and then go on to run the DELTA_CALIBRATE command as described below. If no defaults are available then search online for a delta calibration guide that can provide a basic starting point.
ru: Для выполнения этой калибровки необходимо указать начальные дельта-параметры (длины рычагов, радиус и положения конечных упоров), и они должны иметь точность с точностью до нескольких миллиметров. Большинство комплектов принтеров delta предоставляют эти параметры - настройте принтер с этими начальными значениями по умолчанию, а затем выполните команду DELTA_CALIBRATE, как описано ниже. Если значения по умолчанию недоступны, найдите в Интернете руководство по дельта-калибровке, которое может послужить базовой отправной точкой.

source: During the delta calibration process it may be necessary for the printer to probe below what would otherwise be considered the plane of the bed. It is typical to permit this during calibration by updating the config so that the printer's `minimum_z_position=-5`. (Once calibration completes, one can remove this setting from the config.)
ru: В процессе дельта-калибровки принтеру может потребоваться провести зондирование ниже того, что в противном случае считалось бы плоскостью подложки. Обычно это разрешается во время калибровки путем обновления конфигурации таким образом, чтобы `minimum_z_position принтера=-5`. (После завершения калибровки можно удалить эту настройку из конфигурации.)

source: There are two ways to perform the probing - manual probing (`DELTA_CALIBRATE METHOD=manual`) and automatic probing (`DELTA_CALIBRATE`). The manual probing method will move the head near the bed and then wait for the user to follow the steps described at ["the paper test"](Bed_Level.md#the-paper-test) to determine the actual distance between the nozzle and bed at the given location.
ru: Существует два способа выполнения зондирования - ручное зондирование (`DELTA_CALIBRATE METHOD=manual`) и автоматическое зондирование (`DELTA_CALIBRATE`). Метод ручного зондирования позволяет приблизить головку к подложке, а затем дождаться, пока пользователь выполнит шаги, описанные в ["тест бумаги"](Bed_Level.md#the-paper-test), чтобы определить фактическое расстояние между насадкой и подложкой в заданном месте.

source: To perform the basic probe, make sure the config has a [delta_calibrate] section defined and then run the tool:
ru: Чтобы выполнить базовую проверку, убедитесь, что в конфигурации определен раздел [delta_calibrate], а затем запустите инструмент:

source: After probing the seven points new delta parameters will be calculated. Save and apply these parameters by running:
ru: После зондирования семи точек будут рассчитаны новые дельта-параметры. Сохраните и примените эти параметры, выполнив:

source: The basic calibration should provide delta parameters that are accurate enough for basic printing. If this is a new printer, this is a good time to print some basic objects and verify general functionality.
ru: Базовая калибровка должна обеспечивать дельта-параметры, достаточные для базовой печати. Если это новый принтер, сейчас самое подходящее время напечатать некоторые базовые объекты и проверить общую функциональность.

source: Enhanced delta calibration
ru: Улучшенная дельта-калибровка

source: The basic delta calibration generally does a good job of calculating delta parameters such that the nozzle is the correct distance from the bed. However, it does not attempt to calibrate X and Y dimensional accuracy. It's a good idea to perform an enhanced delta calibration to verify dimensional accuracy.
ru: Базовая дельта-калибровка, как правило, хорошо справляется с вычислением дельта-параметров таким образом, чтобы сопло находилось на правильном расстоянии от слоя. Однако он не пытается откалибровать точность размеров X и Y. Рекомендуется выполнить расширенную дельта-калибровку для проверки точности размеров.

source: This calibration procedure requires printing a test object and measuring parts of that test object with digital calipers.
ru: Эта процедура калибровки требует распечатки тестируемого объекта и измерения частей этого тестируемого объекта цифровыми штангенциркулями.

source: Use a slicer to generate G-Code from the [docs/prints/calibrate_size.stl](prints/calibrate_size.stl) file. Slice the object using a slow speed (eg, 40mm/s). If possible, use a stiff plastic (such as PLA) for the object. The object has a diameter of 140mm. If this is too large for the printer then one can scale it down (but be sure to uniformly scale both the X and Y axes). If the printer supports significantly larger prints then this object can also be increased in size. A larger size can improve the measurement accuracy, but good print adhesion is more important than a larger print size.
ru: Используйте слайсер для генерации G-кода из файла [docs/prints/calibrate_size.style](prints/calibrate_size.stl). Нарежьте объект, используя медленную скорость (например, 40 мм/с). Если возможно, используйте для этого предмета жесткий пластик (например, PLA). Объект имеет диаметр 140 мм. Если он слишком велик для принтера, то можно уменьшить его масштаб (но обязательно равномерно масштабируйте обе оси X и Y). Если принтер поддерживает печать значительно большего размера, то этот объект также можно увеличить в размере. Больший размер может повысить точность измерений, но хорошая адгезия к отпечатку важнее, чем больший размер отпечатка.

source: Print the test object and wait for it to fully cool. The commands described below must be run with the same printer settings used to print the calibration object (don't run DELTA_CALIBRATE between printing and measuring, or do something that would otherwise change the printer configuration).
ru: Распечатайте тестовый объект и подождите, пока он полностью остынет. Команды, описанные ниже, должны выполняться с теми же настройками принтера, которые использовались для печати объекта калибровки (не запускайте DELTA_CALIBRATE между печатью и измерением и не делайте ничего, что в противном случае изменило бы конфигурацию принтера).

source: If possible, perform the measurements described below while the object is still attached to the print bed, but don't worry if the part detaches from the bed - just try to avoid bending the object when performing the measurements.
ru: Если возможно, выполните измерения, описанные ниже, пока объект все еще прикреплен к подложке для печати, но не волнуйтесь, если деталь отсоединится от подложки - просто старайтесь избегать изгиба объекта при выполнении измерений.

source: Start by measuring the distance between the center pillar and the pillar next to the "A" label (which should also be pointing towards the "A" tower).
ru: Начните с измерения расстояния между центральной стойкой и стойкой рядом с надписью "А" (которая также должна быть направлена в сторону башни "А").

source: ![delta-a-distance](img/delta-a-distance.jpg)
ru: ![дельта-расстояние](img/delta-a-distance.jpg )

source: Then go counterclockwise and measure the distances between the center pillar and the other pillars (distance from center to pillar across from C label, distance from center to pillar with B label, etc.).
ru: Затем поверните против часовой стрелки и измерьте расстояния между центральной стойкой и другими стойками (расстояние от центра до стойки напротив метки C, расстояние от центра до стойки с меткой B и т.д.).

source: Enter these parameters into Klipper with a comma separated list of floating point numbers:
ru: Введите эти параметры в Klipper со списком чисел с плавающей запятой, разделенных запятыми:

source: Provide the values without spaces between them.
ru: Укажите значения без пробелов между ними.

source: Then measure the distance between the A pillar and the pillar across from the C label.
ru: Затем измерьте расстояние между стойкой A и стойкой напротив метки C.

source: ![delta-ab-distance](img/delta-outer-distance.jpg)
ru: ![дельта-ав-расстояние](img/delta-outer-distance.jpg )

source: Then go counterclockwise and measure the distance between the pillar across from C to the B pillar, the distance between the B pillar and the pillar across from A, and so on.
ru: Затем поверните против часовой стрелки и измерьте расстояние между стойкой напротив от C до стойки B, расстояние между стойкой B и стойкой напротив A и так далее.

source: Enter these parameters into Klipper:
ru: Введите эти параметры в Klipper:

source: At this point it is okay to remove the object from the bed. The final measurements are of the pillars themselves. Measure the size of the center pillar along the A spoke, then the B spoke, and then the C spoke.
ru: На этом этапе можно убрать предмет с кровати. Окончательные измерения производятся для самих колонн. Измерьте размер центральной стойки вдоль спицы A, затем спицы B, а затем спицы C.

source: Enter them into Klipper:
ru: Введите их в Klipper:

source: The final measurements are of the outer pillars. Start by measuring the distance of the A pillar along the line from A to the pillar across from C.
ru: Окончательные измерения производятся для внешних опор. Начните с измерения расстояния от столба A по линии от A до столба напротив C.

source: Then go counterclockwise and measure the remaining outer pillars (pillar across from C along the line to B, B pillar along the line to pillar across from A, etc.).
ru: Затем идите против часовой стрелки и измерьте оставшиеся внешние стойки (стойка напротив C вдоль линии до B, стойка B вдоль линии до стойки напротив A и т.д.).

source: And enter them into Klipper:
ru: И введите их в Klipper:

source: If the object was scaled to a smaller or larger size then provide the scale factor that was used when slicing the object:
ru: Если объект был масштабирован до меньшего или большего размера, укажите коэффициент масштабирования, который использовался при нарезке объекта:

source: (A scale value of 2.0 would mean the object is twice its original size, 0.5 would be half its original size.)
ru: (Значение масштаба, равное 2,0, означало бы, что объект в два раза больше своего первоначального размера, 0,5 - это половина его первоначального размера.)

source: Finally, perform the enhanced delta calibration by running:
ru: Наконец, выполните расширенную дельта-калибровку, запустив:

source: This command can take several minutes to complete. After completion it will calculate updated delta parameters (delta radius, tower angles, endstop positions, and arm lengths). Use the SAVE_CONFIG command to save and apply the settings:
ru: Выполнение этой команды может занять несколько минут. После завершения он рассчитает обновленные дельта-параметры (радиус дельты, углы наклона башни, положения концевых упоров и длины рычагов). Используйте команду SAVE_CONFIG, чтобы сохранить и применить настройки:

source: The SAVE_CONFIG command will save both the updated delta parameters and information from the distance measurements. Future DELTA_CALIBRATE commands will also utilize this distance information. Do not attempt to reenter the raw distance measurements after running SAVE_CONFIG, as this command changes the printer configuration and the raw measurements no longer apply.
ru: Команда SAVE_CONFIG сохранит как обновленные дельта-параметры, так и информацию, полученную в результате измерений расстояния. Будущие команды DELTA_CALIBRATE также будут использовать эту информацию о расстоянии. Не пытайтесь повторно ввести необработанные измерения расстояния после запуска SAVE_CONFIG, так как эта команда изменяет конфигурацию принтера и необработанные измерения больше не применяются.

source: Additional notes
ru: Дополнительные примечания

source: If the delta printer has good dimensional accuracy then the distance between any two pillars should be around 74mm and the width of every pillar should be around 9mm. (Specifically, the goal is for the distance between any two pillars minus the width of one of the pillars to be exactly 65mm.) Should there be a dimensional inaccuracy in the part then the DELTA_ANALYZE routine will calculate new delta parameters using both the distance measurements and the previous height measurements from the last DELTA_CALIBRATE command.
ru: Если принтер delta обладает хорошей точностью размеров, то расстояние между любыми двумя стойками должно составлять около 74 мм, а ширина каждой стойки - около 9 мм. (В частности, цель состоит в том, чтобы расстояние между любыми двумя стойками за вычетом ширины одной из стоек составляло ровно 65 мм.) Если в детали имеется неточность в размерах, то процедура DELTA_ANALYZE вычислит новые дельта-параметры, используя как измерения расстояния, так и предыдущие измерения высоты из последней команды DELTA_CALIBRATE.

source: DELTA_ANALYZE may produce delta parameters that are surprising. For example, it may suggest arm lengths that do not match the printer's actual arm lengths. Despite this, testing has shown that DELTA_ANALYZE often produces superior results. It is believed that the calculated delta parameters are able to account for slight errors elsewhere in the hardware. For example, small differences in arm length may result in a tilt to the effector and some of that tilt may be accounted for by adjusting the arm length parameters.
ru: DELTA_ANALYZE может выдавать неожиданные дельта-параметры. Например, в нем может быть указана длина рычагов, которая не соответствует фактической длине рычагов принтера. Несмотря на это, тестирование показало, что DELTA_ANALYZE часто дает превосходные результаты. Считается, что вычисленные дельта-параметры способны учитывать незначительные ошибки в других частях аппаратного обеспечения. Например, небольшие различия в длине руки могут привести к наклону исполнительного устройства, и часть этого наклона может быть учтена путем регулировки параметров длины руки.

source: Using Bed Mesh on a Delta
ru: Использование сетки Bed Mesh в дельте

source: It is possible to use [bed mesh](Bed_Mesh.md) on a delta. However, it is important to obtain good delta calibration prior to enabling a bed mesh. Running bed mesh with poor delta calibration will result in confusing and poor results.
ru: Можно использовать [сетку для кровати](Bed_Mesh.md ) на дельте. Однако важно получить хорошую дельта-калибровку перед включением сетки слоя. Использование сетки слоя с плохой дельта-калибровкой приведет к путанице и плохим результатам.

source: Note that performing delta calibration will invalidate any previously obtained bed mesh. After performing a new delta calibration be sure to rerun BED_MESH_CALIBRATE.
ru: Обратите внимание, что выполнение дельта-калибровки сделает недействительной любую ранее полученную сетку пласта. После выполнения новой дельта-калибровки обязательно повторно запустите BED_MESH_CALIBRATE.

source: G28 DELTA_CALIBRATE METHOD=manual
ru: G28 DELTA_CALIBRATE METHOD=ручной

source: DELTA_ANALYZE SCALE=1.0
ru: ШКАЛА DELTA_ANALYZE=1.0

source: DELTA_ANALYZE CALIBRATE=extended
ru: DELTA_ANALYZE CALIBRATE=расширенный

source: Delta calibration
ru: Дельта-калибровка

source: Prior to running an enhanced delta calibration one must run the basic delta calibration (via the DELTA_CALIBRATE command) and save the results (via the SAVE_CONFIG command). Make sure there hasn't been any notable change to the printer configuration nor hardware since last performing a basic delta calibration (if unsure, rerun the [basic delta calibration](#basic-delta-calibration), including SAVE_CONFIG, just prior to printing the test object described below.)
ru: Перед запуском расширенной дельта калибровки необходимо запустить базовую дельта-калибровку (с помощью команды DELTA_CALIBRATE) и сохранить результаты (с помощью команды SAVE_CONFIG). Убедитесь, что с момента последнего выполнения базовой дельта-калибровки не произошло каких-либо заметных изменений ни в конфигурации принтера, ни в оборудовании (если вы не уверены, повторно запустите [базовую дельта калибровку](#basic-delta-калибровка), включая SAVE_CONFIG, непосредственно перед печатью. тестовый объект, описанный ниже.)
