Repository: fran6p/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Endstop_Phase.po
Languages: pt_br

source: This document describes Klipper's stepper phase adjusted endstop system. This functionality can improve the accuracy of traditional endstop switches. It is most useful when using a Trinamic stepper motor driver that has run-time configuration.
pt_br: Este documento descreve o sistema de fim de curso do Klipper ajustado pela fase do motor de passo. Esta funcionalidade pode melhorar a precisão das chaves de fim de curso tradicionais. É mais útil ao usar um driver de motor de passo Trinamic que possua configuração em tempo de execução.

source: A typical endstop switch has an accuracy of around 100 microns. (Each time an axis is homed the switch may trigger slightly earlier or slightly later.) Although this is a relatively small error, it can result in unwanted artifacts. In particular, this positional deviation may be noticeable when printing the first layer of an object. In contrast, typical stepper motors can obtain significantly higher precision.
pt_br: Uma chave de fim de curso comum tem uma precisão de cerca de 100 microns e cada vez que um eixo é enviado para a posição inicial, a chave pode ser acionada um pouco mais cedo ou um pouco mais tarde. Embora seja um erro relativamente pequeno, pode resultar em artefatos indesejados. Em particular, esse desvio de posição pode ser perceptível ao imprimir a primeira camada de um objeto. Em contraste, os motores de passo comuns podem obter uma precisão significativamente maior.

source: The stepper phase adjusted endstop mechanism can use the precision of the stepper motors to improve the precision of the endstop switches. A stepper motor moves by cycling through a series of phases until in completes four "full steps". So, a stepper motor using 16 micro-steps would have 64 phases and when moving in a positive direction it would cycle through phases: 0, 1, 2, ... 61, 62, 63, 0, 1, 2, etc. Crucially, when the stepper motor is at a particular position on a linear rail it should always be at the same stepper phase. Thus, when a carriage triggers the endstop switch the stepper controlling that carriage should always be at the same stepper motor phase. Klipper's endstop phase system combines the stepper phase with the endstop trigger to improve the accuracy of the endstop.
pt_br: O mecanismo de fim de curso ajustado pela fase do motor de passo pode usar a precisão dos motores de passo para melhorar a precisão das chaves de fim de curso. Um motor de passo se move passando por uma série de fases até que complete quatro "passos completos". Assim, um motor de passo com 16 micro-passos teria 64 fases e, ao se mover em uma direção positiva, passaria pelas fases: 0, 1, 2, ... 61, 62, 63, 0, 1, 2, etc. Importante, quando o motor de passo posicionar um trilho linear em um ponto específico, a fase do motor deverá ser sempre o mesma. Assim, quando um carrinho acionar a chave de fim de curso, o motor que controla esse carrinho sempre deverá estar na mesma fase. O sistema de fase de fim de curso (endstop phase) do Klipper combina a fase do motor de passo com o acionamento da chave para melhorar a precisão do fim de curso.

source: In order to use this functionality it is necessary to be able to identify the phase of the stepper motor. If one is using Trinamic TMC2130, TMC2208, TMC2224 or TMC2660 drivers in run-time configuration mode (ie, not stand-alone mode) then Klipper can query the stepper phase from the driver. (It is also possible to use this system on traditional stepper drivers if one can reliably reset the stepper drivers - see below for details.)
pt_br: Para usar esta funcionalidade, é necessário poder identificar a fase do motor de passo. Se você estiver usando os drivers Trinamic TMC2130, TMC2208, TMC2209, TMC2224 ou TMC2660 no modo de configuração em tempo de execução (ou seja, não no modo "stand-alone"), então o Klipper poderá consultar a fase do motor de passo a partir do driver. (Também é possível usar este sistema com drivers de motor de passo tradicionais se for possível reiniciar os drivers de forma confiável - veja abaixo para mais detalhes.)

source: Calibrating endstop phases
pt_br: Calibrando fases de fim e curso (endstop phases)

source: If using Trinamic stepper motor drivers with run-time configuration then one can calibrate the endstop phases using the ENDSTOP_PHASE_CALIBRATE command. Start by adding the following to the config file:
pt_br: Se estiver usando drivers da Trinamic com configuração em tempo de execução, então você pode calibrar as fases de fim de curso usando o comando ENDSTOP_PHASE_CALIBRATE. Comece adicionando o seguinte ao arquivo de configuração:

source: Then RESTART the printer and run a `G28` command followed by an `ENDSTOP_PHASE_CALIBRATE` command. Then move the toolhead to a new location and run `G28` again. Try moving the toolhead to several different locations and rerun `G28` from each position. Run at least five `G28` commands.
pt_br: Então REINICIE a impressora e execute um comando `G28` seguido do comando `ENDSTOP_PHASE_CALIBRATE`. Em seguida, mova a cabeça de impressão para um novo local e execute `G28` novamente. Tente mover a cabeça de impressão para várias posições diferentes executando o comando `G28` em seguida. Execute pelo menos cinco vezes o comando `G28`.

source: After performing the above, the `ENDSTOP_PHASE_CALIBRATE` command will often report the same (or nearly the same) phase for the stepper. This phase can be saved in the config file so that all future G28 commands use that phase. (So, in future homing operations, Klipper will obtain the same position even if the endstop triggers a little earlier or a little later.)
pt_br: Depois de realizar o procedimento acima, o comando `ENDSTOP_PHASE_CALIBRATE` frequentemente reportará a mesma (ou quase a mesma) fase para o motor de passo. Esta fase pode ser salva no arquivo de configuração para que todos os futuros comandos `G28` usem essa fase. (Então, em futuras operações de referenciamento (homing), o Klipper obterá a mesma posição mesmo que a chave de fim de curso seja acionado um pouco mais cedo ou um pouco mais tarde.)

source: To save the endstop phase for a particular stepper motor, run something like the following:
pt_br: Para salvar a fase de fim de curso para um motor de passo específico, execute algo como em seguida:

source: Run the above for all the steppers one wishes to save. Typically, one would use this on stepper_z for cartesian and corexy printers, and for stepper_a, stepper_b, and stepper_c on delta printers. Finally, run the following to update the configuration file with the data:
pt_br: Execute o comando acima para todos os motores de passo que você deseja salvar. Normalmente, você usaria stepper_x, stepper_y e stepper_z em impressoras cartesianas e corexy, e stepper_a, stepper_b e stepper_c em impressoras delta. Finalmente, execute o seguinte comando para atualizar o arquivo de configuração com os dados:

source: Additional notes
pt_br: Notas adicionais

source: This feature is most useful on delta printers and on the Z endstop of cartesian/corexy printers. It is possible to use this feature on the XY endstops of cartesian printers, but that isn't particularly useful as a minor error in X/Y endstop position is unlikely to impact print quality. It is not valid to use this feature on the XY endstops of corexy printers (as the XY position is not determined by a single stepper on corexy kinematics). It is not valid to use this feature on a printer using a "probe:z_virtual_endstop" Z endstop (as the stepper phase is only stable if the endstop is at a static location on a rail).
pt_br: Este recurso é mais útil em impressoras delta e no fim de curso Z de impressoras cartesianas/corexy. É possível usar este recurso nos fins de curso X/Y de impressoras cartesianas, mas isso não é particularmente útil, pois um pequeno erro na posição do fim de curso X/Y é pouco provável que afete a qualidade da impressão. Não é válido usar este recurso nos fins de curso X/Y de impressoras corexy (já que a posição XY não é determinada por um único motor de passo na cinemática corexy). Não é válido usar este recurso em uma impressora que usa um fim de curso Z "probe:z_virtual_endstop" (pois a fase do motor de passo só é estável se o fim de curso estiver em um local estático em um trilho).

source: After calibrating the endstop phase, if the endstop is later moved or adjusted then it will be necessary to recalibrate the endstop. Remove the calibration data from the config file and rerun the steps above.
pt_br: Após calibrar a fase do fim de curso, se o fim de curso for posteriormente movido ou ajustado, será necessário recalibrar o fim de curso. Remova os dados de calibração do arquivo de configuração e repita as etapas acima.

source: In order to use this system the endstop must be accurate enough to identify the stepper position within two "full steps". So, for example, if a stepper is using 16 micro-steps with a step distance of 0.005mm then the endstop must have an accuracy of at least 0.160mm. If one gets "Endstop stepper_z incorrect phase" type error messages than in may be due to an endstop that is not sufficiently accurate. If recalibration does not help then disable endstop phase adjustments by removing them from the config file.
pt_br: Para usar este sistema, o fim de curso deve ser preciso o suficiente para identificar a posição do motor de passo dentro de dois "passos completos". Então, por exemplo, se um motor de passo estiver usando 16 micro-passos com uma distância de passo de 0,005mm, então o fim de curso deve ter uma precisão de pelo menos 0,160mm. Se você receber mensagens de erro do tipo "Endstop stepper_z incorrect phase" ("Fim de curso stepper_z fase incorreta") pode ser devido a um fim de curso que não é suficientemente preciso. Se a recalibração não ajudar, então desative os ajustes de fase do fim de curso removendo-os do arquivo de configuração.

source: If one is using a traditional stepper controlled Z axis (as on a cartesian or corexy printer) along with traditional bed leveling screws then it is also possible to use this system to arrange for each print layer to be performed on a "full step" boundary. To enable this feature be sure the G-Code slicer is configured with a layer height that is a multiple of a "full step", manually enable the endstop_align_zero option in the endstop_phase config section (see [config reference](Config_Reference.md#endstop_phase) for further details), and then re-level the bed screws.
pt_br: Se você estiver usando um eixo Z controlado por motor de passo comum (como em uma impressora cartesiana ou corexy) juntamente com parafusos comuns de nivelamento de cama, então também é possível usar este sistema de modo que cada camada da impressão seja realizada em um limite de "passo completo". Para habilitar este recurso, certifique-se de que o slicer de G-Code está configurado com uma altura de camada que seja um múltiplo de um "passo completo", habilite manualmente a opção `endstop_align_zero` na seção de configuração `endstop_phase` (veja a [referência de configuração](Config_Reference.md#endstop_phase) para mais detalhes), e então re-nivele os parafusos da cama.

source: It is possible to use this system with traditional (non-Trinamic) stepper motor drivers. However, doing this requires making sure that the stepper motor drivers are reset every time the micro-controller is reset. (If the two are always reset together then Klipper can determine the stepper phase by tracking the total number of steps it has commanded the stepper to move.) Currently, the only way to do this reliably is if both the micro-controller and stepper motor drivers are powered solely from USB and that USB power is provided from a host running on a Raspberry Pi. In this situation one can specify an mcu config with "restart_method: rpi_usb" - that option will arrange for the micro-controller to always be reset via a USB power reset, which would arrange for both the micro-controller and stepper motor drivers to be reset together. If using this mechanism, one would then need to manually configure the "trigger_phase" config sections (see [config reference](Config_Reference.md#endstop_phase) for the details).
pt_br: É possível usar este sistema com drivers de motor de passo tradicionais (não-Trinamic). No entanto, fazer isso necessário que se garanta que os drivers do motor de passo sejam reiniciados sempre que o microcontrolador é reiniciado. (Se os dois sempre forem reiniciados juntos, então o Klipper poderá determinar a fase do motor de passo rastreando o número total de passos que ele ordenou que o motor de passo se mova.) Atualmente, a única maneira de fazer isso de forma confiável é se tanto o microcontrolador quanto os drivers do motor de passo são alimentados apenas por USB e que essa energia USB seja fornecida por um host rodando em um Raspberry Pi. Nesta situação, você pode especificar uma configuração de mcu com "restart_method: rpi_usb" - essa opção irá fazer com que o microcontrolador sempre seja reiniciado por meio de uma reinicialização de energia USB, que faria que tanto o microcontrolador quanto os drivers do motor de passo sejam reiniciados juntos. Se estiver usando este mecanismo, você precisará configurar manualmente as seções de configuração "trigger_phase" (consulte a [referência de configuração](Config_Reference.md#endstop_phase) para mais detalhes).

source: Endstop phase
pt_br: Fase de fim de curso
