Repository: fran6p/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Example_Configs.po
Languages: nl

source: This document contains guidelines for contributing an example Klipper configuration to the Klipper github repository (located in the [config directory](../config/)).
nl: Dit document bevat richtlijnen voor het toevoegen van een voorbeeld van een Klipper-configuratie aan de Klipper github-repository (te vinden in de [configuratiefolder](../config/)).

source: Note that the [Klipper Community Discourse server](https://community.klipper3d.org) is also a useful resource for finding and sharing config files.
nl: Merk op dat de [Klipper Community Discourse server](https://community.klipper3d.org) ook een nuttige bron is voor het vinden en delen van configuratiebestanden.

source: Guidelines
nl: Richtlijnen

source: The `generic` prefix is used for a 3d printer board that may be used in many different types of printers.
nl: Het voorvoegsel `generic` wordt gebruikt voor een 3D-printerkaart die in veel verschillende soorten printers kan worden gebruikt.

source: The `kit` prefix is for 3d printers that are assembled according to a widely used specification. These "kit" printers are generally distinct from normal "printers" in that they are not sold by a manufacturer.
nl: Het voorvoegsel `kit` is voor 3D-printers die zijn samengesteld volgens een veelgebruikte specificatie. Deze "kit"-printers onderscheiden zich over het algemeen van normale "printers" doordat ze niet door een fabrikant worden verkocht.

source: The `sample` prefix is used for config "snippets" that one may copy-and-paste into the main config file.
nl: Het voorvoegsel `sample` wordt gebruikt voor configuratie-"fragmenten" (snippets) die men kan kopiëren en plakken in het hoofdconfiguratiebestand.

source: The `example` prefix is used to describe printer kinematics. This type of config is typically only added along with code for a new type of printer kinematics.
nl: Het voorvoegsel `example` wordt gebruikt om de kinematica van de printer te beschrijven. Dit type configuratie wordt meestal alleen toegevoegd samen met code voor een nieuw type printerkinematica.

source: Klipper must be able to start `printer`, `generic`, and `kit` example config file without error. These config files should be added to the [test/klippy/printers.test](../test/klippy/printers.test) regression test case. Add new config files to that test case in the appropriate section and in alphabetical order within that section.
nl: Klipper moet het configuratiebestand `printer`, `generiek` en `kit` zonder fouten kunnen starten. Deze configuratiebestanden moeten worden toegevoegd aan de [test/klippy/printers.test](../test/klippy/printers.test) regressietestcase. Voeg nieuwe configuratiebestanden toe aan die testcase in de juiste sectie en in alfabetische volgorde binnen die sectie.

source: The example configuration should be for the "stock" configuration of the printer. (There are too many "customized" configurations to track in the main Klipper repository.) Similarly, we only add example config files for printers, kits, and boards that have mainstream popularity (eg, there should be at least a 100 of them in active use). Consider using the [Klipper Community Discourse server](https://community.klipper3d.org) for other configs.
nl: De voorbeeldconfiguratie moet voor de "generieke" -configuratie van de printer zijn. (Er zijn te veel "aangepaste" configuraties om bij te houden in de hoofdrepository van Klipper.) Evenzo voegen we alleen voorbeeldconfiguratiebestanden toe voor printers, kits en boards die algemeen populair zijn (er zouden er bijvoorbeeld minstens 100 moeten zijn in actief gebruik). Overweeg om de [Klipper Community Discourse server](https://community.klipper3d.org) te gebruiken voor andere configuraties.

source: Only specify those devices present on the given printer or board. Do not specify settings specific to your particular setup.For `generic` config files, only those devices on the mainboard should be described. For example, it would not make sense to add a display config section to a "generic" config as there is no way to know if the board will be attached to that type of display. If the board has a specific hardware port to facilitate an optional peripheral (eg, a bltouch port) then one can add a "commented out" config section for the given device.
nl: Geef alleen de apparaten op die op de betreffende printer of kaart aanwezig zijn. Specificeer geen instellingen die specifiek zijn voor uw specifieke setup. Voor `algemene` configuratiebestanden moeten alleen die apparaten op het moederbord worden beschreven. Het zou bijvoorbeeld geen zin hebben om een schermconfiguratiesectie toe te voegen aan een "algemene" configuratie, aangezien er geen manier is om te weten of het bord aan dat type scherm zal worden gekoppeld. Als het bord een specifieke hardwarepoort heeft om een optioneel randapparaat mogelijk te maken (bijv. een bltouch-poort), dan kan men een "uitgecommentarieerde" configuratiesectie voor het gegeven apparaat toevoegen.

source: Do not specify `pressure_advance` in an example config, as that value is specific to the filament, not the printer hardware. Similarly, do not specify `max_extrude_only_velocity` nor `max_extrude_only_accel` settings.
nl: Specificeer `pressure_advance` niet in een voorbeeldconfiguratie, aangezien die waarde specifiek is voor het filament, niet voor de printerhardware. Geef op dezelfde manier geen `max_extrude_only_velocity`- of `max_extrude_only_accel`-instellingen op.

source: Do not specify a config section containing a host path or host hardware. For example, do not specify `[virtual_sdcard]` nor `[temperature_host]` config sections.
nl: Geef geen configuratiesectie op die een hostpad of hosthardware bevat. Geef bijvoorbeeld geen `[virtual_sdcard]` of `[temperature_host]` configuratiesecties op.

source: Only define macros that utilize functionality specific to the given printer or to define g-codes that are commonly emitted by slicers configured for the given printer.
nl: Definieer alleen macro's die functionaliteit gebruiken die specifiek is voor de bepaalde printer of om g-codes te definiëren die gewoonlijk worden ingevoegd door slicers die voor de bepaalde printer zijn geconfigureerd.

source: Where possible, it is best to use the same wording, phrasing, indentation, and section ordering as the existing config files.The top of each config file should list the type of micro-controller the user should select during "make menuconfig". It should also have a reference to "docs/Config_Reference.md".
nl: Waar mogelijk is het het beste om dezelfde formulering, frasering, inspringing en volgorde van secties te gebruiken als de bestaande configuratiebestanden. Bovenaan elk configuratiebestand moet het type microcontroller worden vermeld dat de gebruiker moet selecteren tijdens "make menuconfig". Het zou ook een verwijzing naar "docs/Config_Reference.md" moeten hebben.

source: Do not copy the field documentation into the example config files. (Doing so creates a maintenance burden as an update to the documentation would then require changing it in many places.)
nl: Kopieer de velddocumentatie niet naar de voorbeeldconfiguratiebestanden. (Als u dit wel doet, ontstaat er een onderhoudslast, aangezien een update van de documentatie deze dan op veel plaatsen zou moeten wijzigen.)

source: Example config files should not contain a "SAVE_CONFIG" section. If necessary, copy the relevant fields from the SAVE_CONFIG section to the appropriate section in the main config area.
nl: Voorbeeldconfiguratiebestanden mogen geen "SAVE_CONFIG"-sectie bevatten. Kopieer indien nodig de relevante velden van de SAVE_CONFIG-sectie naar de juiste sectie in het hoofdconfiguratiegebied.

source: Use `field: value` syntax instead of `field=value`.
nl: Gebruik `field: value` syntaxis in plaats van `field=value`.

source: Avoid defining field values that are set to their default value. For example, one should not specify `min_extrude_temp: 170` as that is already the default value.
nl: Vermijd het definiëren van veldwaarden die zijn ingesteld op hun standaardwaarde. Men zou bijvoorbeeld niet `min_extrude_temp: 170` moeten specificeren, aangezien dat al de standaardwaarde is.

source: Where possible, lines should not exceed 80 columns.
nl: Waar mogelijk mogen regels niet langer zijn dan 80 tekens.

source: Avoid adding attribution or revision messages to the config files. (For example, avoid adding lines like "this file was created by ...".) Place attribution and change history in the git commit message.
nl: Voeg geen attributie- of revisieberichten toe aan de configuratiebestanden. (Vermijd bijvoorbeeld het toevoegen van regels als "dit bestand is gemaakt door ...".) Plaats attributie- en wijzigingsgeschiedenis in het git commit-bericht.

source: Do not disable a default safety system in an example config file. For example, a config should not specify a custom `max_extrude_cross_section`. Do not enable debugging features. For example there should not be a `force_move` config section.
nl: Schakel een standaard veiligheidssysteem niet uit in een voorbeeldconfiguratiebestand. Een configuratie mag bijvoorbeeld geen aangepaste `max_extrude_cross_section` specificeren. Schakel foutopsporingsfuncties niet in. Er zou bijvoorbeeld geen `force_move` configuratiesectie moeten zijn.

source: Example config files are submitted by creating a github "pull request". Please also follow the directions in the [contributing document](CONTRIBUTING.md).
nl: Voorbeeldconfiguratiebestanden worden ingediend door een github "pull request" te maken. Volg ook de aanwijzingen in het [bijdragende document](CONTRIBUTING.md).

source: The `printer` prefix is used for stock printers sold by a mainstream manufacturer.
nl: Het voorvoegsel `printer` wordt gebruikt voor standaardprinters die worden verkocht door een reguliere fabrikant.

source: Example configurations
nl: Voorbeeld configuraties

source: Select the appropriate config filename prefix:
nl: Selecteer het juiste voorvoegsel van de configuratiebestandsnaam:

source: All configuration files must end in a `.cfg` suffix. The `printer` config files must end in a year followed by `.cfg` (eg, `-2019.cfg`). In this case, the year is an approximate year the given printer was sold.
nl: Alle configuratiebestanden moeten eindigen op een `.cfg`-achtervoegsel. De `printer` configuratiebestanden moeten eindigen in een jaar gevolgd door `.cfg` (bijv. `-2019.cfg`). In dit geval is het jaar bij benadering het jaar waarin de printer is verkocht.

source: Do not use spaces or special characters in the config filename. The filename should contain only characters `A-Z`, `a-z`, `0-9`, `-`, and `.`.
nl: Gebruik geen spaties of speciale tekens in de configuratiebestandsnaam. De bestandsnaam mag alleen de tekens `A-Z`, `a-z`, `0-9`, `-` en `.` bevatten.

source: Do not use any deprecated features in the example config file.
nl: Gebruik geen verouderde parameters (features) in het voorbeeldconfiguratiebestand.

source: When adding an extruder `rotation_distance` it is preferable to specify a `gear_ratio` if the extruder has a gearing mechanism. We expect the rotation_distance in the example configs to correlate with the circumference of the hobbed gear in the extruder - it is normally in the range of 20 to 35mm. When specifying a `gear_ratio` it is preferable to specify the actual gears on the mechanism (eg, prefer `gear_ratio: 80:20` over `gear_ratio: 4:1`). See the [rotation distance document](Rotation_Distance.md#using-a-gear_ratio) for more information.
nl: Bij het toevoegen van een extruder `rotation_distance` verdient het de voorkeur om een `gear_ratio` op te geven als de extruder een tandwielmechanisme heeft. We verwachten dat de rotation_distance in de voorbeeldconfiguraties correleert met de omtrek van het gekarteld-tandwiel in de extruder - normaal gesproken ligt deze tussen de 20 en 35 mm. Bij het specificeren van een `overbrengingsverhouding` verdient het de voorkeur om de daadwerkelijke versnellingen op het mechanisme te specificeren (geef bijvoorbeeld de voorkeur aan `overbrengingsverhouding: 80:20` boven `overbrengingsverhouding: 4:1`). Zie het document [rotatieafstand](Rotation_Distance.md#using-a-gear_ratio) voor meer informatie.

source: All known boards that Klipper supports can use the default serial baud rate of 250000. Do not recommend a different baud rate in an example config file.
nl: Alle bekende boards die Klipper ondersteunt, kunnen de standaard seriële baudrate van 250000 gebruiken. Het is niet aan te raden om een andere baudrate in een voorbeeldconfiguratiebestand te gebruiken.
