Repository: fran6p/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Exclude_Object.po
Languages: pt_br, ru

source: Exclude Objects
pt_br: Excluir Objetos
ru: Исключить Объекты

source: The `[exclude_object]` module allows Klipper to exclude objects while a print is in progress. To enable this feature include an [exclude_object config section](Config_Reference.md#exclude_object) (also see the [command reference](G-Codes.md#exclude-object) and [sample-macros.cfg](../config/sample-macros.cfg) file for a Marlin/RepRapFirmware compatible M486 G-Code macro.)
pt_br: O módulo `[exclude_object]` permite que o Klipper exclua objetos enquanto uma impressão está em andamento. Para habilitar este recurso, inclua uma [seção de configuração de exclusão de objeto](Config_Reference.md#exclude_object) (veja também a [referência de comandos](G-Codes.md#exclude-object) e o arquivo [sample-macros.cfg](../config/sample-macros.cfg) para um macro de código G M486 compatível com Marlin/RepRapFirmware.)
ru: Модуль `[exclude_object]` позволяет Klipper исключать объекты во время выполнения печати. Чтобы включить эту функцию, включите [exclude_object config section](Config_Reference.md#exclude_object) (также см. [command reference](G-Codes.md#exclude-object) и [sample-macros.cfg](../config/sample-macros.cfg) файл для Marlin/Макрос G-кода, совместимый с программным обеспечением RepRapFirmware M486.)

source: Unlike other 3D printer firmware options, a printer running Klipper utilizes a suite of components and users have many options to choose from. Therefore, in order to provide a a consistent user experience, the `[exclude_object]` module will establish a contract or API of sorts. The contract covers the contents of the gcode file, how the internal state of the module is controlled, and how that state is provided to clients.
pt_br: Diferente de outras opções de firmware de impressora 3D, uma impressora que executa o Klipper utiliza um conjunto de componentes e os usuários têm muitas opções para escolher. Portanto, para fornecer uma experiência de usuário consistente, o módulo `[exclude_object]` estabelecerá um contrato ou API de algum tipo. O contrato abrange o conteúdo do arquivo gcode, como o estado interno do módulo é controlado e como esse estado é fornecido aos clientes.
ru: В отличие от других вариантов встроенного ПО для 3D-принтеров, принтер под управлением Klipper использует набор компонентов, и у пользователей есть множество вариантов на выбор. Следовательно, чтобы обеспечить согласованное взаимодействие с пользователем, модуль `[exclude_object]` установит своего рода контракт или API. Контракт охватывает содержимое файла gcode, то, как контролируется внутреннее состояние модуля и как это состояние предоставляется клиентам.

source: Workflow Overview
pt_br: Visão geral do fluxo de trabalho
ru: Обзор рабочего процесса

source: A typical workflow for printing a file might look like this:
pt_br: Um fluxo de trabalho típico para imprimir um arquivo pode parecer com isso:
ru: Типичный процесс печати файла может выглядеть следующим образом:

source: Slicing is completed and the file is uploaded for printing. During the upload, the file is processed and `[exclude_object]` markers are added to the file. Alternately, slicers may be configured to prepare object exclusion markers natively, or in it's own pre-processing step.
pt_br: O fatiamento é concluído e o arquivo é carregado para impressão. Durante o carregamento, o arquivo é processado e os marcadores `[exclude_object]` são adicionados ao arquivo. Alternativamente, os fatiadores podem ser configurados para preparar os marcadores de exclusão de objeto nativamente, ou em seu próprio passo de pré-processamento.
ru: Нарезка завершена, и файл выгружается на печать. Во время загрузки файл обрабатывается, и в него добавляются маркеры `[exclude_object]`. В качестве альтернативы слайсеры могут быть настроены на подготовку маркеров исключения объектов нативно или на отдельном этапе предварительной обработки.

source: When printing starts, Klipper will reset the `[exclude_object]` [status](Status_Reference.md#exclude_object).
pt_br: Quando a impressão começa, o Klipper irá resetar o status do `[exclude_object]` [status](Status_Reference.md#exclude_object).
ru: Когда начнется печать, Klipper сбросит значение `[exclude_object]` [status](Status_Reference.md#exclude_object).

source: When Klipper processes the `EXCLUDE_OBJECT_DEFINE` block, it will update the status with the known objects and pass it on to clients.
pt_br: Quando o Klipper processa o bloco `EXCLUDE_OBJECT_DEFINE`, ele irá atualizar o status com os objetos conhecidos e passá-lo para os clientes.
ru: Когда Klipper обрабатывает блок `EXCLUDE_OBJECT_DEFINE`, он обновляет статус известных объектов и передает его клиентам.

source: The client may use that information to present a UI to the user so that progress can be tracked. Klipper will update the status to include the currently printing object which the client can use for display purposes.
pt_br: O cliente pode usar essas informações para apresentar uma UI ao usuário para que o progresso possa ser rastreado. O Klipper irá atualizar o status para incluir o objeto que está sendo impresso no momento, que o cliente pode usar para fins de exibição.
ru: Клиент может использовать эту информацию для представления пользовательского интерфейса пользователю, чтобы можно было отслеживать прогресс. Klipper обновит статус, включив в него текущий печатаемый объект, который клиент может использовать для отображения.

source: If the user requests that an object be cancelled, the client will issue an `EXCLUDE_OBJECT NAME=<name>` command to Klipper.
pt_br: Se o usuário solicitar que um objeto seja cancelado, o cliente emitirá um comando `EXCLUDE_OBJECT NAME=<nome>` para o Klipper.
ru: Если пользователь запрашивает отмену объекта, клиент отправит Klipper команду `EXCLUDE_OBJECT NAME=<name>`.

source: When Klipper process the command, it will add the object to the list of excluded objects and update the status for the client.
pt_br: Quando o Klipper processa o comando, ele adicionará o objeto à lista de objetos excluídos e atualizará o status para o cliente.
ru: Когда Klipper обработает команду, он добавит объект в список исключенных объектов и обновит статус клиента.

source: The client will receive the updated status from Klipper and can use that information to reflect the object's status in the UI.
pt_br: O cliente receberá o status atualizado do Klipper e poderá usar essas informações para refletir o status do objeto na UI (interface do usuário).
ru: Клиент получит обновленный статус от Klipper и сможет использовать эту информацию для отражения статуса объекта в пользовательском интерфейсе.

source: When printing finishes, the `[exclude_object]` status will continue to be available until another action resets it.
pt_br: Quando a impressão terminar, o status do `[exclude_object]` continuará disponível até que outra ação o resete.
ru: После завершения печати статус `[exclude_object]` будет оставаться доступным до тех пор, пока другое действие не сбросит его.

source: The GCode File
pt_br: O arquivo GCode
ru: Файл GCode

source: The specialized gcode processing needed to support excluding objects does not fit into Klipper's core design goals. Therefore, this module requires that the file is processed before being sent to Klipper for printing. Using a post-process script in the slicer or having middleware process the file on upload are two possibilities for preparing the file for Klipper. A reference post-processing script is available both as an executable and a python library, see [cancelobject-preprocessor](https://github.com/kageurufu/cancelobject-preprocessor).
pt_br: O processamento especializado de gcode necessário para suportar a exclusão de objetos não se enquadra nos objetivos centrais de design do Klipper. Portanto, este módulo requer que o arquivo seja processado antes de ser enviado para o Klipper para impressão. Usar um script de pós-processamento no fatiador ou ter um middleware processando o arquivo no upload são duas possibilidades para preparar o arquivo para o Klipper. Um script de pós-processamento de referência está disponível tanto como um executável quanto uma biblioteca python, veja [cancelobject-preprocessor](https://github.com/kageurufu/cancelobject-preprocessor).
ru: Специализированная обработка gcode, необходимая для поддержки исключения объектов, не соответствует основным целям разработки Klipper. Поэтому этот модуль требует, чтобы файл был обработан перед отправкой в Klipper на печать. Использование сценария постобработки в слайсере или использование промежуточного программного обеспечения для обработки файла при загрузке — это две возможности подготовки файла для Klipper. Эталонный сценарий постобработки доступен как в виде исполняемого файла, так и в виде библиотеки Python, см. [cancelobject-preprocessor](https://github.com/kageurufu/cancelobject-preprocessor).

source: Object Definitions
pt_br: Definições de objetos
ru: Определения объектов

source: The `EXCLUDE_OBJECT_DEFINE` command is used to provide a summary of each object in the gcode file to be printed. Provides a summary of an object in the file. Objects don't need to be defined in order to be referenced by other commands. The primary purpose of this command is to provide information to the UI without needing to parse the entire gcode file.
pt_br: O comando `EXCLUDE_OBJECT_DEFINE` é usado para fornecer um resumo de cada objeto no arquivo gcode a ser impresso. Fornece um resumo de um objeto no arquivo. Objetos não precisam ser definidos para serem referenciados por outros comandos. O objetivo principal deste comando é fornecer informações para a UI sem a necessidade de analisar todo o arquivo gcode.
ru: Команда `EXCLUDE_OBJECT_DEFINE` используется для предоставления сводной информации о каждом объекте в файле gcode для печати. Предоставляет сводную информацию об объекте в файле. Объекты не обязательно должны быть определены, чтобы на них могли ссылаться другие команды. Основная цель этой команды — предоставить информацию пользовательскому интерфейсу без необходимости анализа всего файла gcode.

source: Object definitions are named, to allow users to easily select an object to be excluded, and additional metadata may be provided to allow for graphical cancellation displays. Currently defined metadata includes a `CENTER` X,Y coordinate, and a `POLYGON` list of X,Y points representing a minimal outline of the object. This could be a simple bounding box, or a complicated hull for showing more detailed visualizations of the printed objects. Especially when gcode files include multiple parts with overlapping bounding regions, center points become hard to visually distinguish. `POLYGONS` must be a json-compatible array of point `[X,Y]` tuples without whitespace. Additional parameters will be saved as strings in the object definition and provided in status updates.
pt_br: As definições de objeto são nomeadas, para permitir que os usuários selecionem facilmente um objeto para ser excluído, e metadados adicionais podem ser fornecidos para permitir exibições gráficas de cancelamento. Os metadados definidos atualmente incluem uma coordenada `CENTER` X,Y, e uma lista `POLYGON` de pontos X,Y representando um contorno mínimo do objeto. Isso pode ser uma simples caixa delimitadora, ou um casco complicado para mostrar visualizações mais detalhadas dos objetos impressos. Especialmente quando os arquivos gcode incluem várias partes com regiões delimitadoras sobrepostas, os pontos centrais se tornam difíceis de distinguir visualmente. `POLYGONS` deve ser um array compatível com json de pontos `[X,Y]` sem espaços em branco. Parâmetros adicionais serão salvos como strings na definição do objeto e fornecidos em atualizações de status.
ru: Определениям объектов присваиваются имена, чтобы пользователи могли легко выбрать объект для исключения, а также могут быть предоставлены дополнительные метаданные для графического отображения отмены. Определенные на данный момент метаданные включают в себя координаты `ЦЕНТР` X,Y и список точек `ПОЛИГОН` из точек X,Y, представляющих минимальный контур объекта. Это может быть простая ограничивающая рамка или сложная оболочка для более детальной визуализации напечатанных объектов. Особенно, когда файлы gcode состоят из нескольких частей с перекрывающимися ограничивающими областями, центральные точки становится трудно отличить визуально. `POLYGONS` должен быть json-совместимым массивом кортежей точек `[X,Y]` без пробелов. Дополнительные параметры будут сохранены в виде строк в определении объекта и предоставлены в обновлениях статуса.

source: `EXCLUDE_OBJECT_DEFINE NAME=calibration_pyramid CENTER=50,50 POLYGON=[[40,40],[50,60],[60,40]]`
ru: `EXCLUDE_OBJECT_DEFINE NAME=калибровка_пирамиды CENTER=50,50 POLYGON=[[40,40],[50,60],[60,40]]`

source: All available G-Code commands are documented in the [G-Code Reference](./G-Codes.md#excludeobject)
pt_br: Todos os comandos G-Code disponíveis estão documentados na [Referência de G-Code](./G-Codes.md#excludeobject)
ru: Все доступные команды G-кода описаны в [Справочнике по G-коду](./G-Codes.md#excludeobject)

source: Status Information
pt_br: Informações de status
ru: Информация о статусе

source: The state of this module is provided to clients by the [exclude_object status](Status_Reference.md#exclude_object).
pt_br: O estado deste módulo é fornecido aos clientes pelo status do [exclude_object](Status_Reference.md#exclude_object).
ru: Состояние этого модуля предоставляется клиентам посредством [статуса exclude_object](Status_Reference.md#exclude_object).

source: The status is reset when:
pt_br: O status é reiniciado quando:
ru: Статус сбрасывается, когда:

source: The Klipper firmware is restarted.
pt_br: O firmware do Klipper é reiniciado.
ru: Прошивка Klipper перезапускается.

source: There is a reset of the `[virtual_sdcard]`. Notably, this is reset by Klipper at the start of a print.
pt_br: Há um reset do `[virtual_sdcard]`. Notavelmente, este é reiniciado pelo Klipper no início de uma impressão.
ru: Происходит сброс `[virtual_sdcard]`. Примечательно, что Klipper сбрасывает это значение в начале печати.

source: When an `EXCLUDE_OBJECT_DEFINE RESET=1` command is issued.
pt_br: Quando um comando `EXCLUDE_OBJECT_DEFINE RESET=1` é emitido.
ru: Когда выдается команда `EXCLUDE_OBJECT_DEFINE RESET=1`.

source: The list of defined objects is represented in the `exclude_object.objects` status field. In a well defined gcode file, this will be done with `EXCLUDE_OBJECT_DEFINE` commands at the beginning of the file. This will provide clients with object names and coordinates so the UI can provide a graphical representation of the objects if desired.
pt_br: A lista de objetos definidos é representada no campo de status `exclude_object.objects`. Em um arquivo gcode bem definido, isso será feito com comandos `EXCLUDE_OBJECT_DEFINE` no início do arquivo. Isso fornecerá aos clientes nomes de objetos e coordenadas para que a UI possa fornecer uma representação gráfica dos objetos, se desejado.
ru: Список определенных объектов представлен в поле статуса `exclude_object.objects`. В четко определенном файле gcode это будет сделано с помощью команд `EXCLUDE_OBJECT_DEFINE` в начале файла. Это предоставит клиентам имена и координаты объектов, чтобы пользовательский интерфейс мог при желании предоставить графическое представление объектов.

source: As the print progresses, the `exclude_object.current_object` status field will be updated as Klipper processes `EXCLUDE_OBJECT_START` and `EXCLUDE_OBJECT_END` commands. The `current_object` field will be set even if the object has been excluded. Undefined objects marked with a `EXCLUDE_OBJECT_START` will be added to the known objects to assist in UI hinting, without any additional metadata.
pt_br: Conforme a impressão avança, o campo de status `exclude_object.current_object` será atualizado à medida que o Klipper processa os comandos `EXCLUDE_OBJECT_START` e `EXCLUDE_OBJECT_END`. O campo `current_object` será definido mesmo se o objeto tiver sido excluído. Objetos indefinidos marcados com um `EXCLUDE_OBJECT_START` serão adicionados aos objetos conhecidos para ajudar nas dicas da UI, sem nenhum metadado adicional.
ru: По мере выполнения печати поле статуса `exclude_object.current_object` будет обновляться по мере того, как Klipper обрабатывает команды `EXCLUDE_OBJECT_START` и `EXCLUDE_OBJECT_END`. Поле current_object будет установлено, даже если объект был исключен. Неопределенные объекты, помеченные EXCLUDE_OBJECT_START, будут добавлены к известным объектам для помощи в подсказках пользовательского интерфейса без каких-либо дополнительных метаданных.

source: As `EXCLUDE_OBJECT` commands are issued, the list of excluded objects is provided in the `exclude_object.excluded_objects` array. Since Klipper looks ahead to process upcoming gcode, there may be a delay between when the command is issued and when the status is updated.
pt_br: Conforme os comandos `EXCLUDE_OBJECT` são emitidos, a lista de objetos excluídos é fornecida no array `exclude_object.excluded_objects`. Como o Klipper olha para frente para processar o gcode que está por vir, pode haver um atraso entre quando o comando é emitido e quando o status é atualizado.
ru: При выполнении команды`EXCLUDE_OBJECT` список исключенных объектов предоставляется в массиве `exclude_object.excluded_objects`. Поскольку Klipper заранее обрабатывает предстоящий gcode, между выдачей команды и обновлением статуса может возникнуть задержка.
