Repository: fran6p/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Manual_Level.po
Languages: ru, sk

source: The `DIRECTION` parameter is useful if you can turn your bed adjustment screws in one direction only. For example, you might have screws that start tightened in their lowest (or highest) possible position, which can only be turned in a single direction, to raise (or lower) the bed. If you can only turn the screws clockwise, run `SCREWS_TILT_CALCULATE DIRECTION=CW`. If you can only turn them counter-clockwise, run `SCREWS_TILT_CALCULATE DIRECTION=CCW`. A suitable reference point will be chosen such that the bed can be leveled by turning all the screws in the given direction.
ru: Параметр "НАПРАВЛЕНИЕ" полезен, если вы можете поворачивать регулировочные винты кровати только в одном направлении. Например, у вас могут быть винты, которые начинают затягиваться в их самом низком (или самом высоком) возможном положении, и которые можно поворачивать только в одном направлении, чтобы поднять (или опустить) кровать. Если вы можете поворачивать винты только по часовой стрелке, запустите `SCREWS_TILT_CALCULATE DIRECTION=CW`. Если вы можете поворачивать их только против часовой стрелки, запустите `SCREWS_TILT_CALCULATE DIRECTION=CCW`. Подходящая точка отсчета будет выбрана таким образом, чтобы можно было выровнять основание, повернув все винты в заданном направлении.
sk: Parameter `DIRECTION` je užitočný, ak môžete nastavovacie skrutky postele otáčať iba jedným smerom. Môžete mať napríklad skrutky, ktoré sa začínajú uťahovať v najnižšej (alebo najvyššej) možnej polohe, ktorú možno otáčať iba v jednom smere, aby ste zdvihli (alebo znížili) posteľ. Ak môžete skrutky otáčať iba v smere hodinových ručičiek, spustite príkaz `SCREWS_TILT_CALCULATE DIRECTION=CW`. Ak ich môžete otáčať iba proti smeru hodinových ručičiek, spustite príkaz `SCREWS_TILT_CALCULATE DIRECTION=CCW`. Vhodný referenčný bod sa zvolí tak, aby bolo možné posteľ vyrovnať otočením všetkých skrutiek v danom smere.

source: Manual leveling
ru: Ручное выравнивание
sk: Manuálne vyrovnanie

source: front left screw is the reference point you must not change it.
ru: передний левый винт является точкой отсчета, вы не должны его менять.
sk: ľavá predná skrutka je referenčným bodom, nesmiete ju meniť.

source: front right screw must be turned clockwise 1 full turn and a quarter turn
ru: передний правый винт должен быть повернут по часовой стрелке на 1 полный оборот и четверть оборота
sk: predná pravá skrutka sa musí otočiť v smere hodinových ručičiek o 1 celú otáčku a o štvrť otáčky

source: rear right screw must be turned counter-clockwise 50 minutes
ru: задний правый винт необходимо поворачивать против часовой стрелки в течение 50 минут
sk: pravá zadná skrutka sa musí otáčať proti smeru hodinových ručičiek 50 minút

source: [bed_screws] screw1: 100, 50 screw2: 100, 150 screw3: 150, 100
ru: [bed_screws] винт 1: 100, 50 винт 2: 100, 150 винт 3: 150, 100

source: [bed_screws] screw1: 100, 50 screw1_fine_adjust: 0, 0 screw2: 100, 150 screw2_fine_adjust: 300, 300 screw3: 150, 100 screw3_fine_adjust: 0, 100
ru: [bed_screws] винт 1: 100, 50 винт 1_fine_adjust: 0, 0 винт 2: 100, 150 винт 2_fine_adjust: 300, 300 винт 3: 150, 100 винт 3_fine_adjust: 0, 100

source: [screws_tilt_adjust] screw1: -5, 30 screw1_name: front left screw screw2: 155, 30 screw2_name: front right screw screw3: 155, 190 screw3_name: rear right screw screw4: -5, 190 screw4_name: rear left screw horizontal_move_z: 10. speed: 50. screw_thread: CW-M3
ru: [screws_tilt_adjust] винт 1: -5, 30 название винта 1_: передний левый винт , винт 2: 155, 30 название винта 2_: передний правый винт , винт 3: 155, 190 название винта 3_: задний правый винт , винт 4: -5, 190 название винта 4_: задний левый винт , горизонтальное перемещение_z: 10. скорость: 50. резьба винта: CW-M3

source: rear left screw must be turned clockwise 2 minutes (not need it's ok)
ru: задний левый винт необходимо повернуть по часовой стрелке на 2 минуты (не обязательно, все в порядке)
sk: zadná ľavá skrutka sa musí otáčať v smere hodinových ručičiek 2 minúty (netreba, je to v poriadku)

source: Note that "minutes" refers to "minutes of a clock face". So, for example, 15 minutes is a quarter of a full turn.
ru: Обратите внимание, что "минуты" относятся к "минутам циферблата часов". Так, например, 15 минут - это четверть полного оборота.
sk: Všimnite si, že „minúty“ sa vzťahujú na „minúty ciferníka“. Takže napríklad 15 minút je štvrtina celej otáčky.
