Repository: fran6p/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Manual_Level.po
Languages: ru, sk

source: This document describes tools for calibrating a Z endstop and for performing adjustments to bed leveling screws.
ru: В этом документе описаны инструменты для калибровки концевого упора Z и для выполнения регулировок винтов для выравнивания станины.
sk: Tento dokument popisuje nástroje na kalibráciu koncového dorazu Z a na vykonávanie úprav vyrovnávacích skrutiek lôžka.

source: Calibrating a Z endstop
ru: Калибровка концевого упора Z
sk: Kalibrácia koncového dorazu Z

source: An accurate Z endstop position is critical to obtaining high quality prints.
ru: Точное положение концевого упора Z имеет решающее значение для получения высококачественных отпечатков.
sk: Presná poloha koncového dorazu Z je rozhodujúca pre získanie vysokokvalitných výtlačkov.

source: Note, though, the accuracy of the Z endstop switch itself can be a limiting factor. If one is using Trinamic stepper motor drivers then consider enabling [endstop phase](Endstop_Phase.md) detection to improve the accuracy of the switch.
ru: Обратите внимание, однако, что точность самого переключателя Z endstop может быть ограничивающим фактором. Если вы используете драйверы шаговых двигателей Trinamic, то рассмотрите возможность включения [фаза конечной остановки](Endstop_Phase.md ) обнаружение для повышения точности переключения.
sk: Upozorňujeme však, že presnosť samotného koncového spínača Z môže byť limitujúcim faktorom. Ak používate ovládače krokových motorov Trinamic, zvážte aktiváciu detekcie [koncová fáza](Endstop_Phase.md), aby ste zlepšili presnosť spínača.

source: To perform a Z endstop calibration, home the printer, command the head to move to a Z position that is at least five millimeters above the bed (if it is not already), command the head to move to an XY position near the center of the bed, then navigate to the OctoPrint terminal tab and run:
ru: Для выполнения калибровки конечного упора по оси Z, уведите оси принтера "домой", дайте команду головке переместиться в положение по оси Z, которое находится на высоте не менее пяти миллиметров над столом(если это еще не так), дайте команду головке переместиться в положение по оси XY около центра стола, затем перейдите на вкладку терминала OctoPrint и запустите его:
sk: Ak chcete vykonať kalibráciu koncového dorazu Z, umiestnite tlačiareň do pôvodnej polohy, prikážte hlave, aby sa posunula do polohy Z, ktorá je aspoň päť milimetrov nad posteľou (ak ešte nie je), prikážte hlave, aby sa posunula do polohy XY blízko stredu lôžko, potom prejdite na kartu terminálu OctoPrint a spustite:

source: Then follow the steps described at ["the paper test"](Bed_Level.md#the-paper-test) to determine the actual distance between the nozzle and bed at the given location. Once those steps are complete one can `ACCEPT` the position and save the results to the config file with:
ru: Затем выполните действия, описанные в разделе ["тест бумаги"](Bed_Level.md#the-paper-test), чтобы определить реальное расстояние между соплом и станиной в заданном месте. После выполнения этих шагов можно принять `ACCEPT` позицию и сохранить результаты в файле конфигурации с помощью:
sk: Potom postupujte podľa krokov popísaných v ["the paper test"](Bed_Level.md#the-paper-test) aby ste určili skutočnú vzdialenosť medzi tryskou a lôžkom na danom mieste. Po dokončení týchto krokov môžete pozíciu `ACCEPT` a uložiť výsledky do konfiguračného súboru pomocou:

source: It's preferable to use a Z endstop switch on the opposite end of the Z axis from the bed. (Homing away from the bed is more robust as then it is generally always safe to home the Z.) However, if one must home towards the bed it is recommended to adjust the endstop so that it triggers a small distance (eg, .5mm) above the bed. Almost all endstop switches can safely be depressed a small distance beyond their trigger point. When this is done, one should find that the `Z_ENDSTOP_CALIBRATE` command reports a small positive value (eg, .5mm) for the Z position_endstop. Triggering the endstop while it is still some distance from the bed reduces the risk of inadvertent bed crashes.
ru: Предпочтительнее использовать концевой выключатель Z на противоположном от станины конце оси Z. (Наведение от станины более надежно, так как в этом случае наведение по оси Z обычно всегда безопасно). Тем не менее, если необходимо направить устройство в сторону кровати, рекомендуется настроить концевой выключатель таким образом, чтобы он срабатывал на небольшом расстоянии (например, .5 мм) над кроватью. Почти все концевые выключатели можно смело нажимать на небольшом расстоянии от точки срабатывания. При этом команда `Z_ENDSTOP_CALIBRATE` должна показывать небольшое положительное значение (например, .5 мм) для Z-позиции_концевого упора. Срабатывание концевого упора, когда он еще находится на некотором расстоянии от станины, снижает риск непреднамеренного заваливания станины.
sk: Je vhodnejšie použiť koncový spínač Z na opačnom konci osi Z ako lôžko. (Nasmerovanie preč od postele je robustnejšie, pretože potom je vo všeobecnosti vždy bezpečné vrátiť Z.) Ak sa však človek musí vrátiť k posteli, odporúča sa nastaviť koncový doraz tak, aby spustil malú vzdialenosť (napr. 0,5 mm ) nad posteľou. Takmer všetky koncové spínače možno bezpečne stlačiť na malú vzdialenosť za ich spúšťací bod. Keď to urobíte, mali by ste zistiť, že príkaz `Z_ENDSTOP_CALIBRATE` hlási malú kladnú hodnotu (napr. 0,5 mm) pre Z position_endstop. Spustenie koncového dorazu, keď je ešte v určitej vzdialenosti od lôžka, znižuje riziko neúmyselného zrútenia lôžka.

source: Some printers have the ability to manually adjust the location of the physical endstop switch. However, it's recommended to perform Z endstop positioning in software with Klipper - once the physical location of the endstop is in a convenient location, one can make any further adjustments by running Z_ENDSTOP_CALIBRATE or by manually updating the Z position_endstop in the configuration file.
ru: Некоторые принтеры имеют возможность вручную регулировать расположение физического выключателя конечной остановки. Тем не менее, рекомендуется выполнять позиционирование Z endstop программно с помощью Klipper - как только физическое расположение endstop окажется в удобном месте, можно будет внести любые дополнительные настройки, запустив Z_ENDSTOP_CALIBRATE или вручную обновив Z position_endstop в файле конфигурации.
sk: Niektoré tlačiarne majú možnosť manuálne upraviť umiestnenie fyzického koncového spínača. Odporúča sa však vykonať polohovanie koncového dorazu Z v softvéri pomocou aplikácie Klipper – keď je fyzické umiestnenie koncového dorazu na vhodnom mieste, je možné vykonať ďalšie úpravy spustením Z_ENDSTOP_CALIBRATE alebo manuálnou aktualizáciou koncového dorazu Z v konfiguračnom súbore.

source: Adjusting bed leveling screws
ru: Регулировочные винты для выравнивания ложа
sk: Nastavovacie skrutky na vyrovnanie lôžka

source: The secret to getting good bed leveling with bed leveling screws is to utilize the printer's high precision motion system during the bed leveling process itself. This is done by commanding the nozzle to a position near each bed screw and then adjusting that screw until the bed is a set distance from the nozzle. Klipper has a tool to assist with this. In order to use the tool it is necessary to specify each screw XY location.
ru: Секрет хорошего выравнивания стола с помощью выравнивающих винтов заключается в использовании высокоточной системы перемещения принтера во время самого процесса выравнивания стола. Для этого необходимо задать соплу положение вблизи каждого винта стола, а затем регулировать этот винт до тех пор, пока стол не окажется на заданном расстоянии от сопла. Для этого в компании Klipper имеется инструмент. Для использования этого инструмента необходимо указать XY-позицию каждого винта.
sk: Tajomstvom dosiahnutia dobrého vyrovnania lôžka pomocou skrutiek na vyrovnanie lôžka je využiť vysoko presný pohybový systém tlačiarne počas samotného procesu vyrovnávania lôžka. To sa vykonáva tak, že sa dýze prikáže do polohy v blízkosti každej skrutky lôžka a potom sa táto skrutka nastaví, kým lôžko nebude v nastavenej vzdialenosti od dýzy. Klipper má nástroj, ktorý vám s tým pomôže. Pre použitie nástroja je potrebné špecifikovať umiestnenie každej skrutky XY.

source: This is done by creating a `[bed_screws]` config section. For example, it might look something similar to:
ru: Это делается путем создания раздела конфигурации `[bed_screws]`. Например, это может выглядеть примерно так:
sk: Urobíte to vytvorením konfiguračnej sekcie `[bed_screws]`. Môže to vyzerať napríklad takto:

source: If a bed screw is under the bed, then specify the XY position directly above the screw. If the screw is outside the bed then specify an XY position closest to the screw that is still within the range of the bed.
ru: Если опорный винт находится под опорой, то укажите положение XY непосредственно над винтом. Если винт находится вне станины, то укажите положение XY, наиболее близкое к винту, которое все еще находится в пределах досягаемости станины.
sk: Ak je skrutka lôžka pod lôžkom, zadajte polohu XY priamo nad skrutkou. Ak je skrutka mimo lôžka, špecifikujte polohu XY najbližšie k skrutke, ktorá je stále v dosahu lôžka.

source: Once the config file is ready, run `RESTART` to load that config, and then one can start the tool by running:
ru: Как только конфигурационный файл будет готов, запустите `ПЕРЕЗАПУСК`, чтобы загрузить эту конфигурацию, а затем можно запустить инструмент, выполнив:
sk: Keď je konfiguračný súbor pripravený, spustite príkaz `RESTART`, aby ste načítali túto konfiguráciu a potom je možné spustiť nástroj spustením:

source: This tool will move the printer's nozzle to each screw XY location and then move the nozzle to a Z=0 height. At this point one can use the "paper test" to adjust the bed screw directly under the nozzle. See the information described in ["the paper test"](Bed_Level.md#the-paper-test), but adjust the bed screw instead of commanding the nozzle to different heights. Adjust the bed screw until there is a small amount of friction when pushing the paper back and forth.
ru: Этот инструмент переместит сопло принтера в положение каждого винта XY, а затем переместит сопло на высоту Z=0. На этом этапе можно использовать "бумажный тест" для регулировки винта подложки непосредственно под насадку. Смотрите информацию, описанную в ["тест бумаги"](Bed_Level.md#the-paper-test), но отрегулируйте винт подложки вместо того, чтобы устанавливать сопло на разную высоту. Отрегулируйте винт крепления до тех пор, пока при перемещении бумаги взад и вперед не возникнет небольшое трение.
sk: Tento nástroj presunie dýzu tlačiarne na každé miesto skrutky XY a potom dýzu posunie do výšky Z=0. V tomto bode je možné použiť "test papiera" na nastavenie skrutky lôžka priamo pod tryskou. Pozrite si informácie opísané v ["test papiera"](Bed_Level.md#the-paper-test), ale namiesto prikazovania tryske do rôznych výšok nastavte skrutku lôžka. Upravte skrutku lôžka, až kým nedochádza k malému treniu pri posúvaní papiera tam a späť.

source: Once the screw is adjusted so that a small amount of friction is felt, run either the `ACCEPT` or `ADJUSTED` command. Use the `ADJUSTED` command if the bed screw needed an adjustment (typically anything more than about 1/8th of a turn of the screw). Use the `ACCEPT` command if no significant adjustment is necessary. Both commands will cause the tool to proceed to the next screw. (When an `ADJUSTED` command is used, the tool will schedule an additional cycle of bed screw adjustments; the tool completes successfully when all bed screws are verified to not require any significant adjustments.) One can use the `ABORT` command to exit the tool early.
ru: Как только винт отрегулирован таким образом, чтобы ощущалось небольшое трение, выполните команду `ПРИНЯТЬ` или `ОТРЕГУЛИРОВАНО`. Используйте команду `ОТРЕГУЛИРОВАНО`, если винт основания нуждается в регулировке (обычно что-то большее, чем примерно 1/8 оборота винта). Используйте команду `ПРИНЯТЬ`, если существенной корректировки не требуется. Обе команды приведут к тому, что инструмент перейдет к следующему винту. (При использовании команды `ОТРЕГУЛИРОВАНО` инструмент запланирует дополнительный цикл регулировки винтов станины; установка инструмента завершается успешно, когда все винты станины проверены на то, что они не требуют каких-либо существенных регулировок.) Можно использовать команду `ПРЕРВАТЬ`, чтобы выйти из инструмента досрочно.
sk: Keď je skrutka nastavená tak, že je cítiť malé trenie, spustite buď príkaz `ACCEPT` alebo `ADJUSTED`. Použite príkaz `ADJUSTED`, ak skrutka lôžka potrebovala nastavenie (zvyčajne niečo viac ako približne 1/8 otáčky skrutky). Ak nie sú potrebné žiadne významné úpravy, použite príkaz `ACCEPT`. Oba príkazy spôsobia, že nástroj prejde na ďalšiu skrutku. (Keď sa použije príkaz „ADJUSTED“, nástroj naplánuje ďalší cyklus nastavenia skrutky lôžka; nástroj sa úspešne dokončí, keď sa overí, že všetky skrutky lôžka nevyžadujú žiadne významné úpravy.) Na ukončenie môžete použiť príkaz „ABORT“ nástroj skoro.

source: This system works best when the printer has a flat printing surface (such as glass) and has straight rails. Upon successful completion of the bed leveling tool the bed should be ready for printing.
ru: Эта система лучше всего работает, когда принтер имеет плоскую печатающую поверхность (например, стекло) и прямые направляющие. После успешного завершения работы с инструментом для выравнивания слоя, слой должен быть готов к печати.
sk: Tento systém funguje najlepšie, keď má tlačiareň plochý tlačový povrch (napríklad sklo) a rovné koľajnice. Po úspešnom dokončení nástroja na vyrovnávanie lôžka by malo byť lôžko pripravené na tlač.

source: Fine grained bed screw adjustments
ru: Регулировка винтов с мелкозернистым слоем
sk: Jemnozrnné nastavenie skrutiek lôžka

source: If the printer uses three bed screws and all three screws are under the bed, then it may be possible to perform a second "high precision" bed leveling step. This is done by commanding the nozzle to locations where the bed moves a larger distance with each bed screw adjustment.
ru: Если в принтере используются три крепежных винта и все три винта находятся под крепежным элементом, возможно, удастся выполнить второй этап выравнивания "высокоточного" крепежного элемента. Это делается путем направления сопла в места, где слой перемещается на большее расстояние с каждой регулировкой винта слоя.
sk: Ak tlačiareň používa tri skrutky lôžka a všetky tri skrutky sú pod lôžkom, môže byť možné vykonať druhý krok „vysoko presného“ vyrovnania lôžka. To sa vykonáva prikázaním trysky na miesta, kde sa lôžko pohybuje na väčšiu vzdialenosť pri každom nastavení skrutky lôžka.

source: For example, consider a bed with screws at locations A, B, and C:
ru: Например, рассмотрим станину с винтами в местах A, B и C:
sk: Predstavte si napríklad posteľ so skrutkami na miestach A, B a C:

source: For each adjustment made to the bed screw at location C, the bed will swing along a pendulum defined by the remaining two bed screws (shown here as a green line). In this situation, each adjustment to the bed screw at C will move the bed at position D a further amount than directly at C. It is thus possible to make an improved C screw adjustment when the nozzle is at position D.
ru: При каждой регулировке винта основания в положении C основание будет качаться вдоль маятника, определяемого оставшимися двумя винтами основания (показано здесь зеленой линией). В этой ситуации каждая регулировка винта станины в положении C будет перемещать станину в положение D на большее расстояние, чем непосредственно в положении C. Таким образом, можно выполнить улучшенную регулировку винта C, когда сопло находится в положении D.
sk: Pri každom nastavení skrutky lôžka v mieste C sa lôžko bude otáčať pozdĺž kyvadla definovaného zvyšnými dvoma skrutkami lôžka (tu znázornené ako zelená čiara). V tejto situácii každé nastavenie skrutky lôžka v polohe C posunie lôžko v polohe D o viac ako priamo v polohe C. Je teda možné vykonať vylepšené nastavenie skrutky C, keď je dýza v polohe D.

source: To enable this feature, one would determine the additional nozzle coordinates and add them to the config file. For example, it might look like:
ru: Чтобы включить эту функцию, нужно определить дополнительные координаты сопла и добавить их в конфигурационный файл. Например, это может выглядеть так:
sk: Ak chcete povoliť túto funkciu, musíte určiť ďalšie súradnice trysky a pridať ich do konfiguračného súboru. Môže to vyzerať napríklad takto:

source: When this feature is enabled, the `BED_SCREWS_ADJUST` tool will first prompt for coarse adjustments directly above each screw position, and once those are accepted, it will prompt for fine adjustments at the additional locations. Continue to use `ACCEPT` and `ADJUSTED` at each position.
ru: Когда эта функция включена, инструмент `BED_SCREWS_ADJUST` сначала предложит выполнить грубую регулировку непосредственно над каждым положением винта, и как только они будут приняты, он предложит выполнить точную регулировку в дополнительных местах. Продолжайте использовать `ПРИНЯТЬ` и `СКОРРЕКТИРОВАНО` в каждой позиции.
sk: Keď je táto funkcia povolená, nástroj `BED_SCREWS_ADJUST` najskôr vyzve na hrubé úpravy priamo nad každou pozíciou skrutky, a keď budú akceptované, vyzve vás na jemné úpravy na ďalších miestach. Pokračujte v používaní `ACCEPT` a `ADJUSTED` na každej pozícii.

source: Adjusting bed leveling screws using the bed probe
ru: Регулировка винтов для выравнивания слоя с помощью датчика слоя
sk: Nastavenie vyrovnávacích skrutiek lôžka pomocou sondy lôžka

source: This is another way to calibrate the bed level using the bed probe. To use it you must have a Z probe (BL Touch, Inductive sensor, etc).
ru: Это еще один способ откалибровать уровень слоя с помощью датчика слоя. Чтобы использовать его, у вас должен быть Z-датчик (BL Touch, индуктивный датчик и т.д.).
sk: Toto je ďalší spôsob kalibrácie úrovne lôžka pomocou lôžkovej sondy. Aby ste ho mohli použiť, musíte mať Z sondu (BL Touch, indukčný senzor atď.).

source: To enable this feature, one would determine the nozzle coordinates such that the Z probe is above the screws, and then add them to the config file. For example, it might look like:
ru: Чтобы включить эту функцию, нужно определить координаты сопла таким образом, чтобы зонд Z находился над винтами, а затем добавить их в конфигурационный файл. Например, это может выглядеть так:
sk: Ak chcete povoliť túto funkciu, je potrebné určiť súradnice trysky tak, aby bola sonda Z nad skrutkami, a potom ich pridať do konfiguračného súboru. Môže to vyzerať napríklad takto:

source: This means that:
ru: Это означает, что:
sk: To znamená, že:

source: Repeat the process several times until you get a good level bed - normally when all adjustments are below 6 minutes.
ru: Повторите процесс несколько раз, пока не получите ровную поверхность - обычно, когда все регулировки выполняются менее чем за 6 минут.
sk: Opakujte postup niekoľkokrát, kým nedosiahnete dobrú rovnú posteľ - zvyčajne, keď sú všetky úpravy pod 6 minút.

source: If using a probe that is mounted on the side of the hotend (that is, it has an X or Y offset) then note that adjusting the bed tilt will invalidate any previous probe calibration that was performed with a tilted bed. Be sure to run [probe calibration](Probe_Calibrate.md) after the bed screws have been adjusted.
ru: При использовании датчика, установленного сбоку от нагревательного элемента (то есть со смещением по оси X или Y), обратите внимание, что регулировка наклона подставки приведет к аннулированию любой предыдущей калибровки датчика, выполненной с наклонной подставкой. Обязательно запустите [калибровка зонда](Probe_Calibrate.md ) после того, как будут отрегулированы винты основания.
sk: Ak používate sondu, ktorá je namontovaná na boku hotendu (t. j. má posunutie X alebo Y), všimnite si, že úprava sklonu lôžka zruší platnosť akejkoľvek predchádzajúcej kalibrácie sondy, ktorá bola vykonaná s nakloneným lôžkom. Po nastavení skrutiek lôžka nezabudnite spustiť [probe calibration](Probe_Calibrate.md).

source: The `MAX_DEVIATION` parameter is useful when a saved bed mesh is used, to ensure that the bed level has not drifted too far from where it was when the mesh was created. For example, `SCREWS_TILT_CALCULATE MAX_DEVIATION=0.01` can be added to the custom start gcode of the slicer before the mesh is loaded. It will abort the print if the configured limit is exceeded (0.01mm in this example), giving the user a chance to adjust the screws and restart the print.
ru: Параметр `MAX_DEVIATION` полезен, когда используется сохраненная сетка кровати, чтобы гарантировать, что уровень кровати не сместился слишком далеко от того места, где он был при создании сетки. Например, `SCREWS_TILT_CALCULATE MAX_DEVIATION=0.01` может быть добавлен в пользовательский начальный gcode слайсера перед загрузкой сетки. Это прервет печать, если будет превышен заданный предел (в данном примере 0,01 мм), давая пользователю возможность отрегулировать винты и перезапустить печать.
sk: Parameter MAX_DEVIATION je užitočný, keď sa používa uložená sieťka lôžka, aby sa zabezpečilo, že sa úroveň lôžka príliš neposunula od miesta, kde bola pri vytváraní siete. Napríklad `SCREWS_TILT_CALCULATE MAX_DEVIATION=0,01` možno pridať do vlastného počiatočného gkódu filtra pred načítaním siete. Tlač preruší, ak sa prekročí nakonfigurovaný limit (v tomto príklade 0,01 mm), čo dáva používateľovi možnosť nastaviť skrutky a reštartovať tlač.

source: Z_ENDSTOP_CALIBRATE
ru: Z_ENDSTOP_КАЛИБРОВАТЬ

source: BED_SCREWS_ADJUST
ru: ПРИКРОВАТНЫЕ ШУРУПЫ_РЕГУЛИРОВАТЬ

source: The screw1 is always the reference point for the others, so the system assumes that screw1 is at the correct height. Always run `G28` first and then run `SCREWS_TILT_CALCULATE` - it should produce output similar to:
ru: Винт 1 всегда является точкой отсчета для остальных, поэтому система предполагает, что винт 1 находится на правильной высоте. Всегда сначала запускайте `G28`, а затем `SCREWS_TILT_CALCULATE` - это должно привести к выводу, аналогичному:
sk: Skrutka1 je vždy referenčným bodom pre ostatné, takže systém predpokladá, že skrutka1 je v správnej výške. Vždy najprv spustite `G28` a potom spustite `SCREWS_TILT_CALCULATE` – mal by produkovať výstup podobný ako:

source: Send: G28 Recv: ok Send: SCREWS_TILT_CALCULATE Recv: // 01:20 means 1 full turn and 20 minutes, CW=clockwise, CCW=counter-clockwise Recv: // front left screw (base) : x=-5.0, y=30.0, z=2.48750 Recv: // front right screw : x=155.0, y=30.0, z=2.36000 : adjust CW 01:15 Recv: // rear right screw : y=155.0, y=190.0, z=2.71500 : adjust CCW 00:50 Recv: // read left screw : x=-5.0, y=190.0, z=2.47250 : adjust CW 00:02 Recv: ok
ru: Отправить: G28 Отзыв: ок Отправить: SCREWS_TILT_CALCULATE Recv: // 01:20 означает 1 полный оборот и 20 минут, CW=по часовой стрелке, CCW=против часовой стрелки Recv: // передний левый винт (основание) : x=-5.0, y=30.0, z=2.48750 Recv: // передний правый винт : x=155,0, y=30,0, z=2,36000 : отрегулируйте CW на 01:15 Recv: // задний правый винт : y=155,0, y=190,0, z=2,71500 : отрегулируйте против часовой стрелки на 00:50 Recv: // считайте левый винт : x=-5.0, y=190.0, z=2.47250 : отрегулируйте CW на 00:02 Отзыв: ок
