Repository: fran6p/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Overview.po
Languages: pl, pt_br, tr

source: Welcome to the Klipper documentation. If new to Klipper, start with the [features](Features.md) and [installation](Installation.md) documents.
pl: Witaj w dokumentacji Klipper. Jeśli jesteś nowy, zapoznaj się z [funkcjami](Features.md) i [instalacją](Installation.md).
pt_br: Bem-vindo à documentação do Klipper. Se for novo no Klipper, comece com os documentos de [recursos](Features.md) e [Instalação](Installation.md).
tr: Klipper dökümantasyonuna hoş geldiniz. Eğer Klipper'e yeni iseniz , [özellikler](Features.md) ve [kurulum](Installation.md) ile başlayabilirsiniz.

source: Overview information
pl: Ogólne informacje
pt_br: Informações gerais
tr: Genel Bakış Bilgileri

source: [Features](Features.md): A high-level list of features in Klipper.
pl: [Funkcje](Features.md): Szczegółowa lista funkcji w Klipperze.
pt_br: [Recursos](Features.md): Uma lista de alto nível dos recursos do Klipper.
tr: [Özellikler](Features.md): Klipper'ın sahip olduğu yüksek-seviye özellikler listesi.

source: [FAQ](FAQ.md): Frequently asked questions.
pl: [FAQ](FAQ.md): Często zadawane pytania.
pt_br: [FAQ](FAQ.md): Perguntas frequentes.
tr: [SSS](FAQ.md): Sıklıkla sorulan sorular.

source: [Releases](Releases.md): The history of Klipper releases.
pl: [Wydania](Releases.md): Historia wydań Klippera.
pt_br: [Lançamentos](Releases.md): O histórico de lançamentos do Klipper.
tr: [Sürümler](Releases.md): Klipper sürümleri.

source: [Config changes](Config_Changes.md): Recent software changes that may require users to update their printer config file.
pl: [Zmiany konfiguracji](Config_Changes.md): Ostatnie zmiany w oprogramowaniu, które mogą wymagać od użytkowników zaktualizowania pliku konfiguracyjnego drukarki.
pt_br: [Alterações de Configuração](Config_Changes.md): Mudanças recentes no software que podem exigir que os usuários atualizem o arquivo de configuração da impressora.
tr: [Yapı değişiklikleri](Config_Changes.md): Kullanıcıların yazıcı yapılandırma dosyasını değiştirmelerini gerektirebilecek son yazılım değişiklikleri.

source: [Contact](Contact.md): Information on bug reporting and general communication with the Klipper developers.
pl: [Kontakt](Contact.md): Informacje na temat zgłaszania błędów i ogólnej komunikacji z deweloperami Klippera.
pt_br: [Contato](Contact.md): Informações sobre como reportar erros (bugs) e comunicação geral com os desenvolvedores do Klipper.
tr: [İletişim](Contact.md): Hata raporlama ve Klipper geliştiricileri ile genel iletişim hakkında bilgiler.

source: [Installation](Installation.md): Guide to installing Klipper.
pl: [Instalacja](Installation.md): Przewodnik po instalacji Klippera.
pt_br: [Instalação](Installation.md): Guia de instalação do Klipper.
tr: [Kurulum](Installation.md): Klipper'ı indirmek için kılavuz.

source: [Config Reference](Config_Reference.md): Description of config parameters.
pl: [Odniesienie do konfiguracji](Config_Reference.md): Opis parametrów konfiguracji.
pt_br: [Referência de Configuração](Config_Reference.md): Descrição dos parâmetros de configuração.
tr: [Yapı Referansları](Config_Reference.md): Yapılandırma değişkenlerinin açıklamaları.

source: [Rotation Distance](Rotation_Distance.md): Calculating the rotation_distance stepper parameter.
pl: [Odległość obrotu](Rotation_Distance.md): Obliczanie parametru krokowego rotation_distance.
pt_br: [Distância de Rotação](Rotation_Distance.md): Calculando o parâmetro do motor de passo "rotation_distance".
tr: [Dönüş Mesafesi](Rotation_Distance.md): Step motor parametresi rotation_distance hesaplaması.

source: [Config checks](Config_checks.md): Verify basic pin settings in the config file.
pl: [Kontrola konfiguracji](Config_checks.md): Weryfikacja podstawowych ustawień pinów w pliku konfiguracyjnym.
pt_br: [Verificação de Configuração](Config_checks.md): Verificar as configurações básicas dos pinos no arquivo de configuração.
tr: [Konfigürasyon gözden geçirme](Config_checks.md): Konfigürasyon dosyasındaki temel pin ayarlarını doğrulayın.

source: [Bed level](Bed_Level.md): Information on "bed leveling" in Klipper.
pl: [Poziomowanie stołu](Bed_Level.md): Informacje na temat "poziomowania stołu" w Klipperze.
pt_br: [Nivelamento da Cama](Bed_Level.md): Informações sobre o "nivelamento da cama" no Klipper.
tr: [Baskı yatağı düzeyi](Bed_Level.md): Klipper'da "baskı yatağı düzeyleme" hakkında bilgi.

source: [Delta calibrate](Delta_Calibrate.md): Calibration of delta kinematics.
pl: [Kalibracja delta](Delta_Calibrate.md): Kalibracja kinematyki delta.
pt_br: [Calibração Delta](Delta_Calibrate.md): Calibração da cinemática delta.
tr: [Delta ayarı](Delta_Calibrate.md): Delta kinematik kalibrasyonu.

source: [Probe calibrate](Probe_Calibrate.md): Calibration of automatic Z probes.
pl: [Kalibracja sondy](Probe_Calibrate.md): Kalibracja automatycznych sond Z.
pt_br: [Calibração da Sonda](Probe_Calibrate.md): Calibração das sondas automáticas de Z.
tr: [Probe ayarı](Probe_Calibrate.md): Otomatik Z probe'larının kalibrasyonu.

source: [BL-Touch](BLTouch.md): Configure a "BL-Touch" Z probe.
pl: [BL-Touch](BLTouch.md): Konfiguracja sondy Z "BL-Touch".
pt_br: [BL-Touch](BLTouch.md): Configurar uma sonda Z "BL-Touch".
tr: [BL-Touch](BLTouch.md): Bir "BL-Touch" Z probu yapılandırın.

source: [Manual level](Manual_Level.md): Calibration of Z endstops (and similar).
pl: [Ręczne poziomowanie](Manual_Level.md): Kalibracja krańcówek Z (i podobnych).
pt_br: [Nivelamento Manual](Manual_Level.md): Calibração de fim de curso de Z (e similares).
tr: [Manuel seviye](Manual_Level.md): Z uç duraklarının (ve benzeri) kalibrasyonu.

source: [Bed Mesh](Bed_Mesh.md): Bed height correction based on XY locations.
pl: [Siatka stołu](Bed_Mesh.md): Korekcja wysokości stołu na podstawie lokalizacji XY.
pt_br: [Malha da Cama](Bed_Mesh.md): Correção de altura da cama baseada em coordenadas XY.
tr: [Bed Mesh](Bed_Mesh.md): XY konumlarına dayalı yatak yüksekliği düzeltmesi.

source: [Endstop phase](Endstop_Phase.md): Stepper assisted Z endstop positioning.
pl: [Faza krańcówki](Endstop_Phase.md): Pozycjonowanie krańcówki Z ze wspomaganiem krokowym.
pt_br: [Fase do Fim de Curso](Endstop_Phase.md): Posicionamento do fim de curso de Z assistido por motor de passo.
tr: [Son durdurma aşaması](Endstop_Phase.md): Kademeli destekli Z uç durdurma konumlandırması.

source: [Resonance compensation](Resonance_Compensation.md): A tool to reduce ringing in prints.
pl: [Kompensacja rezonansu](Resonance_Compensation.md): Narzędzie do redukcji dzwonienia w wydrukach.
pt_br: [Compensação de ressonância](Resonance_Compensation.md): Uma ferramenta para reduzir o ringing (vibrações indesejadas) nas impressões.
tr: [Rezonans telafisi](Resonance_Compensation.md): Baskılardaki çınlamayı azaltan bir araç.

source: [Measuring resonances](Measuring_Resonances.md): Information on using adxl345 accelerometer hardware to measure resonance.
pl: [Pomiar rezonansów](Measuring_Resonances.md): Informacje na temat używania sprzętowego akcelerometru adxl345 do pomiaru rezonansu.
pt_br: [Medindo ressonâncias](Measuring_Resonances.md): Informações sobre como usar um acelerômetro adxl345 para medir ressonâncias.
tr: [Rezonansların ölçülmesi](Measuring_Resonances.md): Rezonansı ölçmek için adxl345 ivmeölçer donanımının kullanılmasına ilişkin bilgiler.

source: [Pressure advance](Pressure_Advance.md): Calibrate extruder pressure.
pl: [Natężenie docisku](Pressure_Advance.md): Kalibracja docisku wytłaczarki (Pressure Advance).
pt_br: [Avanço de pressão](Pressure_Advance.md): Calibrar a pressão do extrusor.
tr: [Basınç ilerlemesi](Pressure_Advance.md): Ekstruder basıncını kalibre edin.

source: [Slicers](Slicers.md): Configure "slicer" software for Klipper.
pl: [Slicery](Slicers.md): Konfiguracja oprogramowania "slicer" dla Klippera.
pt_br: [Slicers](Slicers.md): Configurar o software "slicer" (fatiador) para o Klipper.
tr: [Dilimleyiciler](Slicers.md): Klipper için "dilimleyici" yazılımını yapılandırın.

source: [Command Templates](Command_Templates.md): G-Code macros and conditional evaluation.
pl: [Szablony poleceń](Command_Templates.md): Makra kodu G i ocena warunkowa.
pt_br: [Modelos de comandos](Command_Templates.md): Macros G-Code e avaliação condicional.
tr: [Komut Şablonları](Command_Templates.md): G Kodu makroları ve koşullu değerlendirme.

source: [Status Reference](Status_Reference.md): Information available to macros (and similar).
pl: [Referencje statusu](Status_Reference.md): Informacje dostępne dla makr (i podobnych).
pt_br: [Referência de Status](Status_Reference.md): Informações disponíveis para macros (e similares).
tr: [Durum Referansı](Status_Reference.md): Makrolar (ve benzerleri) tarafından kullanılabilen bilgiler.

source: [TMC Drivers](TMC_Drivers.md): Using Trinamic stepper motor drivers with Klipper.
pl: [Sterowniki TMC](TMC_Drivers.md): Używanie sterowników silników krokowych Trinamic z Klipperem.
pt_br: [Drivers TMC](TMC_Drivers.md): Usando drivers de motor de passo Trinamic com Klipper.
tr: [TMC Drivers](TMC_Drivers.md): Klipper ile Trinamic step motor sürücülerini kullanma.

source: [PWM tools](Using_PWM_Tools.md): Guide on how to use PWM controlled tools such as lasers or spindles.
pl: [Narzędzia PWM](Using_PWM_Tools.md): Przewodnik po tym, jak korzystać z narzędzi sterowanych PWM, takich jak lasery lub wrzeciona.
pt_br: [Ferramentas PWM](Using_PWM_Tools.md): Guia sobre como usar ferramentas controladas por PWM, como lasers ou fresas.
tr: [PWM araçları](Using_PWM_Tools.md): Lazerler veya iş milleri gibi PWM kontrollü araçların nasıl kullanılacağına ilişkin kılavuz.

source: [G-Codes](G-Codes.md): Information on commands supported by Klipper.
pl: [Kody G](G-Codes.md): Informacje o poleceniach obsługiwanych przez Klippera.
pt_br: [G-Codes](G-Codes.md): Informações sobre comandos suportados pelo Klipper.
tr: [G-Codes](G-Codes.md): Klipper tarafından desteklenen komutlara ilişkin bilgiler.

source: Developer Documentation
pl: Dokumentacja dla programistów
pt_br: Documentação do Desenvolvedor
tr: Geliştirici Belgeleri

source: [Code overview](Code_Overview.md): Developers should read this first.
pl: [Przegląd kodu](Code_Overview.md): Deweloperzy powinni przeczytać to w pierwszej kolejności.
pt_br: [Visão Geral do Código](Code_Overview.md): Os desenvolvedores devem ler isso primeiro.
tr: [Koda genel bakış](Code_Overview.md): Geliştiriciler önce bunu okumalıdır.

source: [Kinematics](Kinematics.md): Technical details on how Klipper implements motion.
pl: [Kinematyka](Kinematics.md): Szczegóły techniczne dotyczące sposobu, w jaki Klipper implementuje ruch.
pt_br: [Cinemática](Kinematics.md): Detalhes técnicos de como o Klipper implementa o movimento.
tr: [Kinematics](Kinematics.md): Klipper'ın hareketi nasıl uyguladığına ilişkin teknik ayrıntılar.

source: [Protocol](Protocol.md): Information on the low-level messaging protocol between host and micro-controller.
pl: [Protokół](Protocol.md): Informacje na temat niskopoziomowego protokołu przesyłania wiadomości między hostem a mikrokontrolerem.
pt_br: [Protocolo](Protocol.md): Informações sobre o protocolo de mensagens de baixo nível entre host e microcontrolador.
tr: [Protokol](Protocol.md): Ana bilgisayar ile mikro denetleyici arasındaki düşük düzey mesajlaşma protokolü hakkında bilgi.

source: [API Server](API_Server.md): Information on Klipper's command and control API.
pl: [Serwer API](API_Server.md): Informacje na temat interfejsu API poleceń i sterowania Klippera.
pt_br: [Servidor API](API_Server.md): Informações sobre a API de comando e controle do Klipper.
tr: [API Sunucusu](API_Server.md): Klipper'ın komut ve kontrol API'si hakkında bilgi.

source: [MCU commands](MCU_Commands.md): A description of low-level commands implemented in the micro-controller software.
pl: [Polecenia MCU](MCU_Commands.md): Opis niskopoziomowych poleceń zaimplementowanych w oprogramowaniu mikrokontrolera.
pt_br: [Comandos MCU](MCU_Commands.md): Uma descrição dos comandos de baixo nível implementados no software do microcontrolador.
tr: [MCU komutları](MCU_Commands.md): Mikro denetleyici yazılımında uygulanan düşük seviyeli komutların açıklaması.

source: [CAN bus protocol](CANBUS_protocol.md): Klipper CAN bus message format.
pl: [Protokół magistrali CAN](CANBUS_protocol.md): Format wiadomości magistrali CAN Klippera.
pt_br: [Protocolo de barramento CAN](CANBUS_protocol.md): Formato de mensagem do barramento CAN do Klipper.
tr: [CAN veri yolu protokolü](CANBUS_protocol.md): Klipper CAN veri yolu mesaj formatı.

source: [Debugging](Debugging.md): Information on how to test and debug Klipper.
pl: [Debugowanie](Debugowanie.md): Informacje na temat testowania i debugowania Klippera.
pt_br: [Depuração](Debugging.md): Informações sobre como testar e depurar o Klipper.
tr: [Hata Ayıklama](Debugging.md): Klipper'ın nasıl test edileceği ve hata ayıklanacağı hakkında bilgi.

source: [Benchmarks](Benchmarks.md): Information on the Klipper benchmark method.
pl: [Benchmarki](Benchmarks.md): Informacje na temat metody benchmarku Klippera.
pt_br: [Benchmarks](Benchmarks.md): Informações sobre o método de medição de performance do Klipper.

source: [Contributing](CONTRIBUTING.md): Information on how to submit improvements to Klipper.
pl: [Współtworzenie](CONTRIBUTING.md): Informacje o tym, jak dodawać ulepszenia do Klippera.
pt_br: [Contribuindo](CONTRIBUTING.md): Informações sobre como enviar melhorias para o Klipper.

source: [Packaging](Packaging.md): Information on building OS packages.
pl: [Pakowanie](Packaging.md): Informacje na temat budowania pakietów systemu operacyjnego.
pt_br: [Empacotamento](Packaging.md): Informações sobre a construção de pacotes de sistema operacional.

source: Device Specific Documents
pl: Dokumenty specyficzne dla urządzenia
pt_br: Documentos de Dispositivos Específicos

source: [Example configs](Example_Configs.md): Information on adding an example config file to Klipper.
pl: [Przykładowe konfiguracje](Example_Configs.md): Informacje na temat dodawania przykładowego pliku konfiguracyjnego do Klippera.
pt_br: [Configurações de exemplo](Example_Configs.md): Informação de como adicionar um arquivo de configuração de exemplo no Klipper.

source: [SDCard Updates](SDCard_Updates.md): Flash a micro-controller by copying a binary to an sdcard in the micro-controller.
pl: [Aktualizacje kartą SD](SDCard_Updates.md): Flashowanie mikrokontrolera poprzez skopiowanie pliku binarnego na kartę SD w mikrokontrolerze.
pt_br: [Atualizações do Cartão SD](SDCard_Updates.md): Programar um microcontrolador copiando um binário para um cartão SD no microcontrolador.

source: [Raspberry Pi as Micro-controller](RPi_microcontroller.md): Details for controlling devices wired to the GPIO pins of a Raspberry Pi.
pl: [Raspberry Pi jako mikrokontroler](RPi_microcontroller.md): Szczegóły dotyczące sterowania urządzeniami podłączonymi do pinów GPIO Raspberry Pi.
pt_br: [Raspberry Pi como Microcontrolador](RPi_microcontroller.md): Detalhes para controlar dispositivos conectados aos pinos GPIO de um Raspberry Pi.

source: [Bootloaders](Bootloaders.md): Developer information on micro-controller flashing.
pl: [Bootloadery](Bootloaders.md): Informacje dla programistów dotyczące flashowania mikrokontrolerów.
pt_br: [Bootloaders](Bootloaders.md): Informações de desenvolvedor sobre a gravação de microcontrolador.

source: [CAN bus](CANBUS.md): Information on using CAN bus with Klipper.
pl: [Magistrala CAN](CANBUS.md): Informacje na temat korzystania z magistrali CAN z Klipperem.
pt_br: [Barramento CAN](CANBUS.md): Informações sobre o uso do barramento CAN com Klipper.

source: [TSL1401CL filament width sensor](TSL1401CL_Filament_Width_Sensor.md)
pl: [Czujnik szerokości filamentu TSL1401CL](TSL1401CL_Filament_Width_Sensor.md)
pt_br: [Sensor de largura de filamento TSL1401CL](TSL1401CL_Filament_Width_Sensor.md)

source: Overview
pl: Przegląd
pt_br: Visão geral

source: Installation and Configuration
pl: Instalacja i konfiguracja
pt_br: Instalação e Configuração

source: [Multi-MCU Homing](Multi_MCU_Homing.md): Homing and probing using multiple micro-controllers.
pl: [Bazowanie MultiMCU](Multi_MCU_Homing.md): Bazowanie i sondowanie przy użyciu wielu mikrokontrolerów.
pt_br: [Homing Multi-MCU](Multi_MCU_Homing.md): Homing e sondagem usando múltiplos microcontroladores.

source: [Skew correction](Skew_Correction.md): Adjustments for axes not perfectly square.
pl: [Korekta przekrzywienia](Skew_Correction.md): Korekty dla osi, które nie są idealnie prostopadłe.
pt_br: [Correção de Distorção](Skew_Correction.md): Ajustes para eixos não perfeitamente quadrados.

source: [Beaglebone](Beaglebone.md): Details for running Klipper on the Beaglebone PRU.
pl: [Beaglebone](Beaglebone.md): Szczegóły dotyczące uruchamiania Klippera na Beaglebone PRU.
pt_br: [Beaglebone](Beaglebone.md): Detalhes para rodar Klipper no Beaglebone PRU.

source: [Hall filament width sensor](Hall_Filament_Width_Sensor.md)
pl: [Czujnik szerokości filamentu Halla](Hall_Filament_Width_Sensor.md)
pt_br: [Sensor de largura de filamento Hall](Hall_Filament_Width_Sensor.md)

source: [Exclude Object](Exclude_Object.md): The guide to the Exclude Objects implementation.
pl: [Wykluczanie obiektów](Exclude_Object.md): Przewodnik po implementacji wykluczania obiektów (Exclude Objects).
pt_br: [Excluir Objeto](Exclude_Object.md): O guia para a implementação de Excluir Objetos.
