Repository: fran6p/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Probe_Calibrate.po
Languages: ru, sk

source: Recv: // probe accuracy: at X:0.000 Y:0.000 Z:10.000 Recv: // and read 10 times with speed of 5 mm/s Recv: // probe at -0.003,0.005 is z=2.506948 Recv: // probe at -0.003,0.005 is z=2.519448 Recv: // probe at -0.003,0.005 is z=2.519448 Recv: // probe at -0.003,0.005 is z=2.506948 Recv: // probe at -0.003,0.005 is z=2.519448 Recv: // probe at -0.003,0.005 is z=2.519448 Recv: // probe at -0.003,0.005 is z=2.506948 Recv: // probe at -0.003,0.005 is z=2.506948 Recv: // probe at -0.003,0.005 is z=2.519448 Recv: // probe at -0.003,0.005 is z=2.506948 Recv: // probe accuracy results: maximum 2.519448, minimum 2.506948, range 0.012500, average 2.513198, median 2.513198, standard deviation 0.006250
ru: Recv: // Точность зонда: при X:0.000 Y:0.000 Z:10.000 Recv: // и считать 10 раз со скоростью 5 мм/с Recv: // зонд в точках -0.003,0.005 имеет значение z=2.506948 Recv: // зонд в точке -0.003,0.005 имеет значение z=2.519448 Recv: // probe at -0.003,0.005 is z=2.519448 Recv: // probe at -0.003,0.005 is z=2.506948 Recv: // probe at -0.003,0.005 is z=2.519448 Recv: // probe at -0.003,0.005 is z=2.519448 Recv: // probe at -0.003,0.005 is z=2.506948 Recv: // probe at -0.003,0.005 is z=2.506948 Recv: // probe at -0.003,0.005 is z=2.519448 Recv: // probe at -0.003,0.005 is z=2.506948 Recv: // результаты точности зондирования: максимум 2,519448, минимум 2,506948, диапазон 0,012500, среднее 2,513198, медиана 2,513198, стандартное отклонение 0,006250

source: Probe calibration
ru: Калибровка датчика
sk: Kalibrácia sondy

source: This document describes the method for calibrating the X, Y, and Z offsets of an "automatic z probe" in Klipper. This is useful for users that have a `[probe]` or `[bltouch]` section in their config file.
ru: В этом документе описывается метод калибровки смещений X, Y и Z "автоматического датчика z" в Klipper. Это полезно для пользователей, у которых в конфигурационном файле есть секция `[probe]` или `[bltouch]`.
sk: Tento dokument popisuje metódu kalibrácie X, Y a Z offsetov "automatickej z sondy" v Klipper. Toto je užitočné pre používateľov, ktorí majú vo svojom konfiguračnom súbore sekciu `[probe]` alebo `[bltouch]`.

source: If the results of the test show a range value that is greater than 25 microns (.025mm) then the probe does not have sufficient accuracy for typical bed leveling procedures. It may be possible to tune the probe speed and/or probe start height to improve the repeatability of the probe. The `PROBE_ACCURACY` command allows one to run tests with different parameters to see their impact - see the [G-Codes document](G-Codes.md#probe_accuracy) for further details. If the probe generally obtains repeatable results but has an occasional outlier, then it may be possible to account for that by using multiple samples on each probe - read the description of the probe `samples` config parameters in the [config reference](Config_Reference.md#probe) for more details.
ru: Если результаты теста показывают значение диапазона, превышающее 25 микрон (.025 мм), значит, точность датчика недостаточна для типичных процедур выравнивания станины. Возможно, для повышения повторяемости измерений можно отрегулировать скорость перемещения датчика и/или высоту его старта. Команда `PROBE_ACCURACY` позволяет проводить тесты с различными параметрами для определения их влияния - более подробная информация приведена в документе [G-Codes](G-Codes.md#probe_accuracy). Если зонд в целом дает воспроизводимые результаты, но иногда имеет отклонения от нормы, то это можно учесть, используя несколько образцов для каждого зонда - подробнее об этом читайте в описании параметров конфигурации зонда `samples в документе [config reference](Config_Reference.md#probe).
sk: Ak výsledky testu ukazujú hodnotu rozsahu, ktorá je väčšia ako 25 mikrónov (0,025 mm), potom sonda nemá dostatočnú presnosť pre typické postupy vyrovnávania lôžka. Môže byť možné vyladiť rýchlosť sondy a/alebo počiatočnú výšku sondy, aby sa zlepšila opakovateľnosť sondy. Príkaz `PROBE_ACCURACY` umožňuje spustiť testy s rôznymi parametrami, aby ste videli ich vplyv – ďalšie podrobnosti nájdete v [dokumente G-Codes](G-Codes.md#probe_accuracy). Ak sonda vo všeobecnosti dosahuje opakovateľné výsledky, ale má príležitostnú odľahlú hodnotu, potom je možné to zohľadniť použitím viacerých vzoriek na každej sonde – prečítajte si popis konfiguračných parametrov „vzorky“ sondy v [config reference](Config_Reference.md#probe) pre ďalšie podrobnosti.
