Repository: fran6p/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Probe_Calibrate.po
Languages: ru, sk

source: Calibrating probe X and Y offsets
ru: Калибровка смещений X и Y зонда
sk: Kalibrácia odchýlok X a Y sondy

source: To calibrate the X and Y offset, navigate to the OctoPrint "Control" tab, home the printer, and then use the OctoPrint jogging buttons to move the head to a position near the center of the bed.
ru: Чтобы откалибровать смещение X и Y, перейдите на вкладку OctoPrint "Управление" ("Control"), запустите принтер, а затем используйте кнопки переключения OctoPrint для перемещения головки в положение, близкое к центру станины.
sk: Ak chcete kalibrovať posun X a Y, prejdite na kartu „Ovládanie“ OctoPrint, umiestnite tlačiareň do pôvodnej polohy a potom pomocou posúvacích tlačidiel OctoPrint posuňte hlavu do polohy blízko stredu postele.

source: Place a piece of blue painters tape (or similar) on the bed underneath the probe. Navigate to the OctoPrint "Terminal" tab and issue a PROBE command:
ru: Положите кусок синей малярной ленты (или аналогичной) на ложе под зондом. Перейдите на вкладку OctoPrint "Терминал" (Terminal) и введите команду проверки:
sk: Položte kúsok modrej maliarskej pásky (alebo podobnej) na posteľ pod sondu. Prejdite na kartu „Terminál“ OctoPrint a zadajte príkaz PROBE:

source: Place a mark on the tape directly under where the probe is (or use a similar method to note the location on the bed).
ru: Сделайте отметку на ленте непосредственно под тем местом, где находится зонд (или используйте аналогичный метод, чтобы отметить местоположение на кровати).
sk: Umiestnite značku na pásku priamo pod miesto, kde je sonda (alebo použite podobnú metódu na zaznamenanie umiestnenia na posteli).

source: Issue a `GET_POSITION` command and record the toolhead XY location reported by that command. For example if one sees:
ru: Выдать команду `GET_POSITION` и записать положение инструментальной головки по оси XY, сообщенное этой командой. Например, если вы видите:
sk: Vydajte príkaz `GET_POSITION` a zaznamenajte polohu hlavy nástroja XY hlásenú týmto príkazom. Napríklad, ak niekto vidí:

source: then one would record a probe X position of 46.5 and probe Y position of 27.
ru: то можно записать положение зонда X, равное 46,5, и положение зонда Y, равное 27.
sk: potom by sa zaznamenala poloha X sondy 46,5 a poloha sondy Y 27.

source: After recording the probe position, issue a series of G1 commands until the nozzle is directly above the mark on the bed. For example, one might issue:
ru: Зафиксировав положение зонда, подайте серию команд G1 до тех пор, пока сопло не окажется непосредственно над меткой на станине. Например, можно выдать:
sk: Po zaznamenaní polohy sondy zadajte sériu príkazov G1, kým nebude tryska priamo nad značkou na lôžku. Napríklad, jeden by mohol vydať:

source: to move the nozzle to an X position of 57 and Y of 30. Once one finds the position directly above the mark, use the `GET_POSITION` command to report that position. This is the nozzle position.
ru: для перемещения сопла в положение по оси X, равное 57, и по оси Y, равное 30. Найдя положение непосредственно над меткой, с помощью команды `GET_POSITION` сообщите это положение. Это и есть положение сопла.
sk: na posunutie dýzy do polohy X 57 a Y 30. Keď nájdete polohu priamo nad značkou, použite príkaz `GET_POSITION` na ohlásenie tejto polohy. Toto je poloha trysky.

source: The x_offset is then the `nozzle_x_position - probe_x_position` and y_offset is similarly the `nozzle_y_position - probe_y_position`. Update the printer.cfg file with the given values, remove the tape/marks from the bed, and then issue a `RESTART` command so that the new values take effect.
ru: В этом случае x_offset равно `nozzle_x_position - probe_x_position`, а y_offset аналогично `nozzle_y_position - probe_y_position`. Обновите файл printer.cfg с заданными значениями, удалите ленту/марки со станины, а затем выполните команду `RESTART`, чтобы новые значения вступили в силу.
sk: X_offset je potom `poloha_x_dýzy - poloha_x_sondy` a y_offset je podobne `poloha_y_dýzy - poloha_y_ sondy`. Aktualizujte súbor printer.cfg s danými hodnotami, odstráňte pásku/značky z lôžka a potom zadajte príkaz `RESTART`, aby sa nové hodnoty prejavili.

source: Calibrating probe Z offset
ru: Калибровка датчика со смещением по оси Z
sk: Kalibračná sonda Z offset

source: Providing an accurate probe z_offset is critical to obtaining high quality prints. The z_offset is the distance between the nozzle and bed when the probe triggers. The Klipper `PROBE_CALIBRATE` tool can be used to obtain this value - it will run an automatic probe to measure the probe's Z trigger position and then start a manual probe to obtain the nozzle Z height. The probe z_offset will then be calculated from these measurements.
ru: Обеспечение точного смещения датчика z_offset имеет решающее значение для получения высококачественных отпечатков. Смещение z_offset - это расстояние между соплом и станиной в момент срабатывания датчика. Для получения этого значения можно использовать инструмент Klipper `PROBE_CALIBRATE` - он запускает автоматический датчик для измерения положения триггера датчика по оси Z, а затем запускает ручной датчик для получения высоты сопла по оси Z. Затем на основе этих измерений будет рассчитано смещение зонда по оси z.
sk: Poskytnutie presnej sondy z_offset je rozhodujúce pre získanie vysoko kvalitných výtlačkov. Z_offset je vzdialenosť medzi tryskou a lôžkom, keď sa sonda spustí. Na získanie tejto hodnoty je možné použiť nástroj Klipper `PROBE_CALIBRATE` – spustí automatickú sondu na meranie polohy spúšťania Z sondy a potom spustí manuálnu sondu na získanie výšky Z trysky. Z týchto meraní sa potom vypočíta z_offset sondy.

source: Start by homing the printer and then move the head to a position near the center of the bed. Navigate to the OctoPrint terminal tab and run the `PROBE_CALIBRATE` command to start the tool.
ru: Начните с наведения принтера, а затем переместите головку в положение, близкое к центру станины. Перейдите на вкладку терминала OctoPrint и выполните команду `PROBE_CALIBRATE` для запуска инструмента.
sk: Začnite umiestnením tlačiarne a potom presuňte hlavu do polohy blízko stredu postele. Prejdite na kartu terminálu OctoPrint a spustite nástroj `PROBE_CALIBRATE`.

source: This tool will perform an automatic probe, then lift the head, move the nozzle over the location of the probe point, and start the manual probe tool. If the nozzle does not move to a position above the automatic probe point, then `ABORT` the manual probe tool and perform the XY probe offset calibration described above.
ru: Этот инструмент выполнит автоматический зонд, затем поднимет головку, переместит сопло над точкой зондирования и запустит инструмент ручного зондирования. Если сопло не перемещается в положение над точкой автоматического зондирования, то следует `АБОРТИРОВАТЬ` инструмент ручного зондирования и выполнить калибровку смещения зонда по оси XY, описанную выше.
sk: Tento nástroj vykoná automatickú sondu, potom zdvihne hlavu, presunie dýzu nad miesto bodu sondy a spustí ručnú sondu. Ak sa dýza nepohne do polohy nad bodom automatickej sondy, potom `ABORT` nástroj manuálnej sondy a vykonajte vyššie opísanú kalibráciu posunu sondy XY.

source: Once the manual probe tool starts, follow the steps described at ["the paper test"](Bed_Level.md#the-paper-test)) to determine the actual distance between the nozzle and bed at the given location. Once those steps are complete one can `ACCEPT` the position and save the results to the config file with:
ru: После запуска инструмента ручного зондирования выполните действия, описанные в разделе ["тест бумаги"](Bed_Level.md#the-paper-test)], чтобы определить фактическое расстояние между соплом и станиной в заданном месте. По завершении этих действий можно `принять` позицию и сохранить результаты в файле конфигурации с помощью:
sk: Po spustení nástroja manuálnej sondy postupujte podľa krokov popísaných v časti ["test papiera"](Bed_Level.md#the-paper-test)), aby ste určili skutočnú vzdialenosť medzi tryskou a lôžkom na danom mieste. Po dokončení týchto krokov môžete pozíciu `ACCEPT` a uložiť výsledky do konfiguračného súboru pomocou:

source: Note that if a change is made to the printer's motion system, hotend position, or probe location then it will invalidate the results of PROBE_CALIBRATE.
ru: Обратите внимание, что если изменить систему перемещения принтера, положение хотэнда или расположение датчика, то это приведет к аннулированию результатов PROBE_CALIBRATE.
sk: Všimnite si, že ak sa vykoná zmena v pohybovom systéme tlačiarne, polohe hotendu alebo umiestnení sondy, výsledky PROBE_CALIBRATE sa zneplatnia.

source: If the probe has an X or Y offset and the bed tilt is changed (eg, by adjusting bed screws, running DELTA_CALIBRATE, running Z_TILT_ADJUST, running QUAD_GANTRY_LEVEL, or similar) then it will invalidate the results of PROBE_CALIBRATE. After making any of the above adjustments it will be necessary to run PROBE_CALIBRATE again.
ru: Если зонд имеет смещение по X или Y, а наклон станины изменен (например, путем регулировки винтов станины, выполнения DELTA_CALIBRATE, Z_TILT_ADJUST, QUAD_GANTRY_LEVEL и т.п.), то результаты PROBE_CALIBRATE окажутся недействительными. После выполнения любой из перечисленных выше корректировок необходимо повторно запустить PROBE_CALIBRATE.
sk: Ak má sonda posunutie X alebo Y a zmení sa sklon lôžka (napr. nastavením skrutiek lôžka, spustením DELTA_CALIBRATE, spustením Z_TILT_ADJUST, spustením QUAD_GANTRY_LEVEL alebo podobne), budú výsledky PROBE_CALIBRATE neplatné. Po vykonaní niektorej z vyššie uvedených úprav bude potrebné znova spustiť PROBE_CALIBRATE.

source: If the results of PROBE_CALIBRATE are invalidated, then any previous [bed mesh](Bed_Mesh.md) results that were obtained using the probe are also invalidated - it will be necessary to rerun BED_MESH_CALIBRATE after recalibrating the probe.
ru: Если результаты PROBE_CALIBRATE недействительны, то все предыдущие результаты [bed mesh](Bed_Mesh.md), полученные с помощью зонда, также будут недействительны - необходимо будет повторно запустить BED_MESH_CALIBRATE после повторной калибровки зонда.
sk: Ak sú výsledky PROBE_CALIBRATE neplatné, potom všetky predchádzajúce [bed mesh](Bed_Mesh.md) výsledky, ktoré boli získané pomocou sondy, sú tiež neplatné – po prekalibrovaní sondy bude potrebné znova spustiť BED_MESH_CALIBRATE.

source: Repeatability check
ru: Проверка воспроизводимости
sk: Kontrola opakovateľnosti

source: After calibrating the probe X, Y, and Z offsets it is a good idea to verify that the probe provides repeatable results. Start by homing the printer and then move the head to a position near the center of the bed. Navigate to the OctoPrint terminal tab and run the `PROBE_ACCURACY` command.
ru: После калибровки смещений датчика по осям X, Y и Z следует убедиться в том, что датчик обеспечивает повторяемость результатов. Начните с самонаведения принтера, затем переместите головку в положение, близкое к центру станины. Перейдите на вкладку терминала OctoPrint и выполните команду `PROBE_ACCURACY`.
sk: Po kalibrácii offsetov X, Y a Z sondy je dobré overiť, či sonda poskytuje opakovateľné výsledky. Začnite umiestnením tlačiarne a potom presuňte hlavu do polohy blízko stredu postele. Prejdite na kartu terminálu OctoPrint a spustite príkaz `PROBE_ACCURACY`.

source: This command will run the probe ten times and produce output similar to the following:
ru: Эта команда запустит зонд десять раз и выдаст результаты, аналогичные приведенным ниже:
sk: Tento príkaz spustí sondu desaťkrát a vytvorí výstup podobný nasledujúcemu:

source: Ideally the tool will report an identical maximum and minimum value. (That is, ideally the probe obtains an identical result on all ten probes.) However, it's normal for the minimum and maximum values to differ by one Z "step distance" or up to 5 microns (.005mm). A "step distance" is `rotation_distance/(full_steps_per_rotation*microsteps)`. The distance between the minimum and the maximum value is called the range. So, in the above example, since the printer uses a Z step distance of .0125, a range of 0.012500 would be considered normal.
ru: В идеальном случае инструмент выдает одинаковое максимальное и минимальное значение. (То есть в идеале датчик получает идентичный результат на всех десяти зондах). Однако нормальной является ситуация, когда минимальное и максимальное значения отличаются на один Z "шаг" или до 5 микрон (.005 мм). Расстояние "шага" равно `расстояние_вращения/(полные_шаги_на_вращение*микрошаги)`. Расстояние между минимальным и максимальным значением называется диапазоном. Так, в приведенном выше примере, поскольку принтер использует расстояние шага по Z, равное .0125, нормальным считается диапазон 0,012500.
sk: V ideálnom prípade bude nástroj hlásiť rovnakú maximálnu a minimálnu hodnotu. (To znamená, že v ideálnom prípade sonda získa identický výsledok na všetkých desiatich sondách.) Je však normálne, že sa minimálne a maximálne hodnoty líšia o jedno Z "kroková vzdialenosť" alebo až o 5 mikrónov (0,005 mm). "Vzdialenosť krokov" je `rotation_distance/(full_steps_per_rotation*microsteps)`. Vzdialenosť medzi minimálnou a maximálnou hodnotou sa nazýva rozsah. Takže vo vyššie uvedenom príklade, keďže tlačiareň používa vzdialenosť kroku Z 0,0125, rozsah 0,012500 by sa považoval za normálny.

source: If new probe speed, samples count, or other settings are needed, then update the printer.cfg file and issue a `RESTART` command. If so, it is a good idea to [calibrate the z_offset](#calibrating-probe-z-offset) again. If repeatable results can not be obtained then don't use the probe for bed leveling. Klipper has several manual probing tools that can be used instead - see the [Bed Level document](Bed_Level.md) for further details.
ru: Если требуется новая скорость зонда, количество образцов или другие настройки, то обновите файл printer.cfg и выполните команду `RESTART`. В этом случае целесообразно еще раз [откалибровать смещение z_offset](#calibrating-probe-z-offset). Если воспроизводимые результаты не могут быть получены, то не используйте зонд для выравнивания станины. В Klipper есть несколько инструментов для ручного зондирования, которые можно использовать вместо него - более подробную информацию см. в документе [Bed Level](Bed_Level.md).
sk: Ak je potrebná nová rýchlosť sondy, počet vzoriek alebo iné nastavenia, aktualizujte súbor printer.cfg a zadajte príkaz `RESTART`. Ak áno, je dobré znova [kalibrovať z_offset](#calibrating-probe-z-offset). Ak nie je možné dosiahnuť opakovateľné výsledky, nepoužívajte sondu na vyrovnávanie lôžka. Klipper má niekoľko ručných snímacích nástrojov, ktoré možno použiť namiesto toho – ďalšie podrobnosti nájdete v [Bed Level document](Bed_Level.md).

source: Location Bias Check
ru: Проверка смещения местоположения
sk: Kontrola skreslenia polohy

source: Some probes can have a systemic bias that corrupts the results of the probe at certain toolhead locations. For example, if the probe mount tilts slightly when moving along the Y axis then it could result in the probe reporting biased results at different Y positions.
ru: Некоторые датчики могут иметь системное смещение, искажающее результаты измерений в определенных точках инструментальной головки. Например, если крепление датчика немного наклоняется при перемещении вдоль оси Y, то это может привести к тому, что датчик будет выдавать смещенные результаты в различных положениях по оси Y.
sk: Niektoré sondy môžu mať systémové skreslenie, ktoré kazí výsledky sondy na určitých miestach hlavy nástroja. Napríklad, ak sa držiak sondy pri pohybe pozdĺž osi Y mierne nakloní, môže to viesť k tomu, že sonda bude hlásiť skreslené výsledky v rôznych polohách Y.

source: This is a common issue with probes on delta printers, however it can occur on all printers.
ru: Это распространенная проблема с датчиками на дельта-принтерах, однако она может возникать на всех принтерах.
sk: Toto je bežný problém so sondami na delta tlačiarňach, môže sa však vyskytnúť na všetkých tlačiarňach.

source: One can check for a location bias by using the `PROBE_CALIBRATE` command to measuring the probe z_offset at various X and Y locations. Ideally, the probe z_offset would be a constant value at every printer location.
ru: Проверить смещение местоположения можно с помощью команды `PROBE_CALIBRATE`, измеряющей смещение z_зонда в различных точках X и Y. В идеале смещение z_зонда должно быть постоянной величиной при любом расположении принтера.
sk: Je možné skontrolovať odchýlku polohy pomocou príkazu `PROBE_CALIBRATE` na meranie z_offsetu sondy na rôznych miestach X a Y. V ideálnom prípade by sonda z_offset mala konštantnú hodnotu na každom mieste tlačiarne.

source: For delta printers, try measuring the z_offset at a position near the A tower, at a position near the B tower, and at a position near the C tower. For cartesian, corexy, and similar printers, try measuring the z_offset at positions near the four corners of the bed.
ru: Для дельта-принтеров попробуйте измерить смещение z_offset в позиции около башни A, в позиции около башни B и в позиции около башни C. Для принтеров с картезианской, корексианской и аналогичными системами попробуйте измерить смещение z_ в точках, расположенных вблизи четырех углов станины.
sk: Pre delta tlačiarne skúste zmerať z_offset v polohe blízko veže A, v polohe blízko veže B a v polohe blízko veže C. V prípade kartézskych, korexových a podobných tlačiarní skúste zmerať z_offset v polohách blízko štyroch rohov postele.

source: Before starting this test, first calibrate the probe X, Y, and Z offsets as described at the beginning of this document. Then home the printer and navigate to the first XY position. Follow the steps at [calibrating probe Z offset](#calibrating-probe-z-offset) to run the `PROBE_CALIBRATE` command, `TESTZ` commands, and `ACCEPT` command, but do not run `SAVE_CONFIG`. Note the reported z_offset found. Then navigate to the other XY positions, repeat these `PROBE_CALIBRATE` steps, and note the reported z_offset.
ru: Перед началом этого теста сначала откалибруйте смещения датчиков по осям X, Y и Z, как описано в начале данного документа. Затем установите принтер в исходное положение и перейдите к первой позиции XY. Выполните шаги, описанные в разделе [калибровка Z-смещения зонда](#calibrating-probe-z-offset), чтобы выполнить команду `PROBE_CALIBRATE`, команды `TESTZ` и `ACCEPT`, но не выполняйте команду `SAVE_CONFIG`. Обратите внимание на найденное значение z_offset. Затем перейдите к другим позициям XY, повторите эти шаги `PROBE_CALIBRATE` и запишите полученное значение z_offset.
sk: Pred spustením tohto testu najskôr nakalibrujte ofsety X, Y a Z sondy, ako je popísané na začiatku tohto dokumentu. Potom umiestnite tlačiareň do pôvodnej polohy a prejdite na prvú pozíciu XY. Postupujte podľa krokov v časti [kalibrácia sondy Z offset](#calibrating-probe-z-offset) a spustite príkaz `PROBE_CALIBRATE`, príkazy `TESTZ` a príkaz `ACCEPT`, ale nespúšťajte `SAVE_CONFIG`. Všimnite si nájdený hlásený z_offset. Potom prejdite na ďalšie pozície XY, zopakujte tieto kroky „PROBE_CALIBRATE“ a zaznamenajte si nahlásený z_offset.

source: If the difference between the minimum reported z_offset and the maximum reported z_offset is greater than 25 microns (.025mm) then the probe is not suitable for typical bed leveling procedures. See the [Bed Level document](Bed_Level.md) for manual probe alternatives.
ru: Если разница между минимальным зарегистрированным смещением z_ и максимальным зарегистрированным смещением z_ превышает 25 микрон (.025 мм), то датчик не подходит для типичных процедур выравнивания слоя. Альтернативные варианты ручных датчиков см. в документе [Bed Level](Bed_Level.md).
sk: Ak je rozdiel medzi minimálnym zaznamenaným z_offsetom a maximálnym zaznamenaným z_offsetom väčší ako 25 mikrónov (0,025 mm), potom sonda nie je vhodná na typické postupy vyrovnávania lôžka. Alternatívy manuálnej sondy nájdete v [Bed Level document](Bed_Level.md).

source: Temperature Bias
ru: Температурная погрешность
sk: Teplotná odchýlka

source: Many probes have a systemic bias when probing at different temperatures. For example, the probe may consistently trigger at a lower height when the probe is at a higher temperature.
ru: Многие датчики имеют системное смещение при измерении различных температур. Например, при более высокой температуре зонд может постоянно срабатывать на меньшей высоте.
sk: Mnohé sondy majú systémovú odchýlku pri sondovaní pri rôznych teplotách. Napríklad, sonda sa môže konzistentne spúšťať v nižšej výške, keď má sonda vyššiu teplotu.

source: It is recommended to run the bed leveling tools at a consistent temperature to account for this bias. For example, either always run the tools when the printer is at room temperature, or always run the tools after the printer has obtained a consistent print temperature. In either case, it is a good idea to wait several minutes after the desired temperature is reached, so that the printer apparatus is consistently at the desired temperature.
ru: Для устранения этой погрешности рекомендуется запускать инструменты для выравнивания ложа при постоянной температуре. Например, либо всегда запускать инструменты, когда принтер находится при комнатной температуре, либо всегда запускать инструменты после того, как принтер достигнет постоянной температуры печати. В любом случае следует подождать несколько минут после достижения требуемой температуры, чтобы аппарат принтера постоянно находился при требуемой температуре.
sk: Odporúča sa spustiť nástroje na vyrovnávanie lôžka pri konštantnej teplote, aby sa zohľadnila táto odchýlka. Napríklad buď vždy spustite nástroje, keď má tlačiareň izbovú teplotu, alebo vždy spustite nástroje, keď tlačiareň dosiahne konzistentnú teplotu tlače. V každom prípade je dobré počkať niekoľko minút po dosiahnutí požadovanej teploty, aby bolo zariadenie tlačiarne trvalo na požadovanej teplote.

source: To check for a temperature bias, start with the printer at room temperature and then home the printer, move the head to a position near the center of the bed, and run the `PROBE_ACCURACY` command. Note the results. Then, without homing or disabling the stepper motors, heat the printer nozzle and bed to printing temperature, and run the `PROBE_ACCURACY` command again. Ideally, the command will report identical results. As above, if the probe does have a temperature bias then be careful to always use the probe at a consistent temperature.
ru: Чтобы проверить наличие температурного смещения, запустите принтер при комнатной температуре, затем переведите принтер в исходное положение, переместите головку в положение, близкое к центру станины, и выполните команду `PROBE_ACCURACY`. Заметьте результаты. Затем, не возвращая принтер в исходное положение и не отключая шаговые двигатели, нагрейте сопло и ложе принтера до температуры печати и снова выполните команду `PROBE_ACCURACY`. В идеале команда должна выдать идентичные результаты. Как указано выше, если датчик действительно имеет температурное смещение, то необходимо следить за тем, чтобы датчик всегда использовался при постоянной температуре.
sk: Ak chcete skontrolovať odchýlku teploty, začnite s tlačiarňou pri izbovej teplote a potom tlačiareň umiestnite do pôvodného stavu, posuňte hlavu do polohy blízko stredu lôžka a spustite príkaz „PROBE_ACCURACY“. Všimnite si výsledky. Potom bez navádzania alebo deaktivácie krokových motorov zohrejte trysku tlačiarne a lôžko na teplotu tlače a znova spustite príkaz `PROBE_ACCURACY`. V ideálnom prípade bude príkaz hlásiť rovnaké výsledky. Ako je uvedené vyššie, ak má sonda odchýlku teploty, dávajte pozor, aby ste sondu vždy používali pri konštantnej teplote.
