Repository: fran6p/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Protocol.po
Languages: sk

source: The Klipper messaging protocol is used for low-level communication between the Klipper host software and the Klipper micro-controller software. At a high level the protocol can be thought of as a series of command and response strings that are compressed, transmitted, and then processed at the receiving side. An example series of commands in uncompressed human-readable format might look like:
sk: Protokol správ Klipper sa používa na komunikáciu na nízkej úrovni medzi hostiteľským softvérom Klipper a softvérom mikrokontroléra Klipper. Na vysokej úrovni si protokol možno predstaviť ako sériu reťazcov príkazov a odpovedí, ktoré sú komprimované, prenášané a potom spracované na prijímacej strane. Príklad série príkazov v nekomprimovanom ľudsky čitateľnom formáte môže vyzerať takto:

source: See the [mcu commands](MCU_Commands.md) document for information on available commands. See the [debugging](Debugging.md) document for information on how to translate a G-Code file into its corresponding human-readable micro-controller commands.
sk: Informácie o dostupných príkazoch nájdete v dokumente [mcu commands](MCU_Commands.md). Pozrite si dokument [ladenie](Debugging.md), kde nájdete informácie o tom, ako preložiť súbor G-kódu do jeho zodpovedajúcich ľudsky čitateľných príkazov mikroovládača.

source: This page provides a high-level description of the Klipper messaging protocol itself. It describes how messages are declared, encoded in binary format (the "compression" scheme), and transmitted.
sk: Táto stránka poskytuje popis na vysokej úrovni samotného protokolu správ Klipper. Popisuje, ako sa správy deklarujú, kódujú v binárnom formáte (schéma „kompresie“) a ako sa prenášajú.

source: The goal of the protocol is to enable an error-free communication channel between the host and micro-controller that is low-latency, low-bandwidth, and low-complexity for the micro-controller.
sk: Cieľom protokolu je umožniť bezchybný komunikačný kanál medzi hostiteľom a mikrokontrolérom, ktorý má nízku latenciu, malú šírku pásma a nízku zložitosť pre mikrokontrolér.

source: Micro-controller Interface
sk: Rozhranie mikrokontroléra

source: The Klipper transmission protocol can be thought of as a [RPC](https://en.wikipedia.org/wiki/Remote_procedure_call) mechanism between micro-controller and host. The micro-controller software declares the commands that the host may invoke along with the response messages that it can generate. The host uses that information to command the micro-controller to perform actions and to interpret the results.
sk: Prenosový protokol Klipper si možno predstaviť ako mechanizmus [RPC](https://en.wikipedia.org/wiki/Remote_procedure_call) medzi mikroovládačom a hostiteľom. Softvér mikrokontroléra deklaruje príkazy, ktoré môže hostiteľ vyvolať, spolu so správami s odpoveďami, ktoré môže generovať. Hostiteľ používa tieto informácie na prikázanie mikrokontroléru, aby vykonal akcie a interpretoval výsledky.

source: Declaring commands
sk: Vyhlasovanie príkazov

source: The micro-controller software declares a "command" by using the DECL_COMMAND() macro in the C code. For example:
sk: Softvér mikrokontroléra deklaruje "príkaz" pomocou makra DECL_COMMAND() v kóde C. Napríklad:

source: The above declares a command named "update_digital_out". This allows the host to "invoke" this command which would cause the command_update_digital_out() C function to be executed in the micro-controller. The above also indicates that the command takes two integer parameters. When the command_update_digital_out() C code is executed, it will be passed an array containing these two integers - the first corresponding to the 'oid' and the second corresponding to the 'value'.
sk: Vyššie uvedené deklaruje príkaz s názvom "update_digital_out". To umožňuje hostiteľovi "vyvolať" tento príkaz, ktorý spôsobí, že sa v mikrokontroléri vykoná funkcia command_update_digital_out() C. Vyššie uvedené tiež naznačuje, že príkaz má dva celočíselné parametre. Keď sa vykoná kód command_update_digital_out() C, odovzdá sa pole obsahujúce tieto dve celé čísla - prvé zodpovedá 'oid' a druhé odpovedá 'hodnote'.

source: In general, the parameters are described with printf() style syntax (eg, "%u"). The formatting directly corresponds to the human-readable view of commands (eg, "update_digital_out oid=7 value=1"). In the above example, "value=" is a parameter name and "%c" indicates the parameter is an integer. Internally, the parameter name is only used as documentation. In this example, the "%c" is also used as documentation to indicate the expected integer is 1 byte in size (the declared integer size does not impact the parsing or encoding).
sk: Vo všeobecnosti sú parametre opísané syntaxou štýlu printf() (napr. "%u"). Formátovanie priamo zodpovedá ľudskému čitateľnému pohľadu na príkazy (napr. "update_digital_out oid=7 hodnota=1"). Vo vyššie uvedenom príklade je "value=" názov parametra a "%c" označuje, že parameter je celé číslo. Interne sa názov parametra používa iba ako dokumentácia. V tomto príklade sa "%c" používa aj ako dokumentácia na označenie očakávaného celého čísla s veľkosťou 1 bajtu (deklarovaná veľkosť celého čísla nemá vplyv na analýzu ani kódovanie).

source: The micro-controller build will collect all commands declared with DECL_COMMAND(), determine their parameters, and arrange for them to be callable.
sk: Zostava mikrokontroléra zhromaždí všetky príkazy deklarované pomocou DECL_COMMAND(), určí ich parametre a zariadi, aby boli volateľné.

source: Declaring responses
sk: Deklarovanie odpovedí

source: To send information from the micro-controller to the host a "response" is generated. These are both declared and transmitted using the sendf() C macro. For example:
sk: Na odoslanie informácií z mikroovládača hostiteľovi sa vygeneruje „odpoveď“. Tieto sú deklarované a prenášané pomocou makra sendf() C. Napríklad:

source: The above transmits a "status" response message that contains two integer parameters ("clock" and "status"). The micro-controller build automatically finds all sendf() calls and generates encoders for them. The first parameter of the sendf() function describes the response and it is in the same format as command declarations.
sk: Vyššie uvedené odošle správu s odpoveďou "stav", ktorá obsahuje dva celočíselné parametre ("hodiny" a "stav"). Zostava mikrokontroléra automaticky nájde všetky volania sendf() a vygeneruje pre ne kódovače. Prvý parameter funkcie sendf() popisuje odpoveď a je v rovnakom formáte ako deklarácie príkazov.

source: The host can arrange to register a callback function for each response. So, in effect, commands allow the host to invoke C functions in the micro-controller and responses allow the micro-controller software to invoke code in the host.
sk: Hostiteľ môže zariadiť registráciu funkcie spätného volania pre každú odpoveď. Takže v skutočnosti príkazy umožňujú hostiteľovi vyvolať funkcie C v mikrokontroléri a odpovede umožňujú softvéru mikrokontroléra vyvolať kód v hostiteľovi.

source: The sendf() macro should only be invoked from command or task handlers, and it should not be invoked from interrupts or timers. The code does not need to issue a sendf() in response to a received command, it is not limited in the number of times sendf() may be invoked, and it may invoke sendf() at any time from a task handler.
sk: Makro sendf() by malo byť vyvolané iba z príkazov alebo obsluhovačov úloh a nemalo by byť vyvolané z prerušení alebo časovačov. Kód nemusí vydávať sendf() ako odpoveď na prijatý príkaz, nie je obmedzený na počet vyvolaní sendf() a môže kedykoľvek vyvolať sendf() z obsluhy úlohy.

source: Output responses
sk: Výstupné odpovede

source: To simplify debugging, there is also an output() C function. For example:
sk: Na zjednodušenie ladenia existuje aj funkcia output() C. Napríklad:

source: The output() function is similar in usage to printf() - it is intended to generate and format arbitrary messages for human consumption.
sk: Funkcia output() sa používa podobne ako printf() – je určená na generovanie a formátovanie ľubovoľných správ pre ľudskú spotrebu.

source: Declaring enumerations
sk: Vyhlasovanie súpisov

source: Enumerations allow the host code to use string identifiers for parameters that the micro-controller handles as integers. They are declared in the micro-controller code - for example:
sk: Enumerácie umožňujú hostiteľskému kódu používať reťazcové identifikátory pre parametre, ktoré mikroovládač spracováva ako celé čísla. Sú deklarované v kóde mikrokontroléra - napríklad:

source: If the first example, the DECL_ENUMERATION() macro defines an enumeration for any command/response message with a parameter name of "spi_bus" or parameter name with a suffix of "_spi_bus". For those parameters the string "spi" is a valid value and it will be transmitted with an integer value of zero.
sk: V prvom príklade makro DECL_ENUMERATION() definuje enumeráciu pre ľubovoľnú správu s príkazom/odpoveďou s názvom parametra "spi_bus" alebo názvom parametra s príponou "_spi_bus". Pre tieto parametre je reťazec "spi" platnou hodnotou a bude prenášaný s celočíselnou hodnotou nula.

source: It's also possible to declare an enumeration range. In the second example, a "pin" parameter (or any parameter with a suffix of "_pin") would accept PC0, PC1, PC2, ..., PC7 as valid values. The strings will be transmitted with integers 16, 17, 18, ..., 23.
sk: Je tiež možné deklarovať rozsah enumerácie. V druhom príklade by parameter "pin" (alebo akýkoľvek parameter s príponou "_pin") akceptoval PC0, PC1, PC2, ..., PC7 ako platné hodnoty. Reťazce sa budú prenášať s celými číslami 16, 17, 18, ..., 23.

source: Declaring constants
sk: Deklarovanie konštánt

source: Constants can also be exported. For example, the following:
sk: Konštanty je možné aj exportovať. Napríklad nasledujúce:

source: would export a constant named "SERIAL_BAUD" with a value of 250000 from the micro-controller to the host. It is also possible to declare a constant that is a string - for example:
sk: exportuje konštantu s názvom "SERIAL_BAUD" s hodnotou 250 000 z mikrokontroléra do hostiteľa. Je tiež možné deklarovať konštantu, ktorá je reťazcom - napríklad:

source: Low-level message encoding
sk: Nízkoúrovňové kódovanie správ

source: To accomplish the above RPC mechanism, each command and response is encoded into a binary format for transmission. This section describes the transmission system.
sk: Aby sa dosiahol vyššie uvedený mechanizmus RPC, každý príkaz a odpoveď sú zakódované do binárneho formátu na prenos. Táto časť popisuje prenosový systém.

source: Message Blocks
sk: Bloky správ

source: All data sent from host to micro-controller and vice-versa are contained in "message blocks". A message block has a two byte header and a three byte trailer. The format of a message block is:
sk: Všetky údaje odoslané z hostiteľa do mikrokontroléra a naopak sú obsiahnuté v „blokoch správ“. Blok správ má dvojbajtovú hlavičku a trojbajtovú upútavku. Formát bloku správ je:

source: The length byte contains the number of bytes in the message block including the header and trailer bytes (thus the minimum message length is 5 bytes). The maximum message block length is currently 64 bytes. The sequence byte contains a 4 bit sequence number in the low-order bits and the high-order bits always contain 0x10 (the high-order bits are reserved for future use). The content bytes contain arbitrary data and its format is described in the following section. The crc bytes contain a 16bit CCITT [CRC](https://en.wikipedia.org/wiki/Cyclic_redundancy_check) of the message block including the header bytes but excluding the trailer bytes. The sync byte is 0x7e.
sk: Byte dĺžky obsahuje počet bajtov v bloku správy vrátane bajtov hlavičky a prívesku (minimálna dĺžka správy je teda 5 bajtov). Maximálna dĺžka bloku správ je momentálne 64 bajtov. Sekvenčný bajt obsahuje 4 bitové poradové číslo v bitoch nižšieho rádu a bity vyššieho rádu vždy obsahujú 0x10 (bity vyššieho rádu sú rezervované pre budúce použitie). Obsahové bajty obsahujú ľubovoľné údaje a ich formát je popísaný v nasledujúcej časti. Bajty crc obsahujú 16-bitový CCITT [CRC](https://en.wikipedia.org/wiki/Cyclic_redundancy_check) bloku správ vrátane bajtov hlavičky, ale bez bajtov upútavky. Synchronizačný bajt je 0x7e.

source: The format of the message block is inspired by [HDLC](https://en.wikipedia.org/wiki/High-Level_Data_Link_Control) message frames. Like in HDLC, the message block may optionally contain an additional sync character at the start of the block. Unlike in HDLC, a sync character is not exclusive to the framing and may be present in the message block content.
sk: Formát bloku správ je inšpirovaný rámcami správ [HDLC](https://en.wikipedia.org/wiki/High-Level_Data_Link_Control). Podobne ako v HDLC môže blok správ voliteľne obsahovať dodatočný synchronizačný znak na začiatku bloku. Na rozdiel od HDLC nie je synchronizačný znak exkluzívny pre rámovanie a môže byť prítomný v obsahu bloku správ.

source: Message Block Contents
sk: Obsah bloku správ

source: Each message block sent from host to micro-controller contains a series of zero or more message commands in its contents. Each command starts with a [Variable Length Quantity](#variable-length-quantities) (VLQ) encoded integer command-id followed by zero or more VLQ parameters for the given command.
sk: Každý blok správ odoslaný z hostiteľa do mikrokontroléra obsahuje vo svojom obsahu sériu nula alebo viacerých príkazov správ. Každý príkaz začína s [Variable Length Quantity](#variable-length-quantities) (VLQ) zakódovaným celým číslom príkazu-id, za ktorým nasleduje nula alebo viacero parametrov VLQ pre daný príkaz.

source: As an example, the following four commands might be placed in a single message block:
sk: Napríklad nasledujúce štyri príkazy môžu byť umiestnené v jednom bloku správ:

source: and encoded into the following eight VLQ integers:
sk: a zakódované do nasledujúcich ôsmich celých čísel VLQ:

source: In order to encode and parse the message contents, both the host and micro-controller must agree on the command ids and the number of parameters each command has. So, in the above example, both the host and micro-controller would know that "id_update_digital_out" is always followed by two parameters, and "id_get_config" and "id_get_clock" have zero parameters. The host and micro-controller share a "data dictionary" that maps the command descriptions (eg, "update_digital_out oid=%c value=%c") to their integer command-ids. When processing the data, the parser will know to expect a specific number of VLQ encoded parameters following a given command id.
sk: Aby bolo možné zakódovať a analyzovať obsah správy, hostiteľ aj mikrokontrolér sa musia dohodnúť na ID príkazov a počte parametrov, ktoré má každý príkaz. Takže vo vyššie uvedenom príklade by hostiteľ aj mikrokontrolér vedeli, že za „id_update_digital_out“ vždy nasledujú dva parametre a „id_get_config“ a „id_get_clock“ majú nulové parametre. Hostiteľ a mikrokontrolér zdieľajú "dátový slovník", ktorý mapuje popisy príkazov (napr. "update_digital_out oid=%c value=%c") na ich celočíselné ID príkazov. Pri spracovaní údajov bude syntaktický analyzátor vedieť, že má očakávať špecifický počet parametrov kódovaných VLQ po zadanom ID príkazu.

source: The message contents for blocks sent from micro-controller to host follow the same format. The identifiers in these messages are "response ids", but they serve the same purpose and follow the same encoding rules. In practice, message blocks sent from the micro-controller to the host never contain more than one response in the message block contents.
sk: Obsah správy pre bloky odoslané z mikrokontroléra hostiteľovi má rovnaký formát. Identifikátory v týchto správach sú „identifikátory odpovedí“, ale slúžia na rovnaký účel a riadia sa rovnakými pravidlami kódovania. V praxi bloky správ odoslané z mikrokontroléra hostiteľovi nikdy neobsahujú viac ako jednu odpoveď v obsahu bloku správ.

source: Variable Length Quantities
sk: Množstvo s premenlivou dĺžkou

source: See the [wikipedia article](https://en.wikipedia.org/wiki/Variable-length_quantity) for more information on the general format of VLQ encoded integers. Klipper uses an encoding scheme that supports both positive and negative integers. Integers close to zero use less bytes to encode and positive integers typically encode using less bytes than negative integers. The following table shows the number of bytes each integer takes to encode:
sk: Ďalšie informácie o všeobecnom formáte celých čísel kódovaných VLQ nájdete v [článku wikipedie](https://en.wikipedia.org/wiki/Variable-length_quantity). Klipper používa schému kódovania, ktorá podporuje kladné aj záporné celé čísla. Celé čísla blízke nule používajú na kódovanie menej bajtov a kladné celé čísla zvyčajne používajú menej bajtov ako záporné celé čísla. Nasledujúca tabuľka zobrazuje počet bajtov, ktoré každé celé číslo potrebuje na zakódovanie:

source: Integer
sk: Celé číslo

source: Encoded size
sk: Kódovaná veľkosť

source: Variable length strings
sk: Šnúrky s premenlivou dĺžkou

source: As an exception to the above encoding rules, if a parameter to a command or response is a dynamic string then the parameter is not encoded as a simple VLQ integer. Instead it is encoded by transmitting the length as a VLQ encoded integer followed by the contents itself:
sk: Ako výnimka z vyššie uvedených pravidiel kódovania, ak je parametrom príkazu alebo odpovede dynamický reťazec, potom parameter nie je zakódovaný ako jednoduché celé číslo VLQ. Namiesto toho sa kóduje prenosom dĺžky ako celého čísla zakódovaného VLQ, za ktorým nasleduje samotný obsah:

source: The command descriptions found in the data dictionary allow both the host and micro-controller to know which command parameters use simple VLQ encoding and which parameters use string encoding.
sk: Opisy príkazov nájdené v dátovom slovníku umožňujú hostiteľovi aj mikrokontroléru vedieť, ktoré parametre príkazu používajú jednoduché kódovanie VLQ a ktoré parametre používajú kódovanie reťazcov.

source: Data Dictionary
sk: Dátový slovník

source: In order for meaningful communications to be established between micro-controller and host, both sides must agree on a "data dictionary". This data dictionary contains the integer identifiers for commands and responses along with their descriptions.
sk: Aby sa medzi mikroovládačom a hostiteľom vytvorila zmysluplná komunikácia, obe strany sa musia dohodnúť na „slovníku údajov“. Tento dátový slovník obsahuje celočíselné identifikátory pre príkazy a odpovede spolu s ich popismi.

source: The micro-controller build uses the contents of DECL_COMMAND() and sendf() macros to generate the data dictionary. The build automatically assigns unique identifiers to each command and response. This system allows both the host and micro-controller code to seamlessly use descriptive human-readable names while still using minimal bandwidth.
sk: Zostava mikrokontroléra využíva obsah makier DECL_COMMAND() a sendf() na generovanie dátového slovníka. Zostava automaticky priraďuje jedinečné identifikátory každému príkazu a odpovedi. Tento systém umožňuje hostiteľskému kódu aj kódu mikrokontroléra bezproblémovo používať popisné mená čitateľné pre človeka pri použití minimálnej šírky pásma.

source: The host queries the data dictionary when it first connects to the micro-controller. Once the host downloads the data dictionary from the micro-controller, it uses that data dictionary to encode all commands and to parse all responses from the micro-controller. The host must therefore handle a dynamic data dictionary. However, to keep the micro-controller software simple, the micro-controller always uses its static (compiled in) data dictionary.
sk: Hostiteľ sa pri prvom pripojení k mikrokontroléru spýta na dátový slovník. Keď hostiteľ stiahne dátový slovník z mikroovládača, použije tento dátový slovník na zakódovanie všetkých príkazov a na analýzu všetkých odpovedí z mikroovládača. Hostiteľ preto musí spracovať dynamický dátový slovník. Aby bol softvér mikrokontroléra jednoduchý, mikrokontrolér vždy používa svoj statický (skompilovaný) dátový slovník.

source: The data dictionary is queried by sending "identify" commands to the micro-controller. The micro-controller will respond to each identify command with an "identify_response" message. Since these two commands are needed prior to obtaining the data dictionary, their integer ids and parameter types are hard-coded in both the micro-controller and the host. The "identify_response" response id is 0, the "identify" command id is 1. Other than having hard-coded ids the identify command and its response are declared and transmitted the same way as other commands and responses. No other command or response is hard-coded.
sk: Dátový slovník sa dotazuje odoslaním príkazov „identifikovať“ mikrokontroléru. Mikroovládač odpovie na každý identifikačný príkaz správou "identify_response". Keďže tieto dva príkazy sú potrebné pred získaním údajového slovníka, ich celočíselné identifikátory a typy parametrov sú pevne zakódované v mikrokontroléri aj hostiteľovi. Identifikátor odpovede "identify_response" je 0, ID príkazu "identify" je 1. Okrem pevne zakódovaných identifikátorov sa príkaz identifikuje a jeho odpoveď deklaruje a prenáša rovnakým spôsobom ako ostatné príkazy a odpovede. Žiadny iný príkaz alebo odpoveď nie je pevne zakódovaná.

source: The format of the transmitted data dictionary itself is a zlib compressed JSON string. The micro-controller build process generates the string, compresses it, and stores it in the text section of the micro-controller flash. The data dictionary can be much larger than the maximum message block size - the host downloads it by sending multiple identify commands requesting progressive chunks of the data dictionary. Once all chunks are obtained the host will assemble the chunks, uncompress the data, and parse the contents.
sk: Formát samotného slovníka prenášaných údajov je komprimovaný reťazec JSON zlib. Proces zostavovania mikrokontroléra vygeneruje reťazec, skomprimuje ho a uloží do textovej časti blesku mikrokontroléra. Dátový slovník môže byť oveľa väčší ako maximálna veľkosť bloku správ – hostiteľ ho stiahne odoslaním viacerých identifikačných príkazov požadujúcich progresívne časti dátového slovníka. Po získaní všetkých častí hostiteľ zostaví časti, dekomprimuje údaje a analyzuje obsah.

source: In addition to information on the communication protocol, the data dictionary also contains the software version, enumerations (as defined by DECL_ENUMERATION), and constants (as defined by DECL_CONSTANT).
sk: Okrem informácií o komunikačnom protokole obsahuje dátový slovník aj verziu softvéru, enumerácie (definované v DECL_ENUMERATION) a konštanty (definované v DECL_CONSTANT).

source: Message flow
sk: Tok správ

source: Message commands sent from host to micro-controller are intended to be error-free. The micro-controller will check the CRC and sequence numbers in each message block to ensure the commands are accurate and in-order. The micro-controller always processes message blocks in-order - should it receive a block out-of-order it will discard it and any other out-of-order blocks until it receives blocks with the correct sequencing.
sk: Príkazy správ odosielané z hostiteľa do mikrokontroléra majú byť bezchybné. Mikroovládač skontroluje CRC a poradové čísla v každom bloku správ, aby sa uistil, že príkazy sú presné a v poriadku. Mikrokontrolér vždy spracováva bloky správ v poradí - ak prijme blok mimo poradia, zahodí ho a všetky ostatné bloky mimo poradia, kým neprijme bloky so správnym poradím.
