Repository: fran6p/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Protocol.po
Languages: sk

source: The low-level host code implements an automatic retransmission system for lost and corrupt message blocks sent to the micro-controller. To facilitate this, the micro-controller transmits an "ack message block" after each successfully received message block. The host schedules a timeout after sending each block and it will retransmit should the timeout expire without receiving a corresponding "ack". In addition, if the micro-controller detects a corrupt or out-of-order block it may transmit a "nak message block" to facilitate fast retransmission.
sk: Nízkoúrovňový hostiteľský kód implementuje systém automatického opätovného prenosu stratených a poškodených blokov správ odoslaných do mikrokontroléra. Aby sa to uľahčilo, mikroovládač vysiela "blok správ na potvrdenie" po každom úspešne prijatom bloku správ. Hostiteľ naplánuje časový limit po odoslaní každého bloku a ak vyprší časový limit, odošle ho znova bez prijatia zodpovedajúceho "potvrdenia". Okrem toho, ak mikroovládač deteguje poškodený alebo nefunkčný blok, môže preniesť „blok správ“ na uľahčenie rýchleho opätovného prenosu.

source: An "ack" is a message block with empty content (ie, a 5 byte message block) and a sequence number greater than the last received host sequence number. A "nak" is a message block with empty content and a sequence number less than the last received host sequence number.
sk: "Potvrdenie" je blok správ s prázdnym obsahom (tj 5-bajtový blok správ) a poradovým číslom väčším ako posledné prijaté poradové číslo hostiteľa. "Nak" je blok správ s prázdnym obsahom a poradovým číslom menším ako posledné prijaté poradové číslo hostiteľa.

source: The protocol facilitates a "window" transmission system so that the host can have many outstanding message blocks in-flight at a time. (This is in addition to the many commands that may be present in a given message block.) This allows maximum bandwidth utilization even in the event of transmission latency. The timeout, retransmit, windowing, and ack mechanism are inspired by similar mechanisms in [TCP](https://en.wikipedia.org/wiki/Transmission_Control_Protocol).
sk: Protokol uľahčuje "okenný" prenosový systém, takže hostiteľ môže mať počas letu veľa nevyriešených blokov správ naraz. (Toto je doplnok k mnohým príkazom, ktoré môžu byť prítomné v danom bloku správ.) To umožňuje maximálne využitie šírky pásma aj v prípade oneskorenia prenosu. Mechanizmus časového limitu, opätovného prenosu, okna a potvrdenia sú inšpirované podobnými mechanizmami v [TCP](https://en.wikipedia.org/wiki/Transmission_Control_Protocol).

source: In the other direction, message blocks sent from micro-controller to host are designed to be error-free, but they do not have assured transmission. (Responses should not be corrupt, but they may go missing.) This is done to keep the implementation in the micro-controller simple. There is no automatic retransmission system for responses - the high-level code is expected to be capable of handling an occasional missing response (usually by re-requesting the content or setting up a recurring schedule of response transmission). The sequence number field in message blocks sent to the host is always one greater than the last received sequence number of message blocks received from the host. It is not used to track sequences of response message blocks.
sk: V opačnom smere sú bloky správ odosielané z mikrokontroléra hostiteľovi navrhnuté tak, aby boli bezchybné, ale nemajú zabezpečený prenos. (Odpovede by nemali byť poškodené, ale môžu sa stratiť.) Toto sa robí preto, aby bola implementácia v mikrokontroléri jednoduchá. Neexistuje žiadny systém automatického opakovaného prenosu odpovedí – očakáva sa, že kód vysokej úrovne bude schopný zvládnuť občasnú chýbajúcu odpoveď (zvyčajne opätovným vyžiadaním obsahu alebo nastavením opakujúceho sa plánu prenosu odpovedí). Pole poradového čísla v blokoch správ odoslaných hostiteľovi je vždy o jedno väčšie ako posledné prijaté poradové číslo blokov správ prijatých od hostiteľa. Nepoužíva sa na sledovanie sekvencií blokov správ odpovede.

source: set_digital_out pin=PA3 value=1 set_digital_out pin=PA7 value=1 schedule_digital_out oid=8 clock=4000000 value=0 queue_step oid=7 interval=7458 count=10 add=331 queue_step oid=7 interval=11717 count=4 add=1281
sk: set_digital_out pin=hodnota PA3=1 set_digital_out pin=hodnota PA7=1 schedule_digital_out oid=8 hodín=4000000 hodnota=0 queue_step oid=7 interval=7458 count=10 add=331 queue_step oid=7 interval=11717 count=4 add=1281

source: DECL_COMMAND(command_update_digital_out, "update_digital_out oid=%c value=%c");
sk: DECL_COMMAND(command_update_digital_out, "update_digital_out oid=%c hodnota=%c");

source: Protocol
sk: Protokol
