Repository: fran6p/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/Sponsors.po
Languages: ru

source: Sponsors
ru: Спонсировать

source: Klipper is Free Software. We depend on the generous support from sponsors. Please consider sponsoring Klipper or supporting our sponsors.
ru: Klipper - это свободное программное обеспечение. Мы зависим от щедрой поддержки спонсоров. Пожалуйста, подумайте о спонсировании Klipper или поддержке наших спонсоров.

source: BIGTREETECH is the official mainboard sponsor of Klipper. BIGTREETECH is committed to developing innovative and competitive products to serve the 3D printing community better. Follow them on [Facebook](https://www.facebook.com/BIGTREETECH) or [Twitter](https://twitter.com/BigTreeTech).
ru: Компания BIGTREETECH является официальным спонсором Klipper. Компания BIGTREETECH стремится разрабатывать инновационные и конкурентоспособные продукты, чтобы лучше служить сообществу 3D-печати. Следите за ними на [Facebook](https://www.facebook.com/BIGTREETECH) или [Twitter](https://twitter.com/BigTreeTech).

source: Klipper Developers
ru: Разработчики Klipper

source: Kevin O'Connor
ru: Кевин О'Коннор

source: Eric Callahan
ru: Эрик Каллахан

source: Eric is the author of bed_mesh, spi_flash, and several other Klipper modules. Eric has a donations page at: <https://ko-fi.com/arksine>
ru: Эрик является автором bed_mesh, spi_flash и ряда других модулей Klipper. У Эрика есть страница для пожертвований по адресу: <https://ko-fi.com/arksine>

source: Related Klipper Projects
ru: Связанные проекты Klipper

source: Klipper is frequently used with other Free Software. Consider using or supporting these projects.
ru: Klipper часто используется вместе с другими свободными программами. Рассмотрите возможность использования или поддержки этих проектов.

source: [Moonraker](https://github.com/Arksine/moonraker)
ru: [Лунный гонщик](https://github.com/Arksine/moonraker)

source: [Mainsail](https://github.com/mainsail-crew/mainsail)
ru: [Грот](https://github.com/mainsail-crew/mainsail)

source: Kevin is the original author and current maintainer of Klipper. Donate at: <https://ko-fi.com/koconnor> or <https://www.patreon.com/koconnor>
ru: Кевин - оригинальный автор и текущий сопровождающий Klipper. Пожертвовать можно по адресу: <https://ko-fi.com/koconnor> или <https://www.patreon.com/koconnor>
